brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
/******************************************************************************
*  Filename:       hw_gpram_h
*  Revised:        2017-05-06 20:38:09 +0200 (Sat, 06 May 2017)
*  Revision:       48921
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_GPRAM_H__
#define __HW_GPRAM_H__

//*****************************************************************************
//
// This section defines the register offsets of
// GPRAM component
//
//*****************************************************************************
// 8kB RAM
#define GPRAM_O_BANK00                                              0x00000000

// 8kB RAM
#define GPRAM_O_BANK01                                              0x00000004

// 8kB RAM
#define GPRAM_O_BANK02                                              0x00000008

// 8kB RAM
#define GPRAM_O_BANK03                                              0x0000000C

// 8kB RAM
#define GPRAM_O_BANK04                                              0x00000010

// 8kB RAM
#define GPRAM_O_BANK05                                              0x00000014

// 8kB RAM
#define GPRAM_O_BANK06                                              0x00000018

// 8kB RAM
#define GPRAM_O_BANK07                                              0x0000001C

// 8kB RAM
#define GPRAM_O_BANK08                                              0x00000020

// 8kB RAM
#define GPRAM_O_BANK09                                              0x00000024

// 8kB RAM
#define GPRAM_O_BANK010                                             0x00000028

// 8kB RAM
#define GPRAM_O_BANK011                                             0x0000002C

// 8kB RAM
#define GPRAM_O_BANK012                                             0x00000030

// 8kB RAM
#define GPRAM_O_BANK013                                             0x00000034

// 8kB RAM
#define GPRAM_O_BANK014                                             0x00000038

// 8kB RAM
#define GPRAM_O_BANK015                                             0x0000003C

// 8kB RAM
#define GPRAM_O_BANK016                                             0x00000040

// 8kB RAM
#define GPRAM_O_BANK017                                             0x00000044

// 8kB RAM
#define GPRAM_O_BANK018                                             0x00000048

// 8kB RAM
#define GPRAM_O_BANK019                                             0x0000004C

// 8kB RAM
#define GPRAM_O_BANK020                                             0x00000050

// 8kB RAM
#define GPRAM_O_BANK021                                             0x00000054

// 8kB RAM
#define GPRAM_O_BANK022                                             0x00000058

// 8kB RAM
#define GPRAM_O_BANK023                                             0x0000005C

// 8kB RAM
#define GPRAM_O_BANK024                                             0x00000060

// 8kB RAM
#define GPRAM_O_BANK025                                             0x00000064

// 8kB RAM
#define GPRAM_O_BANK026                                             0x00000068

// 8kB RAM
#define GPRAM_O_BANK027                                             0x0000006C

// 8kB RAM
#define GPRAM_O_BANK028                                             0x00000070

// 8kB RAM
#define GPRAM_O_BANK029                                             0x00000074

// 8kB RAM
#define GPRAM_O_BANK030                                             0x00000078

// 8kB RAM
#define GPRAM_O_BANK031                                             0x0000007C

// 8kB RAM
#define GPRAM_O_BANK032                                             0x00000080

// 8kB RAM
#define GPRAM_O_BANK033                                             0x00000084

// 8kB RAM
#define GPRAM_O_BANK034                                             0x00000088

// 8kB RAM
#define GPRAM_O_BANK035                                             0x0000008C

// 8kB RAM
#define GPRAM_O_BANK036                                             0x00000090

// 8kB RAM
#define GPRAM_O_BANK037                                             0x00000094

// 8kB RAM
#define GPRAM_O_BANK038                                             0x00000098

// 8kB RAM
#define GPRAM_O_BANK039                                             0x0000009C

// 8kB RAM
#define GPRAM_O_BANK040                                             0x000000A0

// 8kB RAM
#define GPRAM_O_BANK041                                             0x000000A4

// 8kB RAM
#define GPRAM_O_BANK042                                             0x000000A8

// 8kB RAM
#define GPRAM_O_BANK043                                             0x000000AC

// 8kB RAM
#define GPRAM_O_BANK044                                             0x000000B0

// 8kB RAM
#define GPRAM_O_BANK045                                             0x000000B4

// 8kB RAM
#define GPRAM_O_BANK046                                             0x000000B8

// 8kB RAM
#define GPRAM_O_BANK047                                             0x000000BC

// 8kB RAM
#define GPRAM_O_BANK048                                             0x000000C0

// 8kB RAM
#define GPRAM_O_BANK049                                             0x000000C4

// 8kB RAM
#define GPRAM_O_BANK050                                             0x000000C8

// 8kB RAM
#define GPRAM_O_BANK051                                             0x000000CC

// 8kB RAM
#define GPRAM_O_BANK052                                             0x000000D0

// 8kB RAM
#define GPRAM_O_BANK053                                             0x000000D4

// 8kB RAM
#define GPRAM_O_BANK054                                             0x000000D8

// 8kB RAM
#define GPRAM_O_BANK055                                             0x000000DC

// 8kB RAM
#define GPRAM_O_BANK056                                             0x000000E0

// 8kB RAM
#define GPRAM_O_BANK057                                             0x000000E4

// 8kB RAM
#define GPRAM_O_BANK058                                             0x000000E8

// 8kB RAM
#define GPRAM_O_BANK059                                             0x000000EC

// 8kB RAM
#define GPRAM_O_BANK060                                             0x000000F0

// 8kB RAM
#define GPRAM_O_BANK061                                             0x000000F4

// 8kB RAM
#define GPRAM_O_BANK062                                             0x000000F8

// 8kB RAM
#define GPRAM_O_BANK063                                             0x000000FC

// 8kB RAM
#define GPRAM_O_BANK064                                             0x00000100

// 8kB RAM
#define GPRAM_O_BANK065                                             0x00000104

// 8kB RAM
#define GPRAM_O_BANK066                                             0x00000108

// 8kB RAM
#define GPRAM_O_BANK067                                             0x0000010C

// 8kB RAM
#define GPRAM_O_BANK068                                             0x00000110

// 8kB RAM
#define GPRAM_O_BANK069                                             0x00000114

// 8kB RAM
#define GPRAM_O_BANK070                                             0x00000118

// 8kB RAM
#define GPRAM_O_BANK071                                             0x0000011C

// 8kB RAM
#define GPRAM_O_BANK072                                             0x00000120

// 8kB RAM
#define GPRAM_O_BANK073                                             0x00000124

// 8kB RAM
#define GPRAM_O_BANK074                                             0x00000128

// 8kB RAM
#define GPRAM_O_BANK075                                             0x0000012C

// 8kB RAM
#define GPRAM_O_BANK076                                             0x00000130

// 8kB RAM
#define GPRAM_O_BANK077                                             0x00000134

// 8kB RAM
#define GPRAM_O_BANK078                                             0x00000138

// 8kB RAM
#define GPRAM_O_BANK079                                             0x0000013C

// 8kB RAM
#define GPRAM_O_BANK080                                             0x00000140

// 8kB RAM
#define GPRAM_O_BANK081                                             0x00000144

// 8kB RAM
#define GPRAM_O_BANK082                                             0x00000148

// 8kB RAM
#define GPRAM_O_BANK083                                             0x0000014C

// 8kB RAM
#define GPRAM_O_BANK084                                             0x00000150

// 8kB RAM
#define GPRAM_O_BANK085                                             0x00000154

// 8kB RAM
#define GPRAM_O_BANK086                                             0x00000158

// 8kB RAM
#define GPRAM_O_BANK087                                             0x0000015C

// 8kB RAM
#define GPRAM_O_BANK088                                             0x00000160

// 8kB RAM
#define GPRAM_O_BANK089                                             0x00000164

// 8kB RAM
#define GPRAM_O_BANK090                                             0x00000168

// 8kB RAM
#define GPRAM_O_BANK091                                             0x0000016C

// 8kB RAM
#define GPRAM_O_BANK092                                             0x00000170

// 8kB RAM
#define GPRAM_O_BANK093                                             0x00000174

// 8kB RAM
#define GPRAM_O_BANK094                                             0x00000178

// 8kB RAM
#define GPRAM_O_BANK095                                             0x0000017C

// 8kB RAM
#define GPRAM_O_BANK096                                             0x00000180

// 8kB RAM
#define GPRAM_O_BANK097                                             0x00000184

// 8kB RAM
#define GPRAM_O_BANK098                                             0x00000188

// 8kB RAM
#define GPRAM_O_BANK099                                             0x0000018C

// 8kB RAM
#define GPRAM_O_BANK0100                                            0x00000190

// 8kB RAM
#define GPRAM_O_BANK0101                                            0x00000194

// 8kB RAM
#define GPRAM_O_BANK0102                                            0x00000198

// 8kB RAM
#define GPRAM_O_BANK0103                                            0x0000019C

// 8kB RAM
#define GPRAM_O_BANK0104                                            0x000001A0

// 8kB RAM
#define GPRAM_O_BANK0105                                            0x000001A4

// 8kB RAM
#define GPRAM_O_BANK0106                                            0x000001A8

// 8kB RAM
#define GPRAM_O_BANK0107                                            0x000001AC

// 8kB RAM
#define GPRAM_O_BANK0108                                            0x000001B0

// 8kB RAM
#define GPRAM_O_BANK0109                                            0x000001B4

// 8kB RAM
#define GPRAM_O_BANK0110                                            0x000001B8

// 8kB RAM
#define GPRAM_O_BANK0111                                            0x000001BC

// 8kB RAM
#define GPRAM_O_BANK0112                                            0x000001C0

// 8kB RAM
#define GPRAM_O_BANK0113                                            0x000001C4

// 8kB RAM
#define GPRAM_O_BANK0114                                            0x000001C8

// 8kB RAM
#define GPRAM_O_BANK0115                                            0x000001CC

// 8kB RAM
#define GPRAM_O_BANK0116                                            0x000001D0

// 8kB RAM
#define GPRAM_O_BANK0117                                            0x000001D4

// 8kB RAM
#define GPRAM_O_BANK0118                                            0x000001D8

// 8kB RAM
#define GPRAM_O_BANK0119                                            0x000001DC

// 8kB RAM
#define GPRAM_O_BANK0120                                            0x000001E0

// 8kB RAM
#define GPRAM_O_BANK0121                                            0x000001E4

// 8kB RAM
#define GPRAM_O_BANK0122                                            0x000001E8

// 8kB RAM
#define GPRAM_O_BANK0123                                            0x000001EC

// 8kB RAM
#define GPRAM_O_BANK0124                                            0x000001F0

// 8kB RAM
#define GPRAM_O_BANK0125                                            0x000001F4

// 8kB RAM
#define GPRAM_O_BANK0126                                            0x000001F8

// 8kB RAM
#define GPRAM_O_BANK0127                                            0x000001FC

// 8kB RAM
#define GPRAM_O_BANK0128                                            0x00000200

// 8kB RAM
#define GPRAM_O_BANK0129                                            0x00000204

// 8kB RAM
#define GPRAM_O_BANK0130                                            0x00000208

// 8kB RAM
#define GPRAM_O_BANK0131                                            0x0000020C

// 8kB RAM
#define GPRAM_O_BANK0132                                            0x00000210

// 8kB RAM
#define GPRAM_O_BANK0133                                            0x00000214

// 8kB RAM
#define GPRAM_O_BANK0134                                            0x00000218

// 8kB RAM
#define GPRAM_O_BANK0135                                            0x0000021C

// 8kB RAM
#define GPRAM_O_BANK0136                                            0x00000220

// 8kB RAM
#define GPRAM_O_BANK0137                                            0x00000224

// 8kB RAM
#define GPRAM_O_BANK0138                                            0x00000228

// 8kB RAM
#define GPRAM_O_BANK0139                                            0x0000022C

// 8kB RAM
#define GPRAM_O_BANK0140                                            0x00000230

// 8kB RAM
#define GPRAM_O_BANK0141                                            0x00000234

// 8kB RAM
#define GPRAM_O_BANK0142                                            0x00000238

// 8kB RAM
#define GPRAM_O_BANK0143                                            0x0000023C

// 8kB RAM
#define GPRAM_O_BANK0144                                            0x00000240

// 8kB RAM
#define GPRAM_O_BANK0145                                            0x00000244

// 8kB RAM
#define GPRAM_O_BANK0146                                            0x00000248

// 8kB RAM
#define GPRAM_O_BANK0147                                            0x0000024C

// 8kB RAM
#define GPRAM_O_BANK0148                                            0x00000250

// 8kB RAM
#define GPRAM_O_BANK0149                                            0x00000254

// 8kB RAM
#define GPRAM_O_BANK0150                                            0x00000258

// 8kB RAM
#define GPRAM_O_BANK0151                                            0x0000025C

// 8kB RAM
#define GPRAM_O_BANK0152                                            0x00000260

// 8kB RAM
#define GPRAM_O_BANK0153                                            0x00000264

// 8kB RAM
#define GPRAM_O_BANK0154                                            0x00000268

// 8kB RAM
#define GPRAM_O_BANK0155                                            0x0000026C

// 8kB RAM
#define GPRAM_O_BANK0156                                            0x00000270

// 8kB RAM
#define GPRAM_O_BANK0157                                            0x00000274

// 8kB RAM
#define GPRAM_O_BANK0158                                            0x00000278

// 8kB RAM
#define GPRAM_O_BANK0159                                            0x0000027C

// 8kB RAM
#define GPRAM_O_BANK0160                                            0x00000280

// 8kB RAM
#define GPRAM_O_BANK0161                                            0x00000284

// 8kB RAM
#define GPRAM_O_BANK0162                                            0x00000288

// 8kB RAM
#define GPRAM_O_BANK0163                                            0x0000028C

// 8kB RAM
#define GPRAM_O_BANK0164                                            0x00000290

// 8kB RAM
#define GPRAM_O_BANK0165                                            0x00000294

// 8kB RAM
#define GPRAM_O_BANK0166                                            0x00000298

// 8kB RAM
#define GPRAM_O_BANK0167                                            0x0000029C

// 8kB RAM
#define GPRAM_O_BANK0168                                            0x000002A0

// 8kB RAM
#define GPRAM_O_BANK0169                                            0x000002A4

// 8kB RAM
#define GPRAM_O_BANK0170                                            0x000002A8

// 8kB RAM
#define GPRAM_O_BANK0171                                            0x000002AC

// 8kB RAM
#define GPRAM_O_BANK0172                                            0x000002B0

// 8kB RAM
#define GPRAM_O_BANK0173                                            0x000002B4

// 8kB RAM
#define GPRAM_O_BANK0174                                            0x000002B8

// 8kB RAM
#define GPRAM_O_BANK0175                                            0x000002BC

// 8kB RAM
#define GPRAM_O_BANK0176                                            0x000002C0

// 8kB RAM
#define GPRAM_O_BANK0177                                            0x000002C4

// 8kB RAM
#define GPRAM_O_BANK0178                                            0x000002C8

// 8kB RAM
#define GPRAM_O_BANK0179                                            0x000002CC

// 8kB RAM
#define GPRAM_O_BANK0180                                            0x000002D0

// 8kB RAM
#define GPRAM_O_BANK0181                                            0x000002D4

// 8kB RAM
#define GPRAM_O_BANK0182                                            0x000002D8

// 8kB RAM
#define GPRAM_O_BANK0183                                            0x000002DC

// 8kB RAM
#define GPRAM_O_BANK0184                                            0x000002E0

// 8kB RAM
#define GPRAM_O_BANK0185                                            0x000002E4

// 8kB RAM
#define GPRAM_O_BANK0186                                            0x000002E8

// 8kB RAM
#define GPRAM_O_BANK0187                                            0x000002EC

// 8kB RAM
#define GPRAM_O_BANK0188                                            0x000002F0

// 8kB RAM
#define GPRAM_O_BANK0189                                            0x000002F4

// 8kB RAM
#define GPRAM_O_BANK0190                                            0x000002F8

// 8kB RAM
#define GPRAM_O_BANK0191                                            0x000002FC

// 8kB RAM
#define GPRAM_O_BANK0192                                            0x00000300

// 8kB RAM
#define GPRAM_O_BANK0193                                            0x00000304

// 8kB RAM
#define GPRAM_O_BANK0194                                            0x00000308

// 8kB RAM
#define GPRAM_O_BANK0195                                            0x0000030C

// 8kB RAM
#define GPRAM_O_BANK0196                                            0x00000310

// 8kB RAM
#define GPRAM_O_BANK0197                                            0x00000314

// 8kB RAM
#define GPRAM_O_BANK0198                                            0x00000318

// 8kB RAM
#define GPRAM_O_BANK0199                                            0x0000031C

// 8kB RAM
#define GPRAM_O_BANK0200                                            0x00000320

// 8kB RAM
#define GPRAM_O_BANK0201                                            0x00000324

// 8kB RAM
#define GPRAM_O_BANK0202                                            0x00000328

// 8kB RAM
#define GPRAM_O_BANK0203                                            0x0000032C

// 8kB RAM
#define GPRAM_O_BANK0204                                            0x00000330

// 8kB RAM
#define GPRAM_O_BANK0205                                            0x00000334

// 8kB RAM
#define GPRAM_O_BANK0206                                            0x00000338

// 8kB RAM
#define GPRAM_O_BANK0207                                            0x0000033C

// 8kB RAM
#define GPRAM_O_BANK0208                                            0x00000340

// 8kB RAM
#define GPRAM_O_BANK0209                                            0x00000344

// 8kB RAM
#define GPRAM_O_BANK0210                                            0x00000348

// 8kB RAM
#define GPRAM_O_BANK0211                                            0x0000034C

// 8kB RAM
#define GPRAM_O_BANK0212                                            0x00000350

// 8kB RAM
#define GPRAM_O_BANK0213                                            0x00000354

// 8kB RAM
#define GPRAM_O_BANK0214                                            0x00000358

// 8kB RAM
#define GPRAM_O_BANK0215                                            0x0000035C

// 8kB RAM
#define GPRAM_O_BANK0216                                            0x00000360

// 8kB RAM
#define GPRAM_O_BANK0217                                            0x00000364

// 8kB RAM
#define GPRAM_O_BANK0218                                            0x00000368

// 8kB RAM
#define GPRAM_O_BANK0219                                            0x0000036C

// 8kB RAM
#define GPRAM_O_BANK0220                                            0x00000370

// 8kB RAM
#define GPRAM_O_BANK0221                                            0x00000374

// 8kB RAM
#define GPRAM_O_BANK0222                                            0x00000378

// 8kB RAM
#define GPRAM_O_BANK0223                                            0x0000037C

// 8kB RAM
#define GPRAM_O_BANK0224                                            0x00000380

// 8kB RAM
#define GPRAM_O_BANK0225                                            0x00000384

// 8kB RAM
#define GPRAM_O_BANK0226                                            0x00000388

// 8kB RAM
#define GPRAM_O_BANK0227                                            0x0000038C

// 8kB RAM
#define GPRAM_O_BANK0228                                            0x00000390

// 8kB RAM
#define GPRAM_O_BANK0229                                            0x00000394

// 8kB RAM
#define GPRAM_O_BANK0230                                            0x00000398

// 8kB RAM
#define GPRAM_O_BANK0231                                            0x0000039C

// 8kB RAM
#define GPRAM_O_BANK0232                                            0x000003A0

// 8kB RAM
#define GPRAM_O_BANK0233                                            0x000003A4

// 8kB RAM
#define GPRAM_O_BANK0234                                            0x000003A8

// 8kB RAM
#define GPRAM_O_BANK0235                                            0x000003AC

// 8kB RAM
#define GPRAM_O_BANK0236                                            0x000003B0

// 8kB RAM
#define GPRAM_O_BANK0237                                            0x000003B4

// 8kB RAM
#define GPRAM_O_BANK0238                                            0x000003B8

// 8kB RAM
#define GPRAM_O_BANK0239                                            0x000003BC

