brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
// 8kB RAM
#define GPRAM_O_BANK0240                                            0x000003C0

// 8kB RAM
#define GPRAM_O_BANK0241                                            0x000003C4

// 8kB RAM
#define GPRAM_O_BANK0242                                            0x000003C8

// 8kB RAM
#define GPRAM_O_BANK0243                                            0x000003CC

// 8kB RAM
#define GPRAM_O_BANK0244                                            0x000003D0

// 8kB RAM
#define GPRAM_O_BANK0245                                            0x000003D4

// 8kB RAM
#define GPRAM_O_BANK0246                                            0x000003D8

// 8kB RAM
#define GPRAM_O_BANK0247                                            0x000003DC

// 8kB RAM
#define GPRAM_O_BANK0248                                            0x000003E0

// 8kB RAM
#define GPRAM_O_BANK0249                                            0x000003E4

// 8kB RAM
#define GPRAM_O_BANK0250                                            0x000003E8

// 8kB RAM
#define GPRAM_O_BANK0251                                            0x000003EC

// 8kB RAM
#define GPRAM_O_BANK0252                                            0x000003F0

// 8kB RAM
#define GPRAM_O_BANK0253                                            0x000003F4

// 8kB RAM
#define GPRAM_O_BANK0254                                            0x000003F8

// 8kB RAM
#define GPRAM_O_BANK0255                                            0x000003FC

// 8kB RAM
#define GPRAM_O_BANK0256                                            0x00000400

// 8kB RAM
#define GPRAM_O_BANK0257                                            0x00000404

// 8kB RAM
#define GPRAM_O_BANK0258                                            0x00000408

// 8kB RAM
#define GPRAM_O_BANK0259                                            0x0000040C

// 8kB RAM
#define GPRAM_O_BANK0260                                            0x00000410

// 8kB RAM
#define GPRAM_O_BANK0261                                            0x00000414

// 8kB RAM
#define GPRAM_O_BANK0262                                            0x00000418

// 8kB RAM
#define GPRAM_O_BANK0263                                            0x0000041C

// 8kB RAM
#define GPRAM_O_BANK0264                                            0x00000420

// 8kB RAM
#define GPRAM_O_BANK0265                                            0x00000424

// 8kB RAM
#define GPRAM_O_BANK0266                                            0x00000428

// 8kB RAM
#define GPRAM_O_BANK0267                                            0x0000042C

// 8kB RAM
#define GPRAM_O_BANK0268                                            0x00000430

// 8kB RAM
#define GPRAM_O_BANK0269                                            0x00000434

// 8kB RAM
#define GPRAM_O_BANK0270                                            0x00000438

// 8kB RAM
#define GPRAM_O_BANK0271                                            0x0000043C

// 8kB RAM
#define GPRAM_O_BANK0272                                            0x00000440

// 8kB RAM
#define GPRAM_O_BANK0273                                            0x00000444

// 8kB RAM
#define GPRAM_O_BANK0274                                            0x00000448

// 8kB RAM
#define GPRAM_O_BANK0275                                            0x0000044C

// 8kB RAM
#define GPRAM_O_BANK0276                                            0x00000450

// 8kB RAM
#define GPRAM_O_BANK0277                                            0x00000454

// 8kB RAM
#define GPRAM_O_BANK0278                                            0x00000458

// 8kB RAM
#define GPRAM_O_BANK0279                                            0x0000045C

// 8kB RAM
#define GPRAM_O_BANK0280                                            0x00000460

// 8kB RAM
#define GPRAM_O_BANK0281                                            0x00000464

// 8kB RAM
#define GPRAM_O_BANK0282                                            0x00000468

// 8kB RAM
#define GPRAM_O_BANK0283                                            0x0000046C

// 8kB RAM
#define GPRAM_O_BANK0284                                            0x00000470

// 8kB RAM
#define GPRAM_O_BANK0285                                            0x00000474

// 8kB RAM
#define GPRAM_O_BANK0286                                            0x00000478

// 8kB RAM
#define GPRAM_O_BANK0287                                            0x0000047C

// 8kB RAM
#define GPRAM_O_BANK0288                                            0x00000480

// 8kB RAM
#define GPRAM_O_BANK0289                                            0x00000484

// 8kB RAM
#define GPRAM_O_BANK0290                                            0x00000488

// 8kB RAM
#define GPRAM_O_BANK0291                                            0x0000048C

// 8kB RAM
#define GPRAM_O_BANK0292                                            0x00000490

// 8kB RAM
#define GPRAM_O_BANK0293                                            0x00000494

// 8kB RAM
#define GPRAM_O_BANK0294                                            0x00000498

// 8kB RAM
#define GPRAM_O_BANK0295                                            0x0000049C

// 8kB RAM
#define GPRAM_O_BANK0296                                            0x000004A0

// 8kB RAM
#define GPRAM_O_BANK0297                                            0x000004A4

// 8kB RAM
#define GPRAM_O_BANK0298                                            0x000004A8

// 8kB RAM
#define GPRAM_O_BANK0299                                            0x000004AC

// 8kB RAM
#define GPRAM_O_BANK0300                                            0x000004B0

// 8kB RAM
#define GPRAM_O_BANK0301                                            0x000004B4

// 8kB RAM
#define GPRAM_O_BANK0302                                            0x000004B8

// 8kB RAM
#define GPRAM_O_BANK0303                                            0x000004BC

// 8kB RAM
#define GPRAM_O_BANK0304                                            0x000004C0

// 8kB RAM
#define GPRAM_O_BANK0305                                            0x000004C4

// 8kB RAM
#define GPRAM_O_BANK0306                                            0x000004C8

// 8kB RAM
#define GPRAM_O_BANK0307                                            0x000004CC

// 8kB RAM
#define GPRAM_O_BANK0308                                            0x000004D0

// 8kB RAM
#define GPRAM_O_BANK0309                                            0x000004D4

// 8kB RAM
#define GPRAM_O_BANK0310                                            0x000004D8

// 8kB RAM
#define GPRAM_O_BANK0311                                            0x000004DC

// 8kB RAM
#define GPRAM_O_BANK0312                                            0x000004E0

// 8kB RAM
#define GPRAM_O_BANK0313                                            0x000004E4

// 8kB RAM
#define GPRAM_O_BANK0314                                            0x000004E8

// 8kB RAM
#define GPRAM_O_BANK0315                                            0x000004EC

// 8kB RAM
#define GPRAM_O_BANK0316                                            0x000004F0

// 8kB RAM
#define GPRAM_O_BANK0317                                            0x000004F4

// 8kB RAM
#define GPRAM_O_BANK0318                                            0x000004F8

// 8kB RAM
#define GPRAM_O_BANK0319                                            0x000004FC

// 8kB RAM
#define GPRAM_O_BANK0320                                            0x00000500

// 8kB RAM
#define GPRAM_O_BANK0321                                            0x00000504

// 8kB RAM
#define GPRAM_O_BANK0322                                            0x00000508

// 8kB RAM
#define GPRAM_O_BANK0323                                            0x0000050C

// 8kB RAM
#define GPRAM_O_BANK0324                                            0x00000510

// 8kB RAM
#define GPRAM_O_BANK0325                                            0x00000514

// 8kB RAM
#define GPRAM_O_BANK0326                                            0x00000518

// 8kB RAM
#define GPRAM_O_BANK0327                                            0x0000051C

// 8kB RAM
#define GPRAM_O_BANK0328                                            0x00000520

// 8kB RAM
#define GPRAM_O_BANK0329                                            0x00000524

// 8kB RAM
#define GPRAM_O_BANK0330                                            0x00000528

// 8kB RAM
#define GPRAM_O_BANK0331                                            0x0000052C

// 8kB RAM
#define GPRAM_O_BANK0332                                            0x00000530

// 8kB RAM
#define GPRAM_O_BANK0333                                            0x00000534

// 8kB RAM
#define GPRAM_O_BANK0334                                            0x00000538

// 8kB RAM
#define GPRAM_O_BANK0335                                            0x0000053C

// 8kB RAM
#define GPRAM_O_BANK0336                                            0x00000540

// 8kB RAM
#define GPRAM_O_BANK0337                                            0x00000544

// 8kB RAM
#define GPRAM_O_BANK0338                                            0x00000548

// 8kB RAM
#define GPRAM_O_BANK0339                                            0x0000054C

// 8kB RAM
#define GPRAM_O_BANK0340                                            0x00000550

// 8kB RAM
#define GPRAM_O_BANK0341                                            0x00000554

// 8kB RAM
#define GPRAM_O_BANK0342                                            0x00000558

// 8kB RAM
#define GPRAM_O_BANK0343                                            0x0000055C

// 8kB RAM
#define GPRAM_O_BANK0344                                            0x00000560

// 8kB RAM
#define GPRAM_O_BANK0345                                            0x00000564

// 8kB RAM
#define GPRAM_O_BANK0346                                            0x00000568

// 8kB RAM
#define GPRAM_O_BANK0347                                            0x0000056C

// 8kB RAM
#define GPRAM_O_BANK0348                                            0x00000570

// 8kB RAM
#define GPRAM_O_BANK0349                                            0x00000574

// 8kB RAM
#define GPRAM_O_BANK0350                                            0x00000578

// 8kB RAM
#define GPRAM_O_BANK0351                                            0x0000057C

// 8kB RAM
#define GPRAM_O_BANK0352                                            0x00000580

// 8kB RAM
#define GPRAM_O_BANK0353                                            0x00000584

// 8kB RAM
#define GPRAM_O_BANK0354                                            0x00000588

// 8kB RAM
#define GPRAM_O_BANK0355                                            0x0000058C

// 8kB RAM
#define GPRAM_O_BANK0356                                            0x00000590

// 8kB RAM
#define GPRAM_O_BANK0357                                            0x00000594

// 8kB RAM
#define GPRAM_O_BANK0358                                            0x00000598

// 8kB RAM
#define GPRAM_O_BANK0359                                            0x0000059C

// 8kB RAM
#define GPRAM_O_BANK0360                                            0x000005A0

// 8kB RAM
#define GPRAM_O_BANK0361                                            0x000005A4

// 8kB RAM
#define GPRAM_O_BANK0362                                            0x000005A8

// 8kB RAM
#define GPRAM_O_BANK0363                                            0x000005AC

// 8kB RAM
#define GPRAM_O_BANK0364                                            0x000005B0

// 8kB RAM
#define GPRAM_O_BANK0365                                            0x000005B4

// 8kB RAM
#define GPRAM_O_BANK0366                                            0x000005B8

// 8kB RAM
#define GPRAM_O_BANK0367                                            0x000005BC

// 8kB RAM
#define GPRAM_O_BANK0368                                            0x000005C0

// 8kB RAM
#define GPRAM_O_BANK0369                                            0x000005C4

// 8kB RAM
#define GPRAM_O_BANK0370                                            0x000005C8

// 8kB RAM
#define GPRAM_O_BANK0371                                            0x000005CC

// 8kB RAM
#define GPRAM_O_BANK0372                                            0x000005D0

// 8kB RAM
#define GPRAM_O_BANK0373                                            0x000005D4

// 8kB RAM
#define GPRAM_O_BANK0374                                            0x000005D8

// 8kB RAM
#define GPRAM_O_BANK0375                                            0x000005DC

// 8kB RAM
#define GPRAM_O_BANK0376                                            0x000005E0

// 8kB RAM
#define GPRAM_O_BANK0377                                            0x000005E4

// 8kB RAM
#define GPRAM_O_BANK0378                                            0x000005E8

// 8kB RAM
#define GPRAM_O_BANK0379                                            0x000005EC

// 8kB RAM
#define GPRAM_O_BANK0380                                            0x000005F0

// 8kB RAM
#define GPRAM_O_BANK0381                                            0x000005F4

// 8kB RAM
#define GPRAM_O_BANK0382                                            0x000005F8

// 8kB RAM
#define GPRAM_O_BANK0383                                            0x000005FC

// 8kB RAM
#define GPRAM_O_BANK0384                                            0x00000600

// 8kB RAM
#define GPRAM_O_BANK0385                                            0x00000604

// 8kB RAM
#define GPRAM_O_BANK0386                                            0x00000608

// 8kB RAM
#define GPRAM_O_BANK0387                                            0x0000060C

// 8kB RAM
#define GPRAM_O_BANK0388                                            0x00000610

// 8kB RAM
#define GPRAM_O_BANK0389                                            0x00000614

// 8kB RAM
#define GPRAM_O_BANK0390                                            0x00000618

// 8kB RAM
#define GPRAM_O_BANK0391                                            0x0000061C

// 8kB RAM
#define GPRAM_O_BANK0392                                            0x00000620

// 8kB RAM
#define GPRAM_O_BANK0393                                            0x00000624

// 8kB RAM
#define GPRAM_O_BANK0394                                            0x00000628

// 8kB RAM
#define GPRAM_O_BANK0395                                            0x0000062C

// 8kB RAM
#define GPRAM_O_BANK0396                                            0x00000630

// 8kB RAM
#define GPRAM_O_BANK0397                                            0x00000634

// 8kB RAM
#define GPRAM_O_BANK0398                                            0x00000638

// 8kB RAM
#define GPRAM_O_BANK0399                                            0x0000063C

// 8kB RAM
#define GPRAM_O_BANK0400                                            0x00000640

// 8kB RAM
#define GPRAM_O_BANK0401                                            0x00000644

// 8kB RAM
#define GPRAM_O_BANK0402                                            0x00000648

// 8kB RAM
#define GPRAM_O_BANK0403                                            0x0000064C

// 8kB RAM
#define GPRAM_O_BANK0404                                            0x00000650

// 8kB RAM
#define GPRAM_O_BANK0405                                            0x00000654

// 8kB RAM
#define GPRAM_O_BANK0406                                            0x00000658

// 8kB RAM
#define GPRAM_O_BANK0407                                            0x0000065C

// 8kB RAM
#define GPRAM_O_BANK0408                                            0x00000660

// 8kB RAM
#define GPRAM_O_BANK0409                                            0x00000664

// 8kB RAM
#define GPRAM_O_BANK0410                                            0x00000668

// 8kB RAM
#define GPRAM_O_BANK0411                                            0x0000066C

// 8kB RAM
#define GPRAM_O_BANK0412                                            0x00000670

// 8kB RAM
#define GPRAM_O_BANK0413                                            0x00000674

// 8kB RAM
#define GPRAM_O_BANK0414                                            0x00000678

// 8kB RAM
#define GPRAM_O_BANK0415                                            0x0000067C

// 8kB RAM
#define GPRAM_O_BANK0416                                            0x00000680

// 8kB RAM
#define GPRAM_O_BANK0417                                            0x00000684

// 8kB RAM
#define GPRAM_O_BANK0418                                            0x00000688

// 8kB RAM
#define GPRAM_O_BANK0419                                            0x0000068C

// 8kB RAM
#define GPRAM_O_BANK0420                                            0x00000690

// 8kB RAM
#define GPRAM_O_BANK0421                                            0x00000694

// 8kB RAM
#define GPRAM_O_BANK0422                                            0x00000698

// 8kB RAM
#define GPRAM_O_BANK0423                                            0x0000069C

// 8kB RAM
#define GPRAM_O_BANK0424                                            0x000006A0

// 8kB RAM
#define GPRAM_O_BANK0425                                            0x000006A4

// 8kB RAM
#define GPRAM_O_BANK0426                                            0x000006A8

// 8kB RAM
#define GPRAM_O_BANK0427                                            0x000006AC

// 8kB RAM
#define GPRAM_O_BANK0428                                            0x000006B0

// 8kB RAM
#define GPRAM_O_BANK0429                                            0x000006B4

// 8kB RAM
#define GPRAM_O_BANK0430                                            0x000006B8

// 8kB RAM
#define GPRAM_O_BANK0431                                            0x000006BC

// 8kB RAM
#define GPRAM_O_BANK0432                                            0x000006C0

// 8kB RAM
#define GPRAM_O_BANK0433                                            0x000006C4

// 8kB RAM
#define GPRAM_O_BANK0434                                            0x000006C8

// 8kB RAM
#define GPRAM_O_BANK0435                                            0x000006CC

// 8kB RAM
#define GPRAM_O_BANK0436                                            0x000006D0

// 8kB RAM
#define GPRAM_O_BANK0437                                            0x000006D4

// 8kB RAM
#define GPRAM_O_BANK0438                                            0x000006D8

// 8kB RAM
#define GPRAM_O_BANK0439                                            0x000006DC

// 8kB RAM
#define GPRAM_O_BANK0440                                            0x000006E0

// 8kB RAM
#define GPRAM_O_BANK0441                                            0x000006E4

// 8kB RAM
#define GPRAM_O_BANK0442                                            0x000006E8

// 8kB RAM
#define GPRAM_O_BANK0443                                            0x000006EC

// 8kB RAM
#define GPRAM_O_BANK0444                                            0x000006F0

// 8kB RAM
#define GPRAM_O_BANK0445                                            0x000006F4

// 8kB RAM
#define GPRAM_O_BANK0446                                            0x000006F8

// 8kB RAM
#define GPRAM_O_BANK0447                                            0x000006FC

// 8kB RAM
#define GPRAM_O_BANK0448                                            0x00000700

// 8kB RAM
#define GPRAM_O_BANK0449                                            0x00000704

// 8kB RAM
#define GPRAM_O_BANK0450                                            0x00000708

// 8kB RAM
#define GPRAM_O_BANK0451                                            0x0000070C

// 8kB RAM
#define GPRAM_O_BANK0452                                            0x00000710

// 8kB RAM
#define GPRAM_O_BANK0453                                            0x00000714

// 8kB RAM
#define GPRAM_O_BANK0454                                            0x00000718

// 8kB RAM
#define GPRAM_O_BANK0455                                            0x0000071C

// 8kB RAM
#define GPRAM_O_BANK0456                                            0x00000720

// 8kB RAM
#define GPRAM_O_BANK0457                                            0x00000724

// 8kB RAM
#define GPRAM_O_BANK0458                                            0x00000728

// 8kB RAM
#define GPRAM_O_BANK0459                                            0x0000072C

// 8kB RAM
#define GPRAM_O_BANK0460                                            0x00000730

// 8kB RAM
#define GPRAM_O_BANK0461                                            0x00000734

// 8kB RAM
#define GPRAM_O_BANK0462                                            0x00000738

// 8kB RAM
#define GPRAM_O_BANK0463                                            0x0000073C

// 8kB RAM
#define GPRAM_O_BANK0464                                            0x00000740

// 8kB RAM
#define GPRAM_O_BANK0465                                            0x00000744

// 8kB RAM
#define GPRAM_O_BANK0466                                            0x00000748

// 8kB RAM
#define GPRAM_O_BANK0467                                            0x0000074C

// 8kB RAM
#define GPRAM_O_BANK0468                                            0x00000750

// 8kB RAM
#define GPRAM_O_BANK0469                                            0x00000754

// 8kB RAM
#define GPRAM_O_BANK0470                                            0x00000758

// 8kB RAM
#define GPRAM_O_BANK0471                                            0x0000075C

// 8kB RAM
#define GPRAM_O_BANK0472                                            0x00000760

// 8kB RAM
#define GPRAM_O_BANK0473                                            0x00000764

// 8kB RAM
#define GPRAM_O_BANK0474                                            0x00000768

// 8kB RAM
#define GPRAM_O_BANK0475                                            0x0000076C

// 8kB RAM
#define GPRAM_O_BANK0476                                            0x00000770

// 8kB RAM
#define GPRAM_O_BANK0477                                            0x00000774

// 8kB RAM
#define GPRAM_O_BANK0478                                            0x00000778

// 8kB RAM
#define GPRAM_O_BANK0479                                            0x0000077C

// 8kB RAM
#define GPRAM_O_BANK0480                                            0x00000780

// 8kB RAM
#define GPRAM_O_BANK0481                                            0x00000784

// 8kB RAM
#define GPRAM_O_BANK0482                                            0x00000788

// 8kB RAM
#define GPRAM_O_BANK0483                                            0x0000078C

// 8kB RAM
#define GPRAM_O_BANK0484                                            0x00000790

// 8kB RAM
#define GPRAM_O_BANK0485                                            0x00000794

// 8kB RAM
#define GPRAM_O_BANK0486                                            0x00000798

// 8kB RAM
#define GPRAM_O_BANK0487                                            0x0000079C

// 8kB RAM
#define GPRAM_O_BANK0488                                            0x000007A0

// 8kB RAM
#define GPRAM_O_BANK0489                                            0x000007A4

// 8kB RAM
#define GPRAM_O_BANK0490                                            0x000007A8

// 8kB RAM
#define GPRAM_O_BANK0491                                            0x000007AC

// 8kB RAM
#define GPRAM_O_BANK0492                                            0x000007B0

// 8kB RAM
#define GPRAM_O_BANK0493                                            0x000007B4

// 8kB RAM
#define GPRAM_O_BANK0494                                            0x000007B8

// 8kB RAM
#define GPRAM_O_BANK0495                                            0x000007BC

// 8kB RAM
#define GPRAM_O_BANK0496                                            0x000007C0

// 8kB RAM
#define GPRAM_O_BANK0497                                            0x000007C4

// 8kB RAM
#define GPRAM_O_BANK0498                                            0x000007C8

// 8kB RAM
#define GPRAM_O_BANK0499                                            0x000007CC

// 8kB RAM
#define GPRAM_O_BANK0500                                            0x000007D0

// 8kB RAM
#define GPRAM_O_BANK0501                                            0x000007D4

// 8kB RAM
#define GPRAM_O_BANK0502                                            0x000007D8

