brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
// 8kB RAM
#define GPRAM_O_BANK0503                                            0x000007DC

// 8kB RAM
#define GPRAM_O_BANK0504                                            0x000007E0

// 8kB RAM
#define GPRAM_O_BANK0505                                            0x000007E4

// 8kB RAM
#define GPRAM_O_BANK0506                                            0x000007E8

// 8kB RAM
#define GPRAM_O_BANK0507                                            0x000007EC

// 8kB RAM
#define GPRAM_O_BANK0508                                            0x000007F0

// 8kB RAM
#define GPRAM_O_BANK0509                                            0x000007F4

// 8kB RAM
#define GPRAM_O_BANK0510                                            0x000007F8

// 8kB RAM
#define GPRAM_O_BANK0511                                            0x000007FC

// 8kB RAM
#define GPRAM_O_BANK0512                                            0x00000800

// 8kB RAM
#define GPRAM_O_BANK0513                                            0x00000804

// 8kB RAM
#define GPRAM_O_BANK0514                                            0x00000808

// 8kB RAM
#define GPRAM_O_BANK0515                                            0x0000080C

// 8kB RAM
#define GPRAM_O_BANK0516                                            0x00000810

// 8kB RAM
#define GPRAM_O_BANK0517                                            0x00000814

// 8kB RAM
#define GPRAM_O_BANK0518                                            0x00000818

// 8kB RAM
#define GPRAM_O_BANK0519                                            0x0000081C

// 8kB RAM
#define GPRAM_O_BANK0520                                            0x00000820

// 8kB RAM
#define GPRAM_O_BANK0521                                            0x00000824

// 8kB RAM
#define GPRAM_O_BANK0522                                            0x00000828

// 8kB RAM
#define GPRAM_O_BANK0523                                            0x0000082C

// 8kB RAM
#define GPRAM_O_BANK0524                                            0x00000830

// 8kB RAM
#define GPRAM_O_BANK0525                                            0x00000834

// 8kB RAM
#define GPRAM_O_BANK0526                                            0x00000838

// 8kB RAM
#define GPRAM_O_BANK0527                                            0x0000083C

// 8kB RAM
#define GPRAM_O_BANK0528                                            0x00000840

// 8kB RAM
#define GPRAM_O_BANK0529                                            0x00000844

// 8kB RAM
#define GPRAM_O_BANK0530                                            0x00000848

// 8kB RAM
#define GPRAM_O_BANK0531                                            0x0000084C

// 8kB RAM
#define GPRAM_O_BANK0532                                            0x00000850

// 8kB RAM
#define GPRAM_O_BANK0533                                            0x00000854

// 8kB RAM
#define GPRAM_O_BANK0534                                            0x00000858

// 8kB RAM
#define GPRAM_O_BANK0535                                            0x0000085C

// 8kB RAM
#define GPRAM_O_BANK0536                                            0x00000860

// 8kB RAM
#define GPRAM_O_BANK0537                                            0x00000864

// 8kB RAM
#define GPRAM_O_BANK0538                                            0x00000868

// 8kB RAM
#define GPRAM_O_BANK0539                                            0x0000086C

// 8kB RAM
#define GPRAM_O_BANK0540                                            0x00000870

// 8kB RAM
#define GPRAM_O_BANK0541                                            0x00000874

// 8kB RAM
#define GPRAM_O_BANK0542                                            0x00000878

// 8kB RAM
#define GPRAM_O_BANK0543                                            0x0000087C

// 8kB RAM
#define GPRAM_O_BANK0544                                            0x00000880

// 8kB RAM
#define GPRAM_O_BANK0545                                            0x00000884

// 8kB RAM
#define GPRAM_O_BANK0546                                            0x00000888

// 8kB RAM
#define GPRAM_O_BANK0547                                            0x0000088C

// 8kB RAM
#define GPRAM_O_BANK0548                                            0x00000890

// 8kB RAM
#define GPRAM_O_BANK0549                                            0x00000894

// 8kB RAM
#define GPRAM_O_BANK0550                                            0x00000898

// 8kB RAM
#define GPRAM_O_BANK0551                                            0x0000089C

// 8kB RAM
#define GPRAM_O_BANK0552                                            0x000008A0

// 8kB RAM
#define GPRAM_O_BANK0553                                            0x000008A4

// 8kB RAM
#define GPRAM_O_BANK0554                                            0x000008A8

// 8kB RAM
#define GPRAM_O_BANK0555                                            0x000008AC

// 8kB RAM
#define GPRAM_O_BANK0556                                            0x000008B0

// 8kB RAM
#define GPRAM_O_BANK0557                                            0x000008B4

// 8kB RAM
#define GPRAM_O_BANK0558                                            0x000008B8

// 8kB RAM
#define GPRAM_O_BANK0559                                            0x000008BC

// 8kB RAM
#define GPRAM_O_BANK0560                                            0x000008C0

// 8kB RAM
#define GPRAM_O_BANK0561                                            0x000008C4

// 8kB RAM
#define GPRAM_O_BANK0562                                            0x000008C8

// 8kB RAM
#define GPRAM_O_BANK0563                                            0x000008CC

// 8kB RAM
#define GPRAM_O_BANK0564                                            0x000008D0

// 8kB RAM
#define GPRAM_O_BANK0565                                            0x000008D4

// 8kB RAM
#define GPRAM_O_BANK0566                                            0x000008D8

// 8kB RAM
#define GPRAM_O_BANK0567                                            0x000008DC

// 8kB RAM
#define GPRAM_O_BANK0568                                            0x000008E0

// 8kB RAM
#define GPRAM_O_BANK0569                                            0x000008E4

// 8kB RAM
#define GPRAM_O_BANK0570                                            0x000008E8

// 8kB RAM
#define GPRAM_O_BANK0571                                            0x000008EC

// 8kB RAM
#define GPRAM_O_BANK0572                                            0x000008F0

// 8kB RAM
#define GPRAM_O_BANK0573                                            0x000008F4

// 8kB RAM
#define GPRAM_O_BANK0574                                            0x000008F8

// 8kB RAM
#define GPRAM_O_BANK0575                                            0x000008FC

// 8kB RAM
#define GPRAM_O_BANK0576                                            0x00000900

// 8kB RAM
#define GPRAM_O_BANK0577                                            0x00000904

// 8kB RAM
#define GPRAM_O_BANK0578                                            0x00000908

// 8kB RAM
#define GPRAM_O_BANK0579                                            0x0000090C

// 8kB RAM
#define GPRAM_O_BANK0580                                            0x00000910

// 8kB RAM
#define GPRAM_O_BANK0581                                            0x00000914

// 8kB RAM
#define GPRAM_O_BANK0582                                            0x00000918

// 8kB RAM
#define GPRAM_O_BANK0583                                            0x0000091C

// 8kB RAM
#define GPRAM_O_BANK0584                                            0x00000920

// 8kB RAM
#define GPRAM_O_BANK0585                                            0x00000924

// 8kB RAM
#define GPRAM_O_BANK0586                                            0x00000928

// 8kB RAM
#define GPRAM_O_BANK0587                                            0x0000092C

// 8kB RAM
#define GPRAM_O_BANK0588                                            0x00000930

// 8kB RAM
#define GPRAM_O_BANK0589                                            0x00000934

// 8kB RAM
#define GPRAM_O_BANK0590                                            0x00000938

// 8kB RAM
#define GPRAM_O_BANK0591                                            0x0000093C

// 8kB RAM
#define GPRAM_O_BANK0592                                            0x00000940

// 8kB RAM
#define GPRAM_O_BANK0593                                            0x00000944

// 8kB RAM
#define GPRAM_O_BANK0594                                            0x00000948

// 8kB RAM
#define GPRAM_O_BANK0595                                            0x0000094C

// 8kB RAM
#define GPRAM_O_BANK0596                                            0x00000950

// 8kB RAM
#define GPRAM_O_BANK0597                                            0x00000954

// 8kB RAM
#define GPRAM_O_BANK0598                                            0x00000958

// 8kB RAM
#define GPRAM_O_BANK0599                                            0x0000095C

// 8kB RAM
#define GPRAM_O_BANK0600                                            0x00000960

// 8kB RAM
#define GPRAM_O_BANK0601                                            0x00000964

// 8kB RAM
#define GPRAM_O_BANK0602                                            0x00000968

// 8kB RAM
#define GPRAM_O_BANK0603                                            0x0000096C

// 8kB RAM
#define GPRAM_O_BANK0604                                            0x00000970

// 8kB RAM
#define GPRAM_O_BANK0605                                            0x00000974

// 8kB RAM
#define GPRAM_O_BANK0606                                            0x00000978

// 8kB RAM
#define GPRAM_O_BANK0607                                            0x0000097C

// 8kB RAM
#define GPRAM_O_BANK0608                                            0x00000980

// 8kB RAM
#define GPRAM_O_BANK0609                                            0x00000984

// 8kB RAM
#define GPRAM_O_BANK0610                                            0x00000988

// 8kB RAM
#define GPRAM_O_BANK0611                                            0x0000098C

// 8kB RAM
#define GPRAM_O_BANK0612                                            0x00000990

// 8kB RAM
#define GPRAM_O_BANK0613                                            0x00000994

// 8kB RAM
#define GPRAM_O_BANK0614                                            0x00000998

// 8kB RAM
#define GPRAM_O_BANK0615                                            0x0000099C

// 8kB RAM
#define GPRAM_O_BANK0616                                            0x000009A0

// 8kB RAM
#define GPRAM_O_BANK0617                                            0x000009A4

// 8kB RAM
#define GPRAM_O_BANK0618                                            0x000009A8

// 8kB RAM
#define GPRAM_O_BANK0619                                            0x000009AC

// 8kB RAM
#define GPRAM_O_BANK0620                                            0x000009B0

// 8kB RAM
#define GPRAM_O_BANK0621                                            0x000009B4

// 8kB RAM
#define GPRAM_O_BANK0622                                            0x000009B8

// 8kB RAM
#define GPRAM_O_BANK0623                                            0x000009BC

// 8kB RAM
#define GPRAM_O_BANK0624                                            0x000009C0

// 8kB RAM
#define GPRAM_O_BANK0625                                            0x000009C4

// 8kB RAM
#define GPRAM_O_BANK0626                                            0x000009C8

// 8kB RAM
#define GPRAM_O_BANK0627                                            0x000009CC

// 8kB RAM
#define GPRAM_O_BANK0628                                            0x000009D0

// 8kB RAM
#define GPRAM_O_BANK0629                                            0x000009D4

// 8kB RAM
#define GPRAM_O_BANK0630                                            0x000009D8

// 8kB RAM
#define GPRAM_O_BANK0631                                            0x000009DC

// 8kB RAM
#define GPRAM_O_BANK0632                                            0x000009E0

// 8kB RAM
#define GPRAM_O_BANK0633                                            0x000009E4

// 8kB RAM
#define GPRAM_O_BANK0634                                            0x000009E8

// 8kB RAM
#define GPRAM_O_BANK0635                                            0x000009EC

// 8kB RAM
#define GPRAM_O_BANK0636                                            0x000009F0

// 8kB RAM
#define GPRAM_O_BANK0637                                            0x000009F4

// 8kB RAM
#define GPRAM_O_BANK0638                                            0x000009F8

// 8kB RAM
#define GPRAM_O_BANK0639                                            0x000009FC

// 8kB RAM
#define GPRAM_O_BANK0640                                            0x00000A00

// 8kB RAM
#define GPRAM_O_BANK0641                                            0x00000A04

// 8kB RAM
#define GPRAM_O_BANK0642                                            0x00000A08

// 8kB RAM
#define GPRAM_O_BANK0643                                            0x00000A0C

// 8kB RAM
#define GPRAM_O_BANK0644                                            0x00000A10

// 8kB RAM
#define GPRAM_O_BANK0645                                            0x00000A14

// 8kB RAM
#define GPRAM_O_BANK0646                                            0x00000A18

// 8kB RAM
#define GPRAM_O_BANK0647                                            0x00000A1C

// 8kB RAM
#define GPRAM_O_BANK0648                                            0x00000A20

// 8kB RAM
#define GPRAM_O_BANK0649                                            0x00000A24

// 8kB RAM
#define GPRAM_O_BANK0650                                            0x00000A28

// 8kB RAM
#define GPRAM_O_BANK0651                                            0x00000A2C

// 8kB RAM
#define GPRAM_O_BANK0652                                            0x00000A30

// 8kB RAM
#define GPRAM_O_BANK0653                                            0x00000A34

// 8kB RAM
#define GPRAM_O_BANK0654                                            0x00000A38

// 8kB RAM
#define GPRAM_O_BANK0655                                            0x00000A3C

// 8kB RAM
#define GPRAM_O_BANK0656                                            0x00000A40

// 8kB RAM
#define GPRAM_O_BANK0657                                            0x00000A44

// 8kB RAM
#define GPRAM_O_BANK0658                                            0x00000A48

// 8kB RAM
#define GPRAM_O_BANK0659                                            0x00000A4C

// 8kB RAM
#define GPRAM_O_BANK0660                                            0x00000A50

// 8kB RAM
#define GPRAM_O_BANK0661                                            0x00000A54

// 8kB RAM
#define GPRAM_O_BANK0662                                            0x00000A58

// 8kB RAM
#define GPRAM_O_BANK0663                                            0x00000A5C

// 8kB RAM
#define GPRAM_O_BANK0664                                            0x00000A60

// 8kB RAM
#define GPRAM_O_BANK0665                                            0x00000A64

// 8kB RAM
#define GPRAM_O_BANK0666                                            0x00000A68

// 8kB RAM
#define GPRAM_O_BANK0667                                            0x00000A6C

// 8kB RAM
#define GPRAM_O_BANK0668                                            0x00000A70

// 8kB RAM
#define GPRAM_O_BANK0669                                            0x00000A74

// 8kB RAM
#define GPRAM_O_BANK0670                                            0x00000A78

// 8kB RAM
#define GPRAM_O_BANK0671                                            0x00000A7C

// 8kB RAM
#define GPRAM_O_BANK0672                                            0x00000A80

// 8kB RAM
#define GPRAM_O_BANK0673                                            0x00000A84

// 8kB RAM
#define GPRAM_O_BANK0674                                            0x00000A88

// 8kB RAM
#define GPRAM_O_BANK0675                                            0x00000A8C

// 8kB RAM
#define GPRAM_O_BANK0676                                            0x00000A90

// 8kB RAM
#define GPRAM_O_BANK0677                                            0x00000A94

// 8kB RAM
#define GPRAM_O_BANK0678                                            0x00000A98

// 8kB RAM
#define GPRAM_O_BANK0679                                            0x00000A9C

// 8kB RAM
#define GPRAM_O_BANK0680                                            0x00000AA0

// 8kB RAM
#define GPRAM_O_BANK0681                                            0x00000AA4

// 8kB RAM
#define GPRAM_O_BANK0682                                            0x00000AA8

// 8kB RAM
#define GPRAM_O_BANK0683                                            0x00000AAC

// 8kB RAM
#define GPRAM_O_BANK0684                                            0x00000AB0

// 8kB RAM
#define GPRAM_O_BANK0685                                            0x00000AB4

// 8kB RAM
#define GPRAM_O_BANK0686                                            0x00000AB8

// 8kB RAM
#define GPRAM_O_BANK0687                                            0x00000ABC

// 8kB RAM
#define GPRAM_O_BANK0688                                            0x00000AC0

// 8kB RAM
#define GPRAM_O_BANK0689                                            0x00000AC4

// 8kB RAM
#define GPRAM_O_BANK0690                                            0x00000AC8

// 8kB RAM
#define GPRAM_O_BANK0691                                            0x00000ACC

// 8kB RAM
#define GPRAM_O_BANK0692                                            0x00000AD0

// 8kB RAM
#define GPRAM_O_BANK0693                                            0x00000AD4

// 8kB RAM
#define GPRAM_O_BANK0694                                            0x00000AD8

// 8kB RAM
#define GPRAM_O_BANK0695                                            0x00000ADC

// 8kB RAM
#define GPRAM_O_BANK0696                                            0x00000AE0

// 8kB RAM
#define GPRAM_O_BANK0697                                            0x00000AE4

// 8kB RAM
#define GPRAM_O_BANK0698                                            0x00000AE8

// 8kB RAM
#define GPRAM_O_BANK0699                                            0x00000AEC

// 8kB RAM
#define GPRAM_O_BANK0700                                            0x00000AF0

// 8kB RAM
#define GPRAM_O_BANK0701                                            0x00000AF4

// 8kB RAM
#define GPRAM_O_BANK0702                                            0x00000AF8

// 8kB RAM
#define GPRAM_O_BANK0703                                            0x00000AFC

// 8kB RAM
#define GPRAM_O_BANK0704                                            0x00000B00

// 8kB RAM
#define GPRAM_O_BANK0705                                            0x00000B04

// 8kB RAM
#define GPRAM_O_BANK0706                                            0x00000B08

// 8kB RAM
#define GPRAM_O_BANK0707                                            0x00000B0C

// 8kB RAM
#define GPRAM_O_BANK0708                                            0x00000B10

// 8kB RAM
#define GPRAM_O_BANK0709                                            0x00000B14

// 8kB RAM
#define GPRAM_O_BANK0710                                            0x00000B18

// 8kB RAM
#define GPRAM_O_BANK0711                                            0x00000B1C

// 8kB RAM
#define GPRAM_O_BANK0712                                            0x00000B20

// 8kB RAM
#define GPRAM_O_BANK0713                                            0x00000B24

// 8kB RAM
#define GPRAM_O_BANK0714                                            0x00000B28

// 8kB RAM
#define GPRAM_O_BANK0715                                            0x00000B2C

// 8kB RAM
#define GPRAM_O_BANK0716                                            0x00000B30

// 8kB RAM
#define GPRAM_O_BANK0717                                            0x00000B34

// 8kB RAM
#define GPRAM_O_BANK0718                                            0x00000B38

// 8kB RAM
#define GPRAM_O_BANK0719                                            0x00000B3C

// 8kB RAM
#define GPRAM_O_BANK0720                                            0x00000B40

// 8kB RAM
#define GPRAM_O_BANK0721                                            0x00000B44

// 8kB RAM
#define GPRAM_O_BANK0722                                            0x00000B48

// 8kB RAM
#define GPRAM_O_BANK0723                                            0x00000B4C

// 8kB RAM
#define GPRAM_O_BANK0724                                            0x00000B50

// 8kB RAM
#define GPRAM_O_BANK0725                                            0x00000B54

// 8kB RAM
#define GPRAM_O_BANK0726                                            0x00000B58

// 8kB RAM
#define GPRAM_O_BANK0727                                            0x00000B5C

// 8kB RAM
#define GPRAM_O_BANK0728                                            0x00000B60

// 8kB RAM
#define GPRAM_O_BANK0729                                            0x00000B64

// 8kB RAM
#define GPRAM_O_BANK0730                                            0x00000B68

// 8kB RAM
#define GPRAM_O_BANK0731                                            0x00000B6C

// 8kB RAM
#define GPRAM_O_BANK0732                                            0x00000B70

// 8kB RAM
#define GPRAM_O_BANK0733                                            0x00000B74

// 8kB RAM
#define GPRAM_O_BANK0734                                            0x00000B78

// 8kB RAM
#define GPRAM_O_BANK0735                                            0x00000B7C

// 8kB RAM
#define GPRAM_O_BANK0736                                            0x00000B80

// 8kB RAM
#define GPRAM_O_BANK0737                                            0x00000B84

// 8kB RAM
#define GPRAM_O_BANK0738                                            0x00000B88

// 8kB RAM
#define GPRAM_O_BANK0739                                            0x00000B8C

// 8kB RAM
#define GPRAM_O_BANK0740                                            0x00000B90

// 8kB RAM
#define GPRAM_O_BANK0741                                            0x00000B94

// 8kB RAM
#define GPRAM_O_BANK0742                                            0x00000B98

// 8kB RAM
#define GPRAM_O_BANK0743                                            0x00000B9C

// 8kB RAM
#define GPRAM_O_BANK0744                                            0x00000BA0

// 8kB RAM
#define GPRAM_O_BANK0745                                            0x00000BA4

// 8kB RAM
#define GPRAM_O_BANK0746                                            0x00000BA8

// 8kB RAM
#define GPRAM_O_BANK0747                                            0x00000BAC

// 8kB RAM
#define GPRAM_O_BANK0748                                            0x00000BB0

// 8kB RAM
#define GPRAM_O_BANK0749                                            0x00000BB4

// 8kB RAM
#define GPRAM_O_BANK0750                                            0x00000BB8

// 8kB RAM
#define GPRAM_O_BANK0751                                            0x00000BBC

// 8kB RAM
#define GPRAM_O_BANK0752                                            0x00000BC0

// 8kB RAM
#define GPRAM_O_BANK0753                                            0x00000BC4

// 8kB RAM
#define GPRAM_O_BANK0754                                            0x00000BC8

// 8kB RAM
#define GPRAM_O_BANK0755                                            0x00000BCC

// 8kB RAM
#define GPRAM_O_BANK0756                                            0x00000BD0

// 8kB RAM
#define GPRAM_O_BANK0757                                            0x00000BD4

// 8kB RAM
#define GPRAM_O_BANK0758                                            0x00000BD8

// 8kB RAM
#define GPRAM_O_BANK0759                                            0x00000BDC

// 8kB RAM
#define GPRAM_O_BANK0760                                            0x00000BE0

// 8kB RAM
#define GPRAM_O_BANK0761                                            0x00000BE4

// 8kB RAM
#define GPRAM_O_BANK0762                                            0x00000BE8

// 8kB RAM
#define GPRAM_O_BANK0763                                            0x00000BEC

// 8kB RAM
#define GPRAM_O_BANK0764                                            0x00000BF0

// 8kB RAM
#define GPRAM_O_BANK0765                                            0x00000BF4

