brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
// 8kB RAM
#define GPRAM_O_BANK0766                                            0x00000BF8

// 8kB RAM
#define GPRAM_O_BANK0767                                            0x00000BFC

// 8kB RAM
#define GPRAM_O_BANK0768                                            0x00000C00

// 8kB RAM
#define GPRAM_O_BANK0769                                            0x00000C04

// 8kB RAM
#define GPRAM_O_BANK0770                                            0x00000C08

// 8kB RAM
#define GPRAM_O_BANK0771                                            0x00000C0C

// 8kB RAM
#define GPRAM_O_BANK0772                                            0x00000C10

// 8kB RAM
#define GPRAM_O_BANK0773                                            0x00000C14

// 8kB RAM
#define GPRAM_O_BANK0774                                            0x00000C18

// 8kB RAM
#define GPRAM_O_BANK0775                                            0x00000C1C

// 8kB RAM
#define GPRAM_O_BANK0776                                            0x00000C20

// 8kB RAM
#define GPRAM_O_BANK0777                                            0x00000C24

// 8kB RAM
#define GPRAM_O_BANK0778                                            0x00000C28

// 8kB RAM
#define GPRAM_O_BANK0779                                            0x00000C2C

// 8kB RAM
#define GPRAM_O_BANK0780                                            0x00000C30

// 8kB RAM
#define GPRAM_O_BANK0781                                            0x00000C34

// 8kB RAM
#define GPRAM_O_BANK0782                                            0x00000C38

// 8kB RAM
#define GPRAM_O_BANK0783                                            0x00000C3C

// 8kB RAM
#define GPRAM_O_BANK0784                                            0x00000C40

// 8kB RAM
#define GPRAM_O_BANK0785                                            0x00000C44

// 8kB RAM
#define GPRAM_O_BANK0786                                            0x00000C48

// 8kB RAM
#define GPRAM_O_BANK0787                                            0x00000C4C

// 8kB RAM
#define GPRAM_O_BANK0788                                            0x00000C50

// 8kB RAM
#define GPRAM_O_BANK0789                                            0x00000C54

// 8kB RAM
#define GPRAM_O_BANK0790                                            0x00000C58

// 8kB RAM
#define GPRAM_O_BANK0791                                            0x00000C5C

// 8kB RAM
#define GPRAM_O_BANK0792                                            0x00000C60

// 8kB RAM
#define GPRAM_O_BANK0793                                            0x00000C64

// 8kB RAM
#define GPRAM_O_BANK0794                                            0x00000C68

// 8kB RAM
#define GPRAM_O_BANK0795                                            0x00000C6C

// 8kB RAM
#define GPRAM_O_BANK0796                                            0x00000C70

// 8kB RAM
#define GPRAM_O_BANK0797                                            0x00000C74

// 8kB RAM
#define GPRAM_O_BANK0798                                            0x00000C78

// 8kB RAM
#define GPRAM_O_BANK0799                                            0x00000C7C

// 8kB RAM
#define GPRAM_O_BANK0800                                            0x00000C80

// 8kB RAM
#define GPRAM_O_BANK0801                                            0x00000C84

// 8kB RAM
#define GPRAM_O_BANK0802                                            0x00000C88

// 8kB RAM
#define GPRAM_O_BANK0803                                            0x00000C8C

// 8kB RAM
#define GPRAM_O_BANK0804                                            0x00000C90

// 8kB RAM
#define GPRAM_O_BANK0805                                            0x00000C94

// 8kB RAM
#define GPRAM_O_BANK0806                                            0x00000C98

// 8kB RAM
#define GPRAM_O_BANK0807                                            0x00000C9C

// 8kB RAM
#define GPRAM_O_BANK0808                                            0x00000CA0

// 8kB RAM
#define GPRAM_O_BANK0809                                            0x00000CA4

// 8kB RAM
#define GPRAM_O_BANK0810                                            0x00000CA8

// 8kB RAM
#define GPRAM_O_BANK0811                                            0x00000CAC

// 8kB RAM
#define GPRAM_O_BANK0812                                            0x00000CB0

// 8kB RAM
#define GPRAM_O_BANK0813                                            0x00000CB4

// 8kB RAM
#define GPRAM_O_BANK0814                                            0x00000CB8

// 8kB RAM
#define GPRAM_O_BANK0815                                            0x00000CBC

// 8kB RAM
#define GPRAM_O_BANK0816                                            0x00000CC0

// 8kB RAM
#define GPRAM_O_BANK0817                                            0x00000CC4

// 8kB RAM
#define GPRAM_O_BANK0818                                            0x00000CC8

// 8kB RAM
#define GPRAM_O_BANK0819                                            0x00000CCC

// 8kB RAM
#define GPRAM_O_BANK0820                                            0x00000CD0

// 8kB RAM
#define GPRAM_O_BANK0821                                            0x00000CD4

// 8kB RAM
#define GPRAM_O_BANK0822                                            0x00000CD8

// 8kB RAM
#define GPRAM_O_BANK0823                                            0x00000CDC

// 8kB RAM
#define GPRAM_O_BANK0824                                            0x00000CE0

// 8kB RAM
#define GPRAM_O_BANK0825                                            0x00000CE4

// 8kB RAM
#define GPRAM_O_BANK0826                                            0x00000CE8

// 8kB RAM
#define GPRAM_O_BANK0827                                            0x00000CEC

// 8kB RAM
#define GPRAM_O_BANK0828                                            0x00000CF0

// 8kB RAM
#define GPRAM_O_BANK0829                                            0x00000CF4

// 8kB RAM
#define GPRAM_O_BANK0830                                            0x00000CF8

// 8kB RAM
#define GPRAM_O_BANK0831                                            0x00000CFC

// 8kB RAM
#define GPRAM_O_BANK0832                                            0x00000D00

// 8kB RAM
#define GPRAM_O_BANK0833                                            0x00000D04

// 8kB RAM
#define GPRAM_O_BANK0834                                            0x00000D08

// 8kB RAM
#define GPRAM_O_BANK0835                                            0x00000D0C

// 8kB RAM
#define GPRAM_O_BANK0836                                            0x00000D10

// 8kB RAM
#define GPRAM_O_BANK0837                                            0x00000D14

// 8kB RAM
#define GPRAM_O_BANK0838                                            0x00000D18

// 8kB RAM
#define GPRAM_O_BANK0839                                            0x00000D1C

// 8kB RAM
#define GPRAM_O_BANK0840                                            0x00000D20

// 8kB RAM
#define GPRAM_O_BANK0841                                            0x00000D24

// 8kB RAM
#define GPRAM_O_BANK0842                                            0x00000D28

// 8kB RAM
#define GPRAM_O_BANK0843                                            0x00000D2C

// 8kB RAM
#define GPRAM_O_BANK0844                                            0x00000D30

// 8kB RAM
#define GPRAM_O_BANK0845                                            0x00000D34

// 8kB RAM
#define GPRAM_O_BANK0846                                            0x00000D38

// 8kB RAM
#define GPRAM_O_BANK0847                                            0x00000D3C

// 8kB RAM
#define GPRAM_O_BANK0848                                            0x00000D40

// 8kB RAM
#define GPRAM_O_BANK0849                                            0x00000D44

// 8kB RAM
#define GPRAM_O_BANK0850                                            0x00000D48

// 8kB RAM
#define GPRAM_O_BANK0851                                            0x00000D4C

// 8kB RAM
#define GPRAM_O_BANK0852                                            0x00000D50

// 8kB RAM
#define GPRAM_O_BANK0853                                            0x00000D54

// 8kB RAM
#define GPRAM_O_BANK0854                                            0x00000D58

// 8kB RAM
#define GPRAM_O_BANK0855                                            0x00000D5C

// 8kB RAM
#define GPRAM_O_BANK0856                                            0x00000D60

// 8kB RAM
#define GPRAM_O_BANK0857                                            0x00000D64

// 8kB RAM
#define GPRAM_O_BANK0858                                            0x00000D68

// 8kB RAM
#define GPRAM_O_BANK0859                                            0x00000D6C

// 8kB RAM
#define GPRAM_O_BANK0860                                            0x00000D70

// 8kB RAM
#define GPRAM_O_BANK0861                                            0x00000D74

// 8kB RAM
#define GPRAM_O_BANK0862                                            0x00000D78

// 8kB RAM
#define GPRAM_O_BANK0863                                            0x00000D7C

// 8kB RAM
#define GPRAM_O_BANK0864                                            0x00000D80

// 8kB RAM
#define GPRAM_O_BANK0865                                            0x00000D84

// 8kB RAM
#define GPRAM_O_BANK0866                                            0x00000D88

// 8kB RAM
#define GPRAM_O_BANK0867                                            0x00000D8C

// 8kB RAM
#define GPRAM_O_BANK0868                                            0x00000D90

// 8kB RAM
#define GPRAM_O_BANK0869                                            0x00000D94

// 8kB RAM
#define GPRAM_O_BANK0870                                            0x00000D98

// 8kB RAM
#define GPRAM_O_BANK0871                                            0x00000D9C

// 8kB RAM
#define GPRAM_O_BANK0872                                            0x00000DA0

// 8kB RAM
#define GPRAM_O_BANK0873                                            0x00000DA4

// 8kB RAM
#define GPRAM_O_BANK0874                                            0x00000DA8

// 8kB RAM
#define GPRAM_O_BANK0875                                            0x00000DAC

// 8kB RAM
#define GPRAM_O_BANK0876                                            0x00000DB0

// 8kB RAM
#define GPRAM_O_BANK0877                                            0x00000DB4

// 8kB RAM
#define GPRAM_O_BANK0878                                            0x00000DB8

// 8kB RAM
#define GPRAM_O_BANK0879                                            0x00000DBC

// 8kB RAM
#define GPRAM_O_BANK0880                                            0x00000DC0

// 8kB RAM
#define GPRAM_O_BANK0881                                            0x00000DC4

// 8kB RAM
#define GPRAM_O_BANK0882                                            0x00000DC8

// 8kB RAM
#define GPRAM_O_BANK0883                                            0x00000DCC

// 8kB RAM
#define GPRAM_O_BANK0884                                            0x00000DD0

// 8kB RAM
#define GPRAM_O_BANK0885                                            0x00000DD4

// 8kB RAM
#define GPRAM_O_BANK0886                                            0x00000DD8

// 8kB RAM
#define GPRAM_O_BANK0887                                            0x00000DDC

// 8kB RAM
#define GPRAM_O_BANK0888                                            0x00000DE0

// 8kB RAM
#define GPRAM_O_BANK0889                                            0x00000DE4

// 8kB RAM
#define GPRAM_O_BANK0890                                            0x00000DE8

// 8kB RAM
#define GPRAM_O_BANK0891                                            0x00000DEC

// 8kB RAM
#define GPRAM_O_BANK0892                                            0x00000DF0

// 8kB RAM
#define GPRAM_O_BANK0893                                            0x00000DF4

// 8kB RAM
#define GPRAM_O_BANK0894                                            0x00000DF8

// 8kB RAM
#define GPRAM_O_BANK0895                                            0x00000DFC

// 8kB RAM
#define GPRAM_O_BANK0896                                            0x00000E00

// 8kB RAM
#define GPRAM_O_BANK0897                                            0x00000E04

// 8kB RAM
#define GPRAM_O_BANK0898                                            0x00000E08

// 8kB RAM
#define GPRAM_O_BANK0899                                            0x00000E0C

// 8kB RAM
#define GPRAM_O_BANK0900                                            0x00000E10

// 8kB RAM
#define GPRAM_O_BANK0901                                            0x00000E14

// 8kB RAM
#define GPRAM_O_BANK0902                                            0x00000E18

// 8kB RAM
#define GPRAM_O_BANK0903                                            0x00000E1C

// 8kB RAM
#define GPRAM_O_BANK0904                                            0x00000E20

// 8kB RAM
#define GPRAM_O_BANK0905                                            0x00000E24

// 8kB RAM
#define GPRAM_O_BANK0906                                            0x00000E28

// 8kB RAM
#define GPRAM_O_BANK0907                                            0x00000E2C

// 8kB RAM
#define GPRAM_O_BANK0908                                            0x00000E30

// 8kB RAM
#define GPRAM_O_BANK0909                                            0x00000E34

// 8kB RAM
#define GPRAM_O_BANK0910                                            0x00000E38

// 8kB RAM
#define GPRAM_O_BANK0911                                            0x00000E3C

// 8kB RAM
#define GPRAM_O_BANK0912                                            0x00000E40

// 8kB RAM
#define GPRAM_O_BANK0913                                            0x00000E44

// 8kB RAM
#define GPRAM_O_BANK0914                                            0x00000E48

// 8kB RAM
#define GPRAM_O_BANK0915                                            0x00000E4C

// 8kB RAM
#define GPRAM_O_BANK0916                                            0x00000E50

// 8kB RAM
#define GPRAM_O_BANK0917                                            0x00000E54

// 8kB RAM
#define GPRAM_O_BANK0918                                            0x00000E58

// 8kB RAM
#define GPRAM_O_BANK0919                                            0x00000E5C

// 8kB RAM
#define GPRAM_O_BANK0920                                            0x00000E60

// 8kB RAM
#define GPRAM_O_BANK0921                                            0x00000E64

// 8kB RAM
#define GPRAM_O_BANK0922                                            0x00000E68

// 8kB RAM
#define GPRAM_O_BANK0923                                            0x00000E6C

// 8kB RAM
#define GPRAM_O_BANK0924                                            0x00000E70

// 8kB RAM
#define GPRAM_O_BANK0925                                            0x00000E74

// 8kB RAM
#define GPRAM_O_BANK0926                                            0x00000E78

// 8kB RAM
#define GPRAM_O_BANK0927                                            0x00000E7C

// 8kB RAM
#define GPRAM_O_BANK0928                                            0x00000E80

// 8kB RAM
#define GPRAM_O_BANK0929                                            0x00000E84

// 8kB RAM
#define GPRAM_O_BANK0930                                            0x00000E88

// 8kB RAM
#define GPRAM_O_BANK0931                                            0x00000E8C

// 8kB RAM
#define GPRAM_O_BANK0932                                            0x00000E90

// 8kB RAM
#define GPRAM_O_BANK0933                                            0x00000E94

// 8kB RAM
#define GPRAM_O_BANK0934                                            0x00000E98

// 8kB RAM
#define GPRAM_O_BANK0935                                            0x00000E9C

// 8kB RAM
#define GPRAM_O_BANK0936                                            0x00000EA0

// 8kB RAM
#define GPRAM_O_BANK0937                                            0x00000EA4

// 8kB RAM
#define GPRAM_O_BANK0938                                            0x00000EA8

// 8kB RAM
#define GPRAM_O_BANK0939                                            0x00000EAC

// 8kB RAM
#define GPRAM_O_BANK0940                                            0x00000EB0

// 8kB RAM
#define GPRAM_O_BANK0941                                            0x00000EB4

// 8kB RAM
#define GPRAM_O_BANK0942                                            0x00000EB8

// 8kB RAM
#define GPRAM_O_BANK0943                                            0x00000EBC

// 8kB RAM
#define GPRAM_O_BANK0944                                            0x00000EC0

// 8kB RAM
#define GPRAM_O_BANK0945                                            0x00000EC4

// 8kB RAM
#define GPRAM_O_BANK0946                                            0x00000EC8

// 8kB RAM
#define GPRAM_O_BANK0947                                            0x00000ECC

// 8kB RAM
#define GPRAM_O_BANK0948                                            0x00000ED0

// 8kB RAM
#define GPRAM_O_BANK0949                                            0x00000ED4

// 8kB RAM
#define GPRAM_O_BANK0950                                            0x00000ED8

// 8kB RAM
#define GPRAM_O_BANK0951                                            0x00000EDC

// 8kB RAM
#define GPRAM_O_BANK0952                                            0x00000EE0

// 8kB RAM
#define GPRAM_O_BANK0953                                            0x00000EE4

// 8kB RAM
#define GPRAM_O_BANK0954                                            0x00000EE8

// 8kB RAM
#define GPRAM_O_BANK0955                                            0x00000EEC

// 8kB RAM
#define GPRAM_O_BANK0956                                            0x00000EF0

// 8kB RAM
#define GPRAM_O_BANK0957                                            0x00000EF4

// 8kB RAM
#define GPRAM_O_BANK0958                                            0x00000EF8

// 8kB RAM
#define GPRAM_O_BANK0959                                            0x00000EFC

// 8kB RAM
#define GPRAM_O_BANK0960                                            0x00000F00

// 8kB RAM
#define GPRAM_O_BANK0961                                            0x00000F04

// 8kB RAM
#define GPRAM_O_BANK0962                                            0x00000F08

// 8kB RAM
#define GPRAM_O_BANK0963                                            0x00000F0C

// 8kB RAM
#define GPRAM_O_BANK0964                                            0x00000F10

// 8kB RAM
#define GPRAM_O_BANK0965                                            0x00000F14

// 8kB RAM
#define GPRAM_O_BANK0966                                            0x00000F18

// 8kB RAM
#define GPRAM_O_BANK0967                                            0x00000F1C

// 8kB RAM
#define GPRAM_O_BANK0968                                            0x00000F20

// 8kB RAM
#define GPRAM_O_BANK0969                                            0x00000F24

// 8kB RAM
#define GPRAM_O_BANK0970                                            0x00000F28

// 8kB RAM
#define GPRAM_O_BANK0971                                            0x00000F2C

// 8kB RAM
#define GPRAM_O_BANK0972                                            0x00000F30

// 8kB RAM
#define GPRAM_O_BANK0973                                            0x00000F34

// 8kB RAM
#define GPRAM_O_BANK0974                                            0x00000F38

// 8kB RAM
#define GPRAM_O_BANK0975                                            0x00000F3C

// 8kB RAM
#define GPRAM_O_BANK0976                                            0x00000F40

// 8kB RAM
#define GPRAM_O_BANK0977                                            0x00000F44

// 8kB RAM
#define GPRAM_O_BANK0978                                            0x00000F48

// 8kB RAM
#define GPRAM_O_BANK0979                                            0x00000F4C

// 8kB RAM
#define GPRAM_O_BANK0980                                            0x00000F50

// 8kB RAM
#define GPRAM_O_BANK0981                                            0x00000F54

// 8kB RAM
#define GPRAM_O_BANK0982                                            0x00000F58

// 8kB RAM
#define GPRAM_O_BANK0983                                            0x00000F5C

// 8kB RAM
#define GPRAM_O_BANK0984                                            0x00000F60

// 8kB RAM
#define GPRAM_O_BANK0985                                            0x00000F64

// 8kB RAM
#define GPRAM_O_BANK0986                                            0x00000F68

// 8kB RAM
#define GPRAM_O_BANK0987                                            0x00000F6C

// 8kB RAM
#define GPRAM_O_BANK0988                                            0x00000F70

// 8kB RAM
#define GPRAM_O_BANK0989                                            0x00000F74

// 8kB RAM
#define GPRAM_O_BANK0990                                            0x00000F78

// 8kB RAM
#define GPRAM_O_BANK0991                                            0x00000F7C

// 8kB RAM
#define GPRAM_O_BANK0992                                            0x00000F80

// 8kB RAM
#define GPRAM_O_BANK0993                                            0x00000F84

// 8kB RAM
#define GPRAM_O_BANK0994                                            0x00000F88

// 8kB RAM
#define GPRAM_O_BANK0995                                            0x00000F8C

// 8kB RAM
#define GPRAM_O_BANK0996                                            0x00000F90

// 8kB RAM
#define GPRAM_O_BANK0997                                            0x00000F94

// 8kB RAM
#define GPRAM_O_BANK0998                                            0x00000F98

// 8kB RAM
#define GPRAM_O_BANK0999                                            0x00000F9C

// 8kB RAM
#define GPRAM_O_BANK01000                                           0x00000FA0

// 8kB RAM
#define GPRAM_O_BANK01001                                           0x00000FA4

// 8kB RAM
#define GPRAM_O_BANK01002                                           0x00000FA8

// 8kB RAM
#define GPRAM_O_BANK01003                                           0x00000FAC

// 8kB RAM
#define GPRAM_O_BANK01004                                           0x00000FB0

// 8kB RAM
#define GPRAM_O_BANK01005                                           0x00000FB4

// 8kB RAM
#define GPRAM_O_BANK01006                                           0x00000FB8

// 8kB RAM
#define GPRAM_O_BANK01007                                           0x00000FBC

// 8kB RAM
#define GPRAM_O_BANK01008                                           0x00000FC0

// 8kB RAM
#define GPRAM_O_BANK01009                                           0x00000FC4

// 8kB RAM
#define GPRAM_O_BANK01010                                           0x00000FC8

// 8kB RAM
#define GPRAM_O_BANK01011                                           0x00000FCC

// 8kB RAM
#define GPRAM_O_BANK01012                                           0x00000FD0

// 8kB RAM
#define GPRAM_O_BANK01013                                           0x00000FD4

// 8kB RAM
#define GPRAM_O_BANK01014                                           0x00000FD8

// 8kB RAM
#define GPRAM_O_BANK01015                                           0x00000FDC

// 8kB RAM
#define GPRAM_O_BANK01016                                           0x00000FE0

// 8kB RAM
#define GPRAM_O_BANK01017                                           0x00000FE4

// 8kB RAM
#define GPRAM_O_BANK01018                                           0x00000FE8

// 8kB RAM
#define GPRAM_O_BANK01019                                           0x00000FEC

// 8kB RAM
#define GPRAM_O_BANK01020                                           0x00000FF0

// 8kB RAM
#define GPRAM_O_BANK01021                                           0x00000FF4

// 8kB RAM
#define GPRAM_O_BANK01022                                           0x00000FF8

// 8kB RAM
#define GPRAM_O_BANK01023                                           0x00000FFC

// 8kB RAM
#define GPRAM_O_BANK01024                                           0x00001000

// 8kB RAM
#define GPRAM_O_BANK01025                                           0x00001004

// 8kB RAM
#define GPRAM_O_BANK01026                                           0x00001008

// 8kB RAM
#define GPRAM_O_BANK01027                                           0x0000100C

// 8kB RAM
#define GPRAM_O_BANK01028                                           0x00001010

