brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
// 8kB RAM
#define GPRAM_O_BANK01029                                           0x00001014

// 8kB RAM
#define GPRAM_O_BANK01030                                           0x00001018

// 8kB RAM
#define GPRAM_O_BANK01031                                           0x0000101C

// 8kB RAM
#define GPRAM_O_BANK01032                                           0x00001020

// 8kB RAM
#define GPRAM_O_BANK01033                                           0x00001024

// 8kB RAM
#define GPRAM_O_BANK01034                                           0x00001028

// 8kB RAM
#define GPRAM_O_BANK01035                                           0x0000102C

// 8kB RAM
#define GPRAM_O_BANK01036                                           0x00001030

// 8kB RAM
#define GPRAM_O_BANK01037                                           0x00001034

// 8kB RAM
#define GPRAM_O_BANK01038                                           0x00001038

// 8kB RAM
#define GPRAM_O_BANK01039                                           0x0000103C

// 8kB RAM
#define GPRAM_O_BANK01040                                           0x00001040

// 8kB RAM
#define GPRAM_O_BANK01041                                           0x00001044

// 8kB RAM
#define GPRAM_O_BANK01042                                           0x00001048

// 8kB RAM
#define GPRAM_O_BANK01043                                           0x0000104C

// 8kB RAM
#define GPRAM_O_BANK01044                                           0x00001050

// 8kB RAM
#define GPRAM_O_BANK01045                                           0x00001054

// 8kB RAM
#define GPRAM_O_BANK01046                                           0x00001058

// 8kB RAM
#define GPRAM_O_BANK01047                                           0x0000105C

// 8kB RAM
#define GPRAM_O_BANK01048                                           0x00001060

// 8kB RAM
#define GPRAM_O_BANK01049                                           0x00001064

// 8kB RAM
#define GPRAM_O_BANK01050                                           0x00001068

// 8kB RAM
#define GPRAM_O_BANK01051                                           0x0000106C

// 8kB RAM
#define GPRAM_O_BANK01052                                           0x00001070

// 8kB RAM
#define GPRAM_O_BANK01053                                           0x00001074

// 8kB RAM
#define GPRAM_O_BANK01054                                           0x00001078

// 8kB RAM
#define GPRAM_O_BANK01055                                           0x0000107C

// 8kB RAM
#define GPRAM_O_BANK01056                                           0x00001080

// 8kB RAM
#define GPRAM_O_BANK01057                                           0x00001084

// 8kB RAM
#define GPRAM_O_BANK01058                                           0x00001088

// 8kB RAM
#define GPRAM_O_BANK01059                                           0x0000108C

// 8kB RAM
#define GPRAM_O_BANK01060                                           0x00001090

// 8kB RAM
#define GPRAM_O_BANK01061                                           0x00001094

// 8kB RAM
#define GPRAM_O_BANK01062                                           0x00001098

// 8kB RAM
#define GPRAM_O_BANK01063                                           0x0000109C

// 8kB RAM
#define GPRAM_O_BANK01064                                           0x000010A0

// 8kB RAM
#define GPRAM_O_BANK01065                                           0x000010A4

// 8kB RAM
#define GPRAM_O_BANK01066                                           0x000010A8

// 8kB RAM
#define GPRAM_O_BANK01067                                           0x000010AC

// 8kB RAM
#define GPRAM_O_BANK01068                                           0x000010B0

// 8kB RAM
#define GPRAM_O_BANK01069                                           0x000010B4

// 8kB RAM
#define GPRAM_O_BANK01070                                           0x000010B8

// 8kB RAM
#define GPRAM_O_BANK01071                                           0x000010BC

// 8kB RAM
#define GPRAM_O_BANK01072                                           0x000010C0

// 8kB RAM
#define GPRAM_O_BANK01073                                           0x000010C4

// 8kB RAM
#define GPRAM_O_BANK01074                                           0x000010C8

// 8kB RAM
#define GPRAM_O_BANK01075                                           0x000010CC

// 8kB RAM
#define GPRAM_O_BANK01076                                           0x000010D0

// 8kB RAM
#define GPRAM_O_BANK01077                                           0x000010D4

// 8kB RAM
#define GPRAM_O_BANK01078                                           0x000010D8

// 8kB RAM
#define GPRAM_O_BANK01079                                           0x000010DC

// 8kB RAM
#define GPRAM_O_BANK01080                                           0x000010E0

// 8kB RAM
#define GPRAM_O_BANK01081                                           0x000010E4

// 8kB RAM
#define GPRAM_O_BANK01082                                           0x000010E8

// 8kB RAM
#define GPRAM_O_BANK01083                                           0x000010EC

// 8kB RAM
#define GPRAM_O_BANK01084                                           0x000010F0

// 8kB RAM
#define GPRAM_O_BANK01085                                           0x000010F4

// 8kB RAM
#define GPRAM_O_BANK01086                                           0x000010F8

// 8kB RAM
#define GPRAM_O_BANK01087                                           0x000010FC

// 8kB RAM
#define GPRAM_O_BANK01088                                           0x00001100

// 8kB RAM
#define GPRAM_O_BANK01089                                           0x00001104

// 8kB RAM
#define GPRAM_O_BANK01090                                           0x00001108

// 8kB RAM
#define GPRAM_O_BANK01091                                           0x0000110C

// 8kB RAM
#define GPRAM_O_BANK01092                                           0x00001110

// 8kB RAM
#define GPRAM_O_BANK01093                                           0x00001114

// 8kB RAM
#define GPRAM_O_BANK01094                                           0x00001118

// 8kB RAM
#define GPRAM_O_BANK01095                                           0x0000111C

// 8kB RAM
#define GPRAM_O_BANK01096                                           0x00001120

// 8kB RAM
#define GPRAM_O_BANK01097                                           0x00001124

// 8kB RAM
#define GPRAM_O_BANK01098                                           0x00001128

// 8kB RAM
#define GPRAM_O_BANK01099                                           0x0000112C

// 8kB RAM
#define GPRAM_O_BANK01100                                           0x00001130

// 8kB RAM
#define GPRAM_O_BANK01101                                           0x00001134

// 8kB RAM
#define GPRAM_O_BANK01102                                           0x00001138

// 8kB RAM
#define GPRAM_O_BANK01103                                           0x0000113C

// 8kB RAM
#define GPRAM_O_BANK01104                                           0x00001140

// 8kB RAM
#define GPRAM_O_BANK01105                                           0x00001144

// 8kB RAM
#define GPRAM_O_BANK01106                                           0x00001148

// 8kB RAM
#define GPRAM_O_BANK01107                                           0x0000114C

// 8kB RAM
#define GPRAM_O_BANK01108                                           0x00001150

// 8kB RAM
#define GPRAM_O_BANK01109                                           0x00001154

// 8kB RAM
#define GPRAM_O_BANK01110                                           0x00001158

// 8kB RAM
#define GPRAM_O_BANK01111                                           0x0000115C

// 8kB RAM
#define GPRAM_O_BANK01112                                           0x00001160

// 8kB RAM
#define GPRAM_O_BANK01113                                           0x00001164

// 8kB RAM
#define GPRAM_O_BANK01114                                           0x00001168

// 8kB RAM
#define GPRAM_O_BANK01115                                           0x0000116C

// 8kB RAM
#define GPRAM_O_BANK01116                                           0x00001170

// 8kB RAM
#define GPRAM_O_BANK01117                                           0x00001174

// 8kB RAM
#define GPRAM_O_BANK01118                                           0x00001178

// 8kB RAM
#define GPRAM_O_BANK01119                                           0x0000117C

// 8kB RAM
#define GPRAM_O_BANK01120                                           0x00001180

// 8kB RAM
#define GPRAM_O_BANK01121                                           0x00001184

// 8kB RAM
#define GPRAM_O_BANK01122                                           0x00001188

// 8kB RAM
#define GPRAM_O_BANK01123                                           0x0000118C

// 8kB RAM
#define GPRAM_O_BANK01124                                           0x00001190

// 8kB RAM
#define GPRAM_O_BANK01125                                           0x00001194

// 8kB RAM
#define GPRAM_O_BANK01126                                           0x00001198

// 8kB RAM
#define GPRAM_O_BANK01127                                           0x0000119C

// 8kB RAM
#define GPRAM_O_BANK01128                                           0x000011A0

// 8kB RAM
#define GPRAM_O_BANK01129                                           0x000011A4

// 8kB RAM
#define GPRAM_O_BANK01130                                           0x000011A8

// 8kB RAM
#define GPRAM_O_BANK01131                                           0x000011AC

// 8kB RAM
#define GPRAM_O_BANK01132                                           0x000011B0

// 8kB RAM
#define GPRAM_O_BANK01133                                           0x000011B4

// 8kB RAM
#define GPRAM_O_BANK01134                                           0x000011B8

// 8kB RAM
#define GPRAM_O_BANK01135                                           0x000011BC

// 8kB RAM
#define GPRAM_O_BANK01136                                           0x000011C0

// 8kB RAM
#define GPRAM_O_BANK01137                                           0x000011C4

// 8kB RAM
#define GPRAM_O_BANK01138                                           0x000011C8

// 8kB RAM
#define GPRAM_O_BANK01139                                           0x000011CC

// 8kB RAM
#define GPRAM_O_BANK01140                                           0x000011D0

// 8kB RAM
#define GPRAM_O_BANK01141                                           0x000011D4

// 8kB RAM
#define GPRAM_O_BANK01142                                           0x000011D8

// 8kB RAM
#define GPRAM_O_BANK01143                                           0x000011DC

// 8kB RAM
#define GPRAM_O_BANK01144                                           0x000011E0

// 8kB RAM
#define GPRAM_O_BANK01145                                           0x000011E4

// 8kB RAM
#define GPRAM_O_BANK01146                                           0x000011E8

// 8kB RAM
#define GPRAM_O_BANK01147                                           0x000011EC

// 8kB RAM
#define GPRAM_O_BANK01148                                           0x000011F0

// 8kB RAM
#define GPRAM_O_BANK01149                                           0x000011F4

// 8kB RAM
#define GPRAM_O_BANK01150                                           0x000011F8

// 8kB RAM
#define GPRAM_O_BANK01151                                           0x000011FC

// 8kB RAM
#define GPRAM_O_BANK01152                                           0x00001200

// 8kB RAM
#define GPRAM_O_BANK01153                                           0x00001204

// 8kB RAM
#define GPRAM_O_BANK01154                                           0x00001208

// 8kB RAM
#define GPRAM_O_BANK01155                                           0x0000120C

// 8kB RAM
#define GPRAM_O_BANK01156                                           0x00001210

// 8kB RAM
#define GPRAM_O_BANK01157                                           0x00001214

// 8kB RAM
#define GPRAM_O_BANK01158                                           0x00001218

// 8kB RAM
#define GPRAM_O_BANK01159                                           0x0000121C

// 8kB RAM
#define GPRAM_O_BANK01160                                           0x00001220

// 8kB RAM
#define GPRAM_O_BANK01161                                           0x00001224

// 8kB RAM
#define GPRAM_O_BANK01162                                           0x00001228

// 8kB RAM
#define GPRAM_O_BANK01163                                           0x0000122C

// 8kB RAM
#define GPRAM_O_BANK01164                                           0x00001230

// 8kB RAM
#define GPRAM_O_BANK01165                                           0x00001234

// 8kB RAM
#define GPRAM_O_BANK01166                                           0x00001238

// 8kB RAM
#define GPRAM_O_BANK01167                                           0x0000123C

// 8kB RAM
#define GPRAM_O_BANK01168                                           0x00001240

// 8kB RAM
#define GPRAM_O_BANK01169                                           0x00001244

// 8kB RAM
#define GPRAM_O_BANK01170                                           0x00001248

// 8kB RAM
#define GPRAM_O_BANK01171                                           0x0000124C

// 8kB RAM
#define GPRAM_O_BANK01172                                           0x00001250

// 8kB RAM
#define GPRAM_O_BANK01173                                           0x00001254

// 8kB RAM
#define GPRAM_O_BANK01174                                           0x00001258

// 8kB RAM
#define GPRAM_O_BANK01175                                           0x0000125C

// 8kB RAM
#define GPRAM_O_BANK01176                                           0x00001260

// 8kB RAM
#define GPRAM_O_BANK01177                                           0x00001264

// 8kB RAM
#define GPRAM_O_BANK01178                                           0x00001268

// 8kB RAM
#define GPRAM_O_BANK01179                                           0x0000126C

// 8kB RAM
#define GPRAM_O_BANK01180                                           0x00001270

// 8kB RAM
#define GPRAM_O_BANK01181                                           0x00001274

// 8kB RAM
#define GPRAM_O_BANK01182                                           0x00001278

// 8kB RAM
#define GPRAM_O_BANK01183                                           0x0000127C

// 8kB RAM
#define GPRAM_O_BANK01184                                           0x00001280

// 8kB RAM
#define GPRAM_O_BANK01185                                           0x00001284

// 8kB RAM
#define GPRAM_O_BANK01186                                           0x00001288

// 8kB RAM
#define GPRAM_O_BANK01187                                           0x0000128C

// 8kB RAM
#define GPRAM_O_BANK01188                                           0x00001290

// 8kB RAM
#define GPRAM_O_BANK01189                                           0x00001294

// 8kB RAM
#define GPRAM_O_BANK01190                                           0x00001298

// 8kB RAM
#define GPRAM_O_BANK01191                                           0x0000129C

// 8kB RAM
#define GPRAM_O_BANK01192                                           0x000012A0

// 8kB RAM
#define GPRAM_O_BANK01193                                           0x000012A4

// 8kB RAM
#define GPRAM_O_BANK01194                                           0x000012A8

// 8kB RAM
#define GPRAM_O_BANK01195                                           0x000012AC

// 8kB RAM
#define GPRAM_O_BANK01196                                           0x000012B0

// 8kB RAM
#define GPRAM_O_BANK01197                                           0x000012B4

// 8kB RAM
#define GPRAM_O_BANK01198                                           0x000012B8

// 8kB RAM
#define GPRAM_O_BANK01199                                           0x000012BC

// 8kB RAM
#define GPRAM_O_BANK01200                                           0x000012C0

// 8kB RAM
#define GPRAM_O_BANK01201                                           0x000012C4

// 8kB RAM
#define GPRAM_O_BANK01202                                           0x000012C8

// 8kB RAM
#define GPRAM_O_BANK01203                                           0x000012CC

// 8kB RAM
#define GPRAM_O_BANK01204                                           0x000012D0

// 8kB RAM
#define GPRAM_O_BANK01205                                           0x000012D4

// 8kB RAM
#define GPRAM_O_BANK01206                                           0x000012D8

// 8kB RAM
#define GPRAM_O_BANK01207                                           0x000012DC

// 8kB RAM
#define GPRAM_O_BANK01208                                           0x000012E0

// 8kB RAM
#define GPRAM_O_BANK01209                                           0x000012E4

// 8kB RAM
#define GPRAM_O_BANK01210                                           0x000012E8

// 8kB RAM
#define GPRAM_O_BANK01211                                           0x000012EC

// 8kB RAM
#define GPRAM_O_BANK01212                                           0x000012F0

// 8kB RAM
#define GPRAM_O_BANK01213                                           0x000012F4

// 8kB RAM
#define GPRAM_O_BANK01214                                           0x000012F8

// 8kB RAM
#define GPRAM_O_BANK01215                                           0x000012FC

// 8kB RAM
#define GPRAM_O_BANK01216                                           0x00001300

// 8kB RAM
#define GPRAM_O_BANK01217                                           0x00001304

// 8kB RAM
#define GPRAM_O_BANK01218                                           0x00001308

// 8kB RAM
#define GPRAM_O_BANK01219                                           0x0000130C

// 8kB RAM
#define GPRAM_O_BANK01220                                           0x00001310

// 8kB RAM
#define GPRAM_O_BANK01221                                           0x00001314

// 8kB RAM
#define GPRAM_O_BANK01222                                           0x00001318

// 8kB RAM
#define GPRAM_O_BANK01223                                           0x0000131C

// 8kB RAM
#define GPRAM_O_BANK01224                                           0x00001320

// 8kB RAM
#define GPRAM_O_BANK01225                                           0x00001324

// 8kB RAM
#define GPRAM_O_BANK01226                                           0x00001328

// 8kB RAM
#define GPRAM_O_BANK01227                                           0x0000132C

// 8kB RAM
#define GPRAM_O_BANK01228                                           0x00001330

// 8kB RAM
#define GPRAM_O_BANK01229                                           0x00001334

// 8kB RAM
#define GPRAM_O_BANK01230                                           0x00001338

// 8kB RAM
#define GPRAM_O_BANK01231                                           0x0000133C

// 8kB RAM
#define GPRAM_O_BANK01232                                           0x00001340

// 8kB RAM
#define GPRAM_O_BANK01233                                           0x00001344

// 8kB RAM
#define GPRAM_O_BANK01234                                           0x00001348

// 8kB RAM
#define GPRAM_O_BANK01235                                           0x0000134C

// 8kB RAM
#define GPRAM_O_BANK01236                                           0x00001350

// 8kB RAM
#define GPRAM_O_BANK01237                                           0x00001354

// 8kB RAM
#define GPRAM_O_BANK01238                                           0x00001358

// 8kB RAM
#define GPRAM_O_BANK01239                                           0x0000135C

// 8kB RAM
#define GPRAM_O_BANK01240                                           0x00001360

// 8kB RAM
#define GPRAM_O_BANK01241                                           0x00001364

// 8kB RAM
#define GPRAM_O_BANK01242                                           0x00001368

// 8kB RAM
#define GPRAM_O_BANK01243                                           0x0000136C

// 8kB RAM
#define GPRAM_O_BANK01244                                           0x00001370

// 8kB RAM
#define GPRAM_O_BANK01245                                           0x00001374

// 8kB RAM
#define GPRAM_O_BANK01246                                           0x00001378

// 8kB RAM
#define GPRAM_O_BANK01247                                           0x0000137C

// 8kB RAM
#define GPRAM_O_BANK01248                                           0x00001380

// 8kB RAM
#define GPRAM_O_BANK01249                                           0x00001384

// 8kB RAM
#define GPRAM_O_BANK01250                                           0x00001388

// 8kB RAM
#define GPRAM_O_BANK01251                                           0x0000138C

// 8kB RAM
#define GPRAM_O_BANK01252                                           0x00001390

// 8kB RAM
#define GPRAM_O_BANK01253                                           0x00001394

// 8kB RAM
#define GPRAM_O_BANK01254                                           0x00001398

// 8kB RAM
#define GPRAM_O_BANK01255                                           0x0000139C

// 8kB RAM
#define GPRAM_O_BANK01256                                           0x000013A0

// 8kB RAM
#define GPRAM_O_BANK01257                                           0x000013A4

// 8kB RAM
#define GPRAM_O_BANK01258                                           0x000013A8

// 8kB RAM
#define GPRAM_O_BANK01259                                           0x000013AC

// 8kB RAM
#define GPRAM_O_BANK01260                                           0x000013B0

// 8kB RAM
#define GPRAM_O_BANK01261                                           0x000013B4

// 8kB RAM
#define GPRAM_O_BANK01262                                           0x000013B8

// 8kB RAM
#define GPRAM_O_BANK01263                                           0x000013BC

// 8kB RAM
#define GPRAM_O_BANK01264                                           0x000013C0

// 8kB RAM
#define GPRAM_O_BANK01265                                           0x000013C4

// 8kB RAM
#define GPRAM_O_BANK01266                                           0x000013C8

// 8kB RAM
#define GPRAM_O_BANK01267                                           0x000013CC

// 8kB RAM
#define GPRAM_O_BANK01268                                           0x000013D0

// 8kB RAM
#define GPRAM_O_BANK01269                                           0x000013D4

// 8kB RAM
#define GPRAM_O_BANK01270                                           0x000013D8

// 8kB RAM
#define GPRAM_O_BANK01271                                           0x000013DC

// 8kB RAM
#define GPRAM_O_BANK01272                                           0x000013E0

// 8kB RAM
#define GPRAM_O_BANK01273                                           0x000013E4

// 8kB RAM
#define GPRAM_O_BANK01274                                           0x000013E8

// 8kB RAM
#define GPRAM_O_BANK01275                                           0x000013EC

// 8kB RAM
#define GPRAM_O_BANK01276                                           0x000013F0

// 8kB RAM
#define GPRAM_O_BANK01277                                           0x000013F4

// 8kB RAM
#define GPRAM_O_BANK01278                                           0x000013F8

// 8kB RAM
#define GPRAM_O_BANK01279                                           0x000013FC

// 8kB RAM
#define GPRAM_O_BANK01280                                           0x00001400

// 8kB RAM
#define GPRAM_O_BANK01281                                           0x00001404

// 8kB RAM
#define GPRAM_O_BANK01282                                           0x00001408

// 8kB RAM
#define GPRAM_O_BANK01283                                           0x0000140C

// 8kB RAM
#define GPRAM_O_BANK01284                                           0x00001410

// 8kB RAM
#define GPRAM_O_BANK01285                                           0x00001414

// 8kB RAM
#define GPRAM_O_BANK01286                                           0x00001418

// 8kB RAM
#define GPRAM_O_BANK01287                                           0x0000141C

// 8kB RAM
#define GPRAM_O_BANK01288                                           0x00001420

// 8kB RAM
#define GPRAM_O_BANK01289                                           0x00001424

// 8kB RAM
#define GPRAM_O_BANK01290                                           0x00001428

// 8kB RAM
#define GPRAM_O_BANK01291                                           0x0000142C

