brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
// 8kB RAM
#define GPRAM_O_BANK01292                                           0x00001430

// 8kB RAM
#define GPRAM_O_BANK01293                                           0x00001434

// 8kB RAM
#define GPRAM_O_BANK01294                                           0x00001438

// 8kB RAM
#define GPRAM_O_BANK01295                                           0x0000143C

// 8kB RAM
#define GPRAM_O_BANK01296                                           0x00001440

// 8kB RAM
#define GPRAM_O_BANK01297                                           0x00001444

// 8kB RAM
#define GPRAM_O_BANK01298                                           0x00001448

// 8kB RAM
#define GPRAM_O_BANK01299                                           0x0000144C

// 8kB RAM
#define GPRAM_O_BANK01300                                           0x00001450

// 8kB RAM
#define GPRAM_O_BANK01301                                           0x00001454

// 8kB RAM
#define GPRAM_O_BANK01302                                           0x00001458

// 8kB RAM
#define GPRAM_O_BANK01303                                           0x0000145C

// 8kB RAM
#define GPRAM_O_BANK01304                                           0x00001460

// 8kB RAM
#define GPRAM_O_BANK01305                                           0x00001464

// 8kB RAM
#define GPRAM_O_BANK01306                                           0x00001468

// 8kB RAM
#define GPRAM_O_BANK01307                                           0x0000146C

// 8kB RAM
#define GPRAM_O_BANK01308                                           0x00001470

// 8kB RAM
#define GPRAM_O_BANK01309                                           0x00001474

// 8kB RAM
#define GPRAM_O_BANK01310                                           0x00001478

// 8kB RAM
#define GPRAM_O_BANK01311                                           0x0000147C

// 8kB RAM
#define GPRAM_O_BANK01312                                           0x00001480

// 8kB RAM
#define GPRAM_O_BANK01313                                           0x00001484

// 8kB RAM
#define GPRAM_O_BANK01314                                           0x00001488

// 8kB RAM
#define GPRAM_O_BANK01315                                           0x0000148C

// 8kB RAM
#define GPRAM_O_BANK01316                                           0x00001490

// 8kB RAM
#define GPRAM_O_BANK01317                                           0x00001494

// 8kB RAM
#define GPRAM_O_BANK01318                                           0x00001498

// 8kB RAM
#define GPRAM_O_BANK01319                                           0x0000149C

// 8kB RAM
#define GPRAM_O_BANK01320                                           0x000014A0

// 8kB RAM
#define GPRAM_O_BANK01321                                           0x000014A4

// 8kB RAM
#define GPRAM_O_BANK01322                                           0x000014A8

// 8kB RAM
#define GPRAM_O_BANK01323                                           0x000014AC

// 8kB RAM
#define GPRAM_O_BANK01324                                           0x000014B0

// 8kB RAM
#define GPRAM_O_BANK01325                                           0x000014B4

// 8kB RAM
#define GPRAM_O_BANK01326                                           0x000014B8

// 8kB RAM
#define GPRAM_O_BANK01327                                           0x000014BC

// 8kB RAM
#define GPRAM_O_BANK01328                                           0x000014C0

// 8kB RAM
#define GPRAM_O_BANK01329                                           0x000014C4

// 8kB RAM
#define GPRAM_O_BANK01330                                           0x000014C8

// 8kB RAM
#define GPRAM_O_BANK01331                                           0x000014CC

// 8kB RAM
#define GPRAM_O_BANK01332                                           0x000014D0

// 8kB RAM
#define GPRAM_O_BANK01333                                           0x000014D4

// 8kB RAM
#define GPRAM_O_BANK01334                                           0x000014D8

// 8kB RAM
#define GPRAM_O_BANK01335                                           0x000014DC

// 8kB RAM
#define GPRAM_O_BANK01336                                           0x000014E0

// 8kB RAM
#define GPRAM_O_BANK01337                                           0x000014E4

// 8kB RAM
#define GPRAM_O_BANK01338                                           0x000014E8

// 8kB RAM
#define GPRAM_O_BANK01339                                           0x000014EC

// 8kB RAM
#define GPRAM_O_BANK01340                                           0x000014F0

// 8kB RAM
#define GPRAM_O_BANK01341                                           0x000014F4

// 8kB RAM
#define GPRAM_O_BANK01342                                           0x000014F8

// 8kB RAM
#define GPRAM_O_BANK01343                                           0x000014FC

// 8kB RAM
#define GPRAM_O_BANK01344                                           0x00001500

// 8kB RAM
#define GPRAM_O_BANK01345                                           0x00001504

// 8kB RAM
#define GPRAM_O_BANK01346                                           0x00001508

// 8kB RAM
#define GPRAM_O_BANK01347                                           0x0000150C

// 8kB RAM
#define GPRAM_O_BANK01348                                           0x00001510

// 8kB RAM
#define GPRAM_O_BANK01349                                           0x00001514

// 8kB RAM
#define GPRAM_O_BANK01350                                           0x00001518

// 8kB RAM
#define GPRAM_O_BANK01351                                           0x0000151C

// 8kB RAM
#define GPRAM_O_BANK01352                                           0x00001520

// 8kB RAM
#define GPRAM_O_BANK01353                                           0x00001524

// 8kB RAM
#define GPRAM_O_BANK01354                                           0x00001528

// 8kB RAM
#define GPRAM_O_BANK01355                                           0x0000152C

// 8kB RAM
#define GPRAM_O_BANK01356                                           0x00001530

// 8kB RAM
#define GPRAM_O_BANK01357                                           0x00001534

// 8kB RAM
#define GPRAM_O_BANK01358                                           0x00001538

// 8kB RAM
#define GPRAM_O_BANK01359                                           0x0000153C

// 8kB RAM
#define GPRAM_O_BANK01360                                           0x00001540

// 8kB RAM
#define GPRAM_O_BANK01361                                           0x00001544

// 8kB RAM
#define GPRAM_O_BANK01362                                           0x00001548

// 8kB RAM
#define GPRAM_O_BANK01363                                           0x0000154C

// 8kB RAM
#define GPRAM_O_BANK01364                                           0x00001550

// 8kB RAM
#define GPRAM_O_BANK01365                                           0x00001554

// 8kB RAM
#define GPRAM_O_BANK01366                                           0x00001558

// 8kB RAM
#define GPRAM_O_BANK01367                                           0x0000155C

// 8kB RAM
#define GPRAM_O_BANK01368                                           0x00001560

// 8kB RAM
#define GPRAM_O_BANK01369                                           0x00001564

// 8kB RAM
#define GPRAM_O_BANK01370                                           0x00001568

// 8kB RAM
#define GPRAM_O_BANK01371                                           0x0000156C

// 8kB RAM
#define GPRAM_O_BANK01372                                           0x00001570

// 8kB RAM
#define GPRAM_O_BANK01373                                           0x00001574

// 8kB RAM
#define GPRAM_O_BANK01374                                           0x00001578

// 8kB RAM
#define GPRAM_O_BANK01375                                           0x0000157C

// 8kB RAM
#define GPRAM_O_BANK01376                                           0x00001580

// 8kB RAM
#define GPRAM_O_BANK01377                                           0x00001584

// 8kB RAM
#define GPRAM_O_BANK01378                                           0x00001588

// 8kB RAM
#define GPRAM_O_BANK01379                                           0x0000158C

// 8kB RAM
#define GPRAM_O_BANK01380                                           0x00001590

// 8kB RAM
#define GPRAM_O_BANK01381                                           0x00001594

// 8kB RAM
#define GPRAM_O_BANK01382                                           0x00001598

// 8kB RAM
#define GPRAM_O_BANK01383                                           0x0000159C

// 8kB RAM
#define GPRAM_O_BANK01384                                           0x000015A0

// 8kB RAM
#define GPRAM_O_BANK01385                                           0x000015A4

// 8kB RAM
#define GPRAM_O_BANK01386                                           0x000015A8

// 8kB RAM
#define GPRAM_O_BANK01387                                           0x000015AC

// 8kB RAM
#define GPRAM_O_BANK01388                                           0x000015B0

// 8kB RAM
#define GPRAM_O_BANK01389                                           0x000015B4

// 8kB RAM
#define GPRAM_O_BANK01390                                           0x000015B8

// 8kB RAM
#define GPRAM_O_BANK01391                                           0x000015BC

// 8kB RAM
#define GPRAM_O_BANK01392                                           0x000015C0

// 8kB RAM
#define GPRAM_O_BANK01393                                           0x000015C4

// 8kB RAM
#define GPRAM_O_BANK01394                                           0x000015C8

// 8kB RAM
#define GPRAM_O_BANK01395                                           0x000015CC

// 8kB RAM
#define GPRAM_O_BANK01396                                           0x000015D0

// 8kB RAM
#define GPRAM_O_BANK01397                                           0x000015D4

// 8kB RAM
#define GPRAM_O_BANK01398                                           0x000015D8

// 8kB RAM
#define GPRAM_O_BANK01399                                           0x000015DC

// 8kB RAM
#define GPRAM_O_BANK01400                                           0x000015E0

// 8kB RAM
#define GPRAM_O_BANK01401                                           0x000015E4

// 8kB RAM
#define GPRAM_O_BANK01402                                           0x000015E8

// 8kB RAM
#define GPRAM_O_BANK01403                                           0x000015EC

// 8kB RAM
#define GPRAM_O_BANK01404                                           0x000015F0

// 8kB RAM
#define GPRAM_O_BANK01405                                           0x000015F4

// 8kB RAM
#define GPRAM_O_BANK01406                                           0x000015F8

// 8kB RAM
#define GPRAM_O_BANK01407                                           0x000015FC

// 8kB RAM
#define GPRAM_O_BANK01408                                           0x00001600

// 8kB RAM
#define GPRAM_O_BANK01409                                           0x00001604

// 8kB RAM
#define GPRAM_O_BANK01410                                           0x00001608

// 8kB RAM
#define GPRAM_O_BANK01411                                           0x0000160C

// 8kB RAM
#define GPRAM_O_BANK01412                                           0x00001610

// 8kB RAM
#define GPRAM_O_BANK01413                                           0x00001614

// 8kB RAM
#define GPRAM_O_BANK01414                                           0x00001618

// 8kB RAM
#define GPRAM_O_BANK01415                                           0x0000161C

// 8kB RAM
#define GPRAM_O_BANK01416                                           0x00001620

// 8kB RAM
#define GPRAM_O_BANK01417                                           0x00001624

// 8kB RAM
#define GPRAM_O_BANK01418                                           0x00001628

// 8kB RAM
#define GPRAM_O_BANK01419                                           0x0000162C

// 8kB RAM
#define GPRAM_O_BANK01420                                           0x00001630

// 8kB RAM
#define GPRAM_O_BANK01421                                           0x00001634

// 8kB RAM
#define GPRAM_O_BANK01422                                           0x00001638

// 8kB RAM
#define GPRAM_O_BANK01423                                           0x0000163C

// 8kB RAM
#define GPRAM_O_BANK01424                                           0x00001640

// 8kB RAM
#define GPRAM_O_BANK01425                                           0x00001644

// 8kB RAM
#define GPRAM_O_BANK01426                                           0x00001648

// 8kB RAM
#define GPRAM_O_BANK01427                                           0x0000164C

// 8kB RAM
#define GPRAM_O_BANK01428                                           0x00001650

// 8kB RAM
#define GPRAM_O_BANK01429                                           0x00001654

// 8kB RAM
#define GPRAM_O_BANK01430                                           0x00001658

// 8kB RAM
#define GPRAM_O_BANK01431                                           0x0000165C

// 8kB RAM
#define GPRAM_O_BANK01432                                           0x00001660

// 8kB RAM
#define GPRAM_O_BANK01433                                           0x00001664

// 8kB RAM
#define GPRAM_O_BANK01434                                           0x00001668

// 8kB RAM
#define GPRAM_O_BANK01435                                           0x0000166C

// 8kB RAM
#define GPRAM_O_BANK01436                                           0x00001670

// 8kB RAM
#define GPRAM_O_BANK01437                                           0x00001674

// 8kB RAM
#define GPRAM_O_BANK01438                                           0x00001678

// 8kB RAM
#define GPRAM_O_BANK01439                                           0x0000167C

// 8kB RAM
#define GPRAM_O_BANK01440                                           0x00001680

// 8kB RAM
#define GPRAM_O_BANK01441                                           0x00001684

// 8kB RAM
#define GPRAM_O_BANK01442                                           0x00001688

// 8kB RAM
#define GPRAM_O_BANK01443                                           0x0000168C

// 8kB RAM
#define GPRAM_O_BANK01444                                           0x00001690

// 8kB RAM
#define GPRAM_O_BANK01445                                           0x00001694

// 8kB RAM
#define GPRAM_O_BANK01446                                           0x00001698

// 8kB RAM
#define GPRAM_O_BANK01447                                           0x0000169C

// 8kB RAM
#define GPRAM_O_BANK01448                                           0x000016A0

// 8kB RAM
#define GPRAM_O_BANK01449                                           0x000016A4

// 8kB RAM
#define GPRAM_O_BANK01450                                           0x000016A8

// 8kB RAM
#define GPRAM_O_BANK01451                                           0x000016AC

// 8kB RAM
#define GPRAM_O_BANK01452                                           0x000016B0

// 8kB RAM
#define GPRAM_O_BANK01453                                           0x000016B4

// 8kB RAM
#define GPRAM_O_BANK01454                                           0x000016B8

// 8kB RAM
#define GPRAM_O_BANK01455                                           0x000016BC

// 8kB RAM
#define GPRAM_O_BANK01456                                           0x000016C0

// 8kB RAM
#define GPRAM_O_BANK01457                                           0x000016C4

// 8kB RAM
#define GPRAM_O_BANK01458                                           0x000016C8

// 8kB RAM
#define GPRAM_O_BANK01459                                           0x000016CC

// 8kB RAM
#define GPRAM_O_BANK01460                                           0x000016D0

// 8kB RAM
#define GPRAM_O_BANK01461                                           0x000016D4

// 8kB RAM
#define GPRAM_O_BANK01462                                           0x000016D8

// 8kB RAM
#define GPRAM_O_BANK01463                                           0x000016DC

// 8kB RAM
#define GPRAM_O_BANK01464                                           0x000016E0

// 8kB RAM
#define GPRAM_O_BANK01465                                           0x000016E4

// 8kB RAM
#define GPRAM_O_BANK01466                                           0x000016E8

// 8kB RAM
#define GPRAM_O_BANK01467                                           0x000016EC

// 8kB RAM
#define GPRAM_O_BANK01468                                           0x000016F0

// 8kB RAM
#define GPRAM_O_BANK01469                                           0x000016F4

// 8kB RAM
#define GPRAM_O_BANK01470                                           0x000016F8

// 8kB RAM
#define GPRAM_O_BANK01471                                           0x000016FC

// 8kB RAM
#define GPRAM_O_BANK01472                                           0x00001700

// 8kB RAM
#define GPRAM_O_BANK01473                                           0x00001704

// 8kB RAM
#define GPRAM_O_BANK01474                                           0x00001708

// 8kB RAM
#define GPRAM_O_BANK01475                                           0x0000170C

// 8kB RAM
#define GPRAM_O_BANK01476                                           0x00001710

// 8kB RAM
#define GPRAM_O_BANK01477                                           0x00001714

// 8kB RAM
#define GPRAM_O_BANK01478                                           0x00001718

// 8kB RAM
#define GPRAM_O_BANK01479                                           0x0000171C

// 8kB RAM
#define GPRAM_O_BANK01480                                           0x00001720

// 8kB RAM
#define GPRAM_O_BANK01481                                           0x00001724

// 8kB RAM
#define GPRAM_O_BANK01482                                           0x00001728

// 8kB RAM
#define GPRAM_O_BANK01483                                           0x0000172C

// 8kB RAM
#define GPRAM_O_BANK01484                                           0x00001730

// 8kB RAM
#define GPRAM_O_BANK01485                                           0x00001734

// 8kB RAM
#define GPRAM_O_BANK01486                                           0x00001738

// 8kB RAM
#define GPRAM_O_BANK01487                                           0x0000173C

// 8kB RAM
#define GPRAM_O_BANK01488                                           0x00001740

// 8kB RAM
#define GPRAM_O_BANK01489                                           0x00001744

// 8kB RAM
#define GPRAM_O_BANK01490                                           0x00001748

// 8kB RAM
#define GPRAM_O_BANK01491                                           0x0000174C

// 8kB RAM
#define GPRAM_O_BANK01492                                           0x00001750

// 8kB RAM
#define GPRAM_O_BANK01493                                           0x00001754

// 8kB RAM
#define GPRAM_O_BANK01494                                           0x00001758

// 8kB RAM
#define GPRAM_O_BANK01495                                           0x0000175C

// 8kB RAM
#define GPRAM_O_BANK01496                                           0x00001760

// 8kB RAM
#define GPRAM_O_BANK01497                                           0x00001764

// 8kB RAM
#define GPRAM_O_BANK01498                                           0x00001768

// 8kB RAM
#define GPRAM_O_BANK01499                                           0x0000176C

// 8kB RAM
#define GPRAM_O_BANK01500                                           0x00001770

// 8kB RAM
#define GPRAM_O_BANK01501                                           0x00001774

// 8kB RAM
#define GPRAM_O_BANK01502                                           0x00001778

// 8kB RAM
#define GPRAM_O_BANK01503                                           0x0000177C

// 8kB RAM
#define GPRAM_O_BANK01504                                           0x00001780

// 8kB RAM
#define GPRAM_O_BANK01505                                           0x00001784

// 8kB RAM
#define GPRAM_O_BANK01506                                           0x00001788

// 8kB RAM
#define GPRAM_O_BANK01507                                           0x0000178C

// 8kB RAM
#define GPRAM_O_BANK01508                                           0x00001790

// 8kB RAM
#define GPRAM_O_BANK01509                                           0x00001794

// 8kB RAM
#define GPRAM_O_BANK01510                                           0x00001798

// 8kB RAM
#define GPRAM_O_BANK01511                                           0x0000179C

// 8kB RAM
#define GPRAM_O_BANK01512                                           0x000017A0

// 8kB RAM
#define GPRAM_O_BANK01513                                           0x000017A4

// 8kB RAM
#define GPRAM_O_BANK01514                                           0x000017A8

// 8kB RAM
#define GPRAM_O_BANK01515                                           0x000017AC

// 8kB RAM
#define GPRAM_O_BANK01516                                           0x000017B0

// 8kB RAM
#define GPRAM_O_BANK01517                                           0x000017B4

// 8kB RAM
#define GPRAM_O_BANK01518                                           0x000017B8

// 8kB RAM
#define GPRAM_O_BANK01519                                           0x000017BC

// 8kB RAM
#define GPRAM_O_BANK01520                                           0x000017C0

// 8kB RAM
#define GPRAM_O_BANK01521                                           0x000017C4

// 8kB RAM
#define GPRAM_O_BANK01522                                           0x000017C8

// 8kB RAM
#define GPRAM_O_BANK01523                                           0x000017CC

// 8kB RAM
#define GPRAM_O_BANK01524                                           0x000017D0

// 8kB RAM
#define GPRAM_O_BANK01525                                           0x000017D4

// 8kB RAM
#define GPRAM_O_BANK01526                                           0x000017D8

// 8kB RAM
#define GPRAM_O_BANK01527                                           0x000017DC

// 8kB RAM
#define GPRAM_O_BANK01528                                           0x000017E0

// 8kB RAM
#define GPRAM_O_BANK01529                                           0x000017E4

// 8kB RAM
#define GPRAM_O_BANK01530                                           0x000017E8

// 8kB RAM
#define GPRAM_O_BANK01531                                           0x000017EC

// 8kB RAM
#define GPRAM_O_BANK01532                                           0x000017F0

// 8kB RAM
#define GPRAM_O_BANK01533                                           0x000017F4

// 8kB RAM
#define GPRAM_O_BANK01534                                           0x000017F8

// 8kB RAM
#define GPRAM_O_BANK01535                                           0x000017FC

// 8kB RAM
#define GPRAM_O_BANK01536                                           0x00001800

// 8kB RAM
#define GPRAM_O_BANK01537                                           0x00001804

// 8kB RAM
#define GPRAM_O_BANK01538                                           0x00001808

// 8kB RAM
#define GPRAM_O_BANK01539                                           0x0000180C

// 8kB RAM
#define GPRAM_O_BANK01540                                           0x00001810

// 8kB RAM
#define GPRAM_O_BANK01541                                           0x00001814

// 8kB RAM
#define GPRAM_O_BANK01542                                           0x00001818

// 8kB RAM
#define GPRAM_O_BANK01543                                           0x0000181C

// 8kB RAM
#define GPRAM_O_BANK01544                                           0x00001820

// 8kB RAM
#define GPRAM_O_BANK01545                                           0x00001824

// 8kB RAM
#define GPRAM_O_BANK01546                                           0x00001828

// 8kB RAM
#define GPRAM_O_BANK01547                                           0x0000182C

// 8kB RAM
#define GPRAM_O_BANK01548                                           0x00001830

// 8kB RAM
#define GPRAM_O_BANK01549                                           0x00001834

// 8kB RAM
#define GPRAM_O_BANK01550                                           0x00001838

// 8kB RAM
#define GPRAM_O_BANK01551                                           0x0000183C

// 8kB RAM
#define GPRAM_O_BANK01552                                           0x00001840

// 8kB RAM
#define GPRAM_O_BANK01553                                           0x00001844

// 8kB RAM
#define GPRAM_O_BANK01554                                           0x00001848

