brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
// 8kB RAM
#define GPRAM_O_BANK01555                                           0x0000184C

// 8kB RAM
#define GPRAM_O_BANK01556                                           0x00001850

// 8kB RAM
#define GPRAM_O_BANK01557                                           0x00001854

// 8kB RAM
#define GPRAM_O_BANK01558                                           0x00001858

// 8kB RAM
#define GPRAM_O_BANK01559                                           0x0000185C

// 8kB RAM
#define GPRAM_O_BANK01560                                           0x00001860

// 8kB RAM
#define GPRAM_O_BANK01561                                           0x00001864

// 8kB RAM
#define GPRAM_O_BANK01562                                           0x00001868

// 8kB RAM
#define GPRAM_O_BANK01563                                           0x0000186C

// 8kB RAM
#define GPRAM_O_BANK01564                                           0x00001870

// 8kB RAM
#define GPRAM_O_BANK01565                                           0x00001874

// 8kB RAM
#define GPRAM_O_BANK01566                                           0x00001878

// 8kB RAM
#define GPRAM_O_BANK01567                                           0x0000187C

// 8kB RAM
#define GPRAM_O_BANK01568                                           0x00001880

// 8kB RAM
#define GPRAM_O_BANK01569                                           0x00001884

// 8kB RAM
#define GPRAM_O_BANK01570                                           0x00001888

// 8kB RAM
#define GPRAM_O_BANK01571                                           0x0000188C

// 8kB RAM
#define GPRAM_O_BANK01572                                           0x00001890

// 8kB RAM
#define GPRAM_O_BANK01573                                           0x00001894

// 8kB RAM
#define GPRAM_O_BANK01574                                           0x00001898

// 8kB RAM
#define GPRAM_O_BANK01575                                           0x0000189C

// 8kB RAM
#define GPRAM_O_BANK01576                                           0x000018A0

// 8kB RAM
#define GPRAM_O_BANK01577                                           0x000018A4

// 8kB RAM
#define GPRAM_O_BANK01578                                           0x000018A8

// 8kB RAM
#define GPRAM_O_BANK01579                                           0x000018AC

// 8kB RAM
#define GPRAM_O_BANK01580                                           0x000018B0

// 8kB RAM
#define GPRAM_O_BANK01581                                           0x000018B4

// 8kB RAM
#define GPRAM_O_BANK01582                                           0x000018B8

// 8kB RAM
#define GPRAM_O_BANK01583                                           0x000018BC

// 8kB RAM
#define GPRAM_O_BANK01584                                           0x000018C0

// 8kB RAM
#define GPRAM_O_BANK01585                                           0x000018C4

// 8kB RAM
#define GPRAM_O_BANK01586                                           0x000018C8

// 8kB RAM
#define GPRAM_O_BANK01587                                           0x000018CC

// 8kB RAM
#define GPRAM_O_BANK01588                                           0x000018D0

// 8kB RAM
#define GPRAM_O_BANK01589                                           0x000018D4

// 8kB RAM
#define GPRAM_O_BANK01590                                           0x000018D8

// 8kB RAM
#define GPRAM_O_BANK01591                                           0x000018DC

// 8kB RAM
#define GPRAM_O_BANK01592                                           0x000018E0

// 8kB RAM
#define GPRAM_O_BANK01593                                           0x000018E4

// 8kB RAM
#define GPRAM_O_BANK01594                                           0x000018E8

// 8kB RAM
#define GPRAM_O_BANK01595                                           0x000018EC

// 8kB RAM
#define GPRAM_O_BANK01596                                           0x000018F0

// 8kB RAM
#define GPRAM_O_BANK01597                                           0x000018F4

// 8kB RAM
#define GPRAM_O_BANK01598                                           0x000018F8

// 8kB RAM
#define GPRAM_O_BANK01599                                           0x000018FC

// 8kB RAM
#define GPRAM_O_BANK01600                                           0x00001900

// 8kB RAM
#define GPRAM_O_BANK01601                                           0x00001904

// 8kB RAM
#define GPRAM_O_BANK01602                                           0x00001908

// 8kB RAM
#define GPRAM_O_BANK01603                                           0x0000190C

// 8kB RAM
#define GPRAM_O_BANK01604                                           0x00001910

// 8kB RAM
#define GPRAM_O_BANK01605                                           0x00001914

// 8kB RAM
#define GPRAM_O_BANK01606                                           0x00001918

// 8kB RAM
#define GPRAM_O_BANK01607                                           0x0000191C

// 8kB RAM
#define GPRAM_O_BANK01608                                           0x00001920

// 8kB RAM
#define GPRAM_O_BANK01609                                           0x00001924

// 8kB RAM
#define GPRAM_O_BANK01610                                           0x00001928

// 8kB RAM
#define GPRAM_O_BANK01611                                           0x0000192C

// 8kB RAM
#define GPRAM_O_BANK01612                                           0x00001930

// 8kB RAM
#define GPRAM_O_BANK01613                                           0x00001934

// 8kB RAM
#define GPRAM_O_BANK01614                                           0x00001938

// 8kB RAM
#define GPRAM_O_BANK01615                                           0x0000193C

// 8kB RAM
#define GPRAM_O_BANK01616                                           0x00001940

// 8kB RAM
#define GPRAM_O_BANK01617                                           0x00001944

// 8kB RAM
#define GPRAM_O_BANK01618                                           0x00001948

// 8kB RAM
#define GPRAM_O_BANK01619                                           0x0000194C

// 8kB RAM
#define GPRAM_O_BANK01620                                           0x00001950

// 8kB RAM
#define GPRAM_O_BANK01621                                           0x00001954

// 8kB RAM
#define GPRAM_O_BANK01622                                           0x00001958

// 8kB RAM
#define GPRAM_O_BANK01623                                           0x0000195C

// 8kB RAM
#define GPRAM_O_BANK01624                                           0x00001960

// 8kB RAM
#define GPRAM_O_BANK01625                                           0x00001964

// 8kB RAM
#define GPRAM_O_BANK01626                                           0x00001968

// 8kB RAM
#define GPRAM_O_BANK01627                                           0x0000196C

// 8kB RAM
#define GPRAM_O_BANK01628                                           0x00001970

// 8kB RAM
#define GPRAM_O_BANK01629                                           0x00001974

// 8kB RAM
#define GPRAM_O_BANK01630                                           0x00001978

// 8kB RAM
#define GPRAM_O_BANK01631                                           0x0000197C

// 8kB RAM
#define GPRAM_O_BANK01632                                           0x00001980

// 8kB RAM
#define GPRAM_O_BANK01633                                           0x00001984

// 8kB RAM
#define GPRAM_O_BANK01634                                           0x00001988

// 8kB RAM
#define GPRAM_O_BANK01635                                           0x0000198C

// 8kB RAM
#define GPRAM_O_BANK01636                                           0x00001990

// 8kB RAM
#define GPRAM_O_BANK01637                                           0x00001994

// 8kB RAM
#define GPRAM_O_BANK01638                                           0x00001998

// 8kB RAM
#define GPRAM_O_BANK01639                                           0x0000199C

// 8kB RAM
#define GPRAM_O_BANK01640                                           0x000019A0

// 8kB RAM
#define GPRAM_O_BANK01641                                           0x000019A4

// 8kB RAM
#define GPRAM_O_BANK01642                                           0x000019A8

// 8kB RAM
#define GPRAM_O_BANK01643                                           0x000019AC

// 8kB RAM
#define GPRAM_O_BANK01644                                           0x000019B0

// 8kB RAM
#define GPRAM_O_BANK01645                                           0x000019B4

// 8kB RAM
#define GPRAM_O_BANK01646                                           0x000019B8

// 8kB RAM
#define GPRAM_O_BANK01647                                           0x000019BC

// 8kB RAM
#define GPRAM_O_BANK01648                                           0x000019C0

// 8kB RAM
#define GPRAM_O_BANK01649                                           0x000019C4

// 8kB RAM
#define GPRAM_O_BANK01650                                           0x000019C8

// 8kB RAM
#define GPRAM_O_BANK01651                                           0x000019CC

// 8kB RAM
#define GPRAM_O_BANK01652                                           0x000019D0

// 8kB RAM
#define GPRAM_O_BANK01653                                           0x000019D4

// 8kB RAM
#define GPRAM_O_BANK01654                                           0x000019D8

// 8kB RAM
#define GPRAM_O_BANK01655                                           0x000019DC

// 8kB RAM
#define GPRAM_O_BANK01656                                           0x000019E0

// 8kB RAM
#define GPRAM_O_BANK01657                                           0x000019E4

// 8kB RAM
#define GPRAM_O_BANK01658                                           0x000019E8

// 8kB RAM
#define GPRAM_O_BANK01659                                           0x000019EC

// 8kB RAM
#define GPRAM_O_BANK01660                                           0x000019F0

// 8kB RAM
#define GPRAM_O_BANK01661                                           0x000019F4

// 8kB RAM
#define GPRAM_O_BANK01662                                           0x000019F8

// 8kB RAM
#define GPRAM_O_BANK01663                                           0x000019FC

// 8kB RAM
#define GPRAM_O_BANK01664                                           0x00001A00

// 8kB RAM
#define GPRAM_O_BANK01665                                           0x00001A04

// 8kB RAM
#define GPRAM_O_BANK01666                                           0x00001A08

// 8kB RAM
#define GPRAM_O_BANK01667                                           0x00001A0C

// 8kB RAM
#define GPRAM_O_BANK01668                                           0x00001A10

// 8kB RAM
#define GPRAM_O_BANK01669                                           0x00001A14

// 8kB RAM
#define GPRAM_O_BANK01670                                           0x00001A18

// 8kB RAM
#define GPRAM_O_BANK01671                                           0x00001A1C

// 8kB RAM
#define GPRAM_O_BANK01672                                           0x00001A20

// 8kB RAM
#define GPRAM_O_BANK01673                                           0x00001A24

// 8kB RAM
#define GPRAM_O_BANK01674                                           0x00001A28

// 8kB RAM
#define GPRAM_O_BANK01675                                           0x00001A2C

// 8kB RAM
#define GPRAM_O_BANK01676                                           0x00001A30

// 8kB RAM
#define GPRAM_O_BANK01677                                           0x00001A34

// 8kB RAM
#define GPRAM_O_BANK01678                                           0x00001A38

// 8kB RAM
#define GPRAM_O_BANK01679                                           0x00001A3C

// 8kB RAM
#define GPRAM_O_BANK01680                                           0x00001A40

// 8kB RAM
#define GPRAM_O_BANK01681                                           0x00001A44

// 8kB RAM
#define GPRAM_O_BANK01682                                           0x00001A48

// 8kB RAM
#define GPRAM_O_BANK01683                                           0x00001A4C

// 8kB RAM
#define GPRAM_O_BANK01684                                           0x00001A50

// 8kB RAM
#define GPRAM_O_BANK01685                                           0x00001A54

// 8kB RAM
#define GPRAM_O_BANK01686                                           0x00001A58

// 8kB RAM
#define GPRAM_O_BANK01687                                           0x00001A5C

// 8kB RAM
#define GPRAM_O_BANK01688                                           0x00001A60

// 8kB RAM
#define GPRAM_O_BANK01689                                           0x00001A64

// 8kB RAM
#define GPRAM_O_BANK01690                                           0x00001A68

// 8kB RAM
#define GPRAM_O_BANK01691                                           0x00001A6C

// 8kB RAM
#define GPRAM_O_BANK01692                                           0x00001A70

// 8kB RAM
#define GPRAM_O_BANK01693                                           0x00001A74

// 8kB RAM
#define GPRAM_O_BANK01694                                           0x00001A78

// 8kB RAM
#define GPRAM_O_BANK01695                                           0x00001A7C

// 8kB RAM
#define GPRAM_O_BANK01696                                           0x00001A80

// 8kB RAM
#define GPRAM_O_BANK01697                                           0x00001A84

// 8kB RAM
#define GPRAM_O_BANK01698                                           0x00001A88

// 8kB RAM
#define GPRAM_O_BANK01699                                           0x00001A8C

// 8kB RAM
#define GPRAM_O_BANK01700                                           0x00001A90

// 8kB RAM
#define GPRAM_O_BANK01701                                           0x00001A94

// 8kB RAM
#define GPRAM_O_BANK01702                                           0x00001A98

// 8kB RAM
#define GPRAM_O_BANK01703                                           0x00001A9C

// 8kB RAM
#define GPRAM_O_BANK01704                                           0x00001AA0

// 8kB RAM
#define GPRAM_O_BANK01705                                           0x00001AA4

// 8kB RAM
#define GPRAM_O_BANK01706                                           0x00001AA8

// 8kB RAM
#define GPRAM_O_BANK01707                                           0x00001AAC

// 8kB RAM
#define GPRAM_O_BANK01708                                           0x00001AB0

// 8kB RAM
#define GPRAM_O_BANK01709                                           0x00001AB4

// 8kB RAM
#define GPRAM_O_BANK01710                                           0x00001AB8

// 8kB RAM
#define GPRAM_O_BANK01711                                           0x00001ABC

// 8kB RAM
#define GPRAM_O_BANK01712                                           0x00001AC0

// 8kB RAM
#define GPRAM_O_BANK01713                                           0x00001AC4

// 8kB RAM
#define GPRAM_O_BANK01714                                           0x00001AC8

// 8kB RAM
#define GPRAM_O_BANK01715                                           0x00001ACC

// 8kB RAM
#define GPRAM_O_BANK01716                                           0x00001AD0

// 8kB RAM
#define GPRAM_O_BANK01717                                           0x00001AD4

// 8kB RAM
#define GPRAM_O_BANK01718                                           0x00001AD8

// 8kB RAM
#define GPRAM_O_BANK01719                                           0x00001ADC

// 8kB RAM
#define GPRAM_O_BANK01720                                           0x00001AE0

// 8kB RAM
#define GPRAM_O_BANK01721                                           0x00001AE4

// 8kB RAM
#define GPRAM_O_BANK01722                                           0x00001AE8

// 8kB RAM
#define GPRAM_O_BANK01723                                           0x00001AEC

// 8kB RAM
#define GPRAM_O_BANK01724                                           0x00001AF0

// 8kB RAM
#define GPRAM_O_BANK01725                                           0x00001AF4

// 8kB RAM
#define GPRAM_O_BANK01726                                           0x00001AF8

// 8kB RAM
#define GPRAM_O_BANK01727                                           0x00001AFC

// 8kB RAM
#define GPRAM_O_BANK01728                                           0x00001B00

// 8kB RAM
#define GPRAM_O_BANK01729                                           0x00001B04

// 8kB RAM
#define GPRAM_O_BANK01730                                           0x00001B08

// 8kB RAM
#define GPRAM_O_BANK01731                                           0x00001B0C

// 8kB RAM
#define GPRAM_O_BANK01732                                           0x00001B10

// 8kB RAM
#define GPRAM_O_BANK01733                                           0x00001B14

// 8kB RAM
#define GPRAM_O_BANK01734                                           0x00001B18

// 8kB RAM
#define GPRAM_O_BANK01735                                           0x00001B1C

// 8kB RAM
#define GPRAM_O_BANK01736                                           0x00001B20

// 8kB RAM
#define GPRAM_O_BANK01737                                           0x00001B24

// 8kB RAM
#define GPRAM_O_BANK01738                                           0x00001B28

// 8kB RAM
#define GPRAM_O_BANK01739                                           0x00001B2C

// 8kB RAM
#define GPRAM_O_BANK01740                                           0x00001B30

// 8kB RAM
#define GPRAM_O_BANK01741                                           0x00001B34

// 8kB RAM
#define GPRAM_O_BANK01742                                           0x00001B38

// 8kB RAM
#define GPRAM_O_BANK01743                                           0x00001B3C

// 8kB RAM
#define GPRAM_O_BANK01744                                           0x00001B40

// 8kB RAM
#define GPRAM_O_BANK01745                                           0x00001B44

// 8kB RAM
#define GPRAM_O_BANK01746                                           0x00001B48

// 8kB RAM
#define GPRAM_O_BANK01747                                           0x00001B4C

// 8kB RAM
#define GPRAM_O_BANK01748                                           0x00001B50

// 8kB RAM
#define GPRAM_O_BANK01749                                           0x00001B54

// 8kB RAM
#define GPRAM_O_BANK01750                                           0x00001B58

// 8kB RAM
#define GPRAM_O_BANK01751                                           0x00001B5C

// 8kB RAM
#define GPRAM_O_BANK01752                                           0x00001B60

// 8kB RAM
#define GPRAM_O_BANK01753                                           0x00001B64

// 8kB RAM
#define GPRAM_O_BANK01754                                           0x00001B68

// 8kB RAM
#define GPRAM_O_BANK01755                                           0x00001B6C

// 8kB RAM
#define GPRAM_O_BANK01756                                           0x00001B70

// 8kB RAM
#define GPRAM_O_BANK01757                                           0x00001B74

// 8kB RAM
#define GPRAM_O_BANK01758                                           0x00001B78

// 8kB RAM
#define GPRAM_O_BANK01759                                           0x00001B7C

// 8kB RAM
#define GPRAM_O_BANK01760                                           0x00001B80

// 8kB RAM
#define GPRAM_O_BANK01761                                           0x00001B84

// 8kB RAM
#define GPRAM_O_BANK01762                                           0x00001B88

// 8kB RAM
#define GPRAM_O_BANK01763                                           0x00001B8C

// 8kB RAM
#define GPRAM_O_BANK01764                                           0x00001B90

// 8kB RAM
#define GPRAM_O_BANK01765                                           0x00001B94

// 8kB RAM
#define GPRAM_O_BANK01766                                           0x00001B98

// 8kB RAM
#define GPRAM_O_BANK01767                                           0x00001B9C

// 8kB RAM
#define GPRAM_O_BANK01768                                           0x00001BA0

// 8kB RAM
#define GPRAM_O_BANK01769                                           0x00001BA4

// 8kB RAM
#define GPRAM_O_BANK01770                                           0x00001BA8

// 8kB RAM
#define GPRAM_O_BANK01771                                           0x00001BAC

// 8kB RAM
#define GPRAM_O_BANK01772                                           0x00001BB0

// 8kB RAM
#define GPRAM_O_BANK01773                                           0x00001BB4

// 8kB RAM
#define GPRAM_O_BANK01774                                           0x00001BB8

// 8kB RAM
#define GPRAM_O_BANK01775                                           0x00001BBC

// 8kB RAM
#define GPRAM_O_BANK01776                                           0x00001BC0

// 8kB RAM
#define GPRAM_O_BANK01777                                           0x00001BC4

// 8kB RAM
#define GPRAM_O_BANK01778                                           0x00001BC8

// 8kB RAM
#define GPRAM_O_BANK01779                                           0x00001BCC

// 8kB RAM
#define GPRAM_O_BANK01780                                           0x00001BD0

// 8kB RAM
#define GPRAM_O_BANK01781                                           0x00001BD4

// 8kB RAM
#define GPRAM_O_BANK01782                                           0x00001BD8

// 8kB RAM
#define GPRAM_O_BANK01783                                           0x00001BDC

// 8kB RAM
#define GPRAM_O_BANK01784                                           0x00001BE0

// 8kB RAM
#define GPRAM_O_BANK01785                                           0x00001BE4

// 8kB RAM
#define GPRAM_O_BANK01786                                           0x00001BE8

// 8kB RAM
#define GPRAM_O_BANK01787                                           0x00001BEC

// 8kB RAM
#define GPRAM_O_BANK01788                                           0x00001BF0

// 8kB RAM
#define GPRAM_O_BANK01789                                           0x00001BF4

// 8kB RAM
#define GPRAM_O_BANK01790                                           0x00001BF8

// 8kB RAM
#define GPRAM_O_BANK01791                                           0x00001BFC

// 8kB RAM
#define GPRAM_O_BANK01792                                           0x00001C00

// 8kB RAM
#define GPRAM_O_BANK01793                                           0x00001C04

// 8kB RAM
#define GPRAM_O_BANK01794                                           0x00001C08

// 8kB RAM
#define GPRAM_O_BANK01795                                           0x00001C0C

// 8kB RAM
#define GPRAM_O_BANK01796                                           0x00001C10

// 8kB RAM
#define GPRAM_O_BANK01797                                           0x00001C14

// 8kB RAM
#define GPRAM_O_BANK01798                                           0x00001C18

// 8kB RAM
#define GPRAM_O_BANK01799                                           0x00001C1C

// 8kB RAM
#define GPRAM_O_BANK01800                                           0x00001C20

// 8kB RAM
#define GPRAM_O_BANK01801                                           0x00001C24

// 8kB RAM
#define GPRAM_O_BANK01802                                           0x00001C28

// 8kB RAM
#define GPRAM_O_BANK01803                                           0x00001C2C

// 8kB RAM
#define GPRAM_O_BANK01804                                           0x00001C30

// 8kB RAM
#define GPRAM_O_BANK01805                                           0x00001C34

// 8kB RAM
#define GPRAM_O_BANK01806                                           0x00001C38

// 8kB RAM
#define GPRAM_O_BANK01807                                           0x00001C3C

// 8kB RAM
#define GPRAM_O_BANK01808                                           0x00001C40

// 8kB RAM
#define GPRAM_O_BANK01809                                           0x00001C44

// 8kB RAM
#define GPRAM_O_BANK01810                                           0x00001C48

// 8kB RAM
#define GPRAM_O_BANK01811                                           0x00001C4C

// 8kB RAM
#define GPRAM_O_BANK01812                                           0x00001C50

// 8kB RAM
#define GPRAM_O_BANK01813                                           0x00001C54

// 8kB RAM
#define GPRAM_O_BANK01814                                           0x00001C58

// 8kB RAM
#define GPRAM_O_BANK01815                                           0x00001C5C

// 8kB RAM
#define GPRAM_O_BANK01816                                           0x00001C60

// 8kB RAM
#define GPRAM_O_BANK01817                                           0x00001C64

