brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
// 8kB RAM
#define GPRAM_O_BANK01818                                           0x00001C68

// 8kB RAM
#define GPRAM_O_BANK01819                                           0x00001C6C

// 8kB RAM
#define GPRAM_O_BANK01820                                           0x00001C70

// 8kB RAM
#define GPRAM_O_BANK01821                                           0x00001C74

// 8kB RAM
#define GPRAM_O_BANK01822                                           0x00001C78

// 8kB RAM
#define GPRAM_O_BANK01823                                           0x00001C7C

// 8kB RAM
#define GPRAM_O_BANK01824                                           0x00001C80

// 8kB RAM
#define GPRAM_O_BANK01825                                           0x00001C84

// 8kB RAM
#define GPRAM_O_BANK01826                                           0x00001C88

// 8kB RAM
#define GPRAM_O_BANK01827                                           0x00001C8C

// 8kB RAM
#define GPRAM_O_BANK01828                                           0x00001C90

// 8kB RAM
#define GPRAM_O_BANK01829                                           0x00001C94

// 8kB RAM
#define GPRAM_O_BANK01830                                           0x00001C98

// 8kB RAM
#define GPRAM_O_BANK01831                                           0x00001C9C

// 8kB RAM
#define GPRAM_O_BANK01832                                           0x00001CA0

// 8kB RAM
#define GPRAM_O_BANK01833                                           0x00001CA4

// 8kB RAM
#define GPRAM_O_BANK01834                                           0x00001CA8

// 8kB RAM
#define GPRAM_O_BANK01835                                           0x00001CAC

// 8kB RAM
#define GPRAM_O_BANK01836                                           0x00001CB0

// 8kB RAM
#define GPRAM_O_BANK01837                                           0x00001CB4

// 8kB RAM
#define GPRAM_O_BANK01838                                           0x00001CB8

// 8kB RAM
#define GPRAM_O_BANK01839                                           0x00001CBC

// 8kB RAM
#define GPRAM_O_BANK01840                                           0x00001CC0

// 8kB RAM
#define GPRAM_O_BANK01841                                           0x00001CC4

// 8kB RAM
#define GPRAM_O_BANK01842                                           0x00001CC8

// 8kB RAM
#define GPRAM_O_BANK01843                                           0x00001CCC

// 8kB RAM
#define GPRAM_O_BANK01844                                           0x00001CD0

// 8kB RAM
#define GPRAM_O_BANK01845                                           0x00001CD4

// 8kB RAM
#define GPRAM_O_BANK01846                                           0x00001CD8

// 8kB RAM
#define GPRAM_O_BANK01847                                           0x00001CDC

// 8kB RAM
#define GPRAM_O_BANK01848                                           0x00001CE0

// 8kB RAM
#define GPRAM_O_BANK01849                                           0x00001CE4

// 8kB RAM
#define GPRAM_O_BANK01850                                           0x00001CE8

// 8kB RAM
#define GPRAM_O_BANK01851                                           0x00001CEC

// 8kB RAM
#define GPRAM_O_BANK01852                                           0x00001CF0

// 8kB RAM
#define GPRAM_O_BANK01853                                           0x00001CF4

// 8kB RAM
#define GPRAM_O_BANK01854                                           0x00001CF8

// 8kB RAM
#define GPRAM_O_BANK01855                                           0x00001CFC

// 8kB RAM
#define GPRAM_O_BANK01856                                           0x00001D00

// 8kB RAM
#define GPRAM_O_BANK01857                                           0x00001D04

// 8kB RAM
#define GPRAM_O_BANK01858                                           0x00001D08

// 8kB RAM
#define GPRAM_O_BANK01859                                           0x00001D0C

// 8kB RAM
#define GPRAM_O_BANK01860                                           0x00001D10

// 8kB RAM
#define GPRAM_O_BANK01861                                           0x00001D14

// 8kB RAM
#define GPRAM_O_BANK01862                                           0x00001D18

// 8kB RAM
#define GPRAM_O_BANK01863                                           0x00001D1C

// 8kB RAM
#define GPRAM_O_BANK01864                                           0x00001D20

// 8kB RAM
#define GPRAM_O_BANK01865                                           0x00001D24

// 8kB RAM
#define GPRAM_O_BANK01866                                           0x00001D28

// 8kB RAM
#define GPRAM_O_BANK01867                                           0x00001D2C

// 8kB RAM
#define GPRAM_O_BANK01868                                           0x00001D30

// 8kB RAM
#define GPRAM_O_BANK01869                                           0x00001D34

// 8kB RAM
#define GPRAM_O_BANK01870                                           0x00001D38

// 8kB RAM
#define GPRAM_O_BANK01871                                           0x00001D3C

// 8kB RAM
#define GPRAM_O_BANK01872                                           0x00001D40

// 8kB RAM
#define GPRAM_O_BANK01873                                           0x00001D44

// 8kB RAM
#define GPRAM_O_BANK01874                                           0x00001D48

// 8kB RAM
#define GPRAM_O_BANK01875                                           0x00001D4C

// 8kB RAM
#define GPRAM_O_BANK01876                                           0x00001D50

// 8kB RAM
#define GPRAM_O_BANK01877                                           0x00001D54

// 8kB RAM
#define GPRAM_O_BANK01878                                           0x00001D58

// 8kB RAM
#define GPRAM_O_BANK01879                                           0x00001D5C

// 8kB RAM
#define GPRAM_O_BANK01880                                           0x00001D60

// 8kB RAM
#define GPRAM_O_BANK01881                                           0x00001D64

// 8kB RAM
#define GPRAM_O_BANK01882                                           0x00001D68

// 8kB RAM
#define GPRAM_O_BANK01883                                           0x00001D6C

// 8kB RAM
#define GPRAM_O_BANK01884                                           0x00001D70

// 8kB RAM
#define GPRAM_O_BANK01885                                           0x00001D74

// 8kB RAM
#define GPRAM_O_BANK01886                                           0x00001D78

// 8kB RAM
#define GPRAM_O_BANK01887                                           0x00001D7C

// 8kB RAM
#define GPRAM_O_BANK01888                                           0x00001D80

// 8kB RAM
#define GPRAM_O_BANK01889                                           0x00001D84

// 8kB RAM
#define GPRAM_O_BANK01890                                           0x00001D88

// 8kB RAM
#define GPRAM_O_BANK01891                                           0x00001D8C

// 8kB RAM
#define GPRAM_O_BANK01892                                           0x00001D90

// 8kB RAM
#define GPRAM_O_BANK01893                                           0x00001D94

// 8kB RAM
#define GPRAM_O_BANK01894                                           0x00001D98

// 8kB RAM
#define GPRAM_O_BANK01895                                           0x00001D9C

// 8kB RAM
#define GPRAM_O_BANK01896                                           0x00001DA0

// 8kB RAM
#define GPRAM_O_BANK01897                                           0x00001DA4

// 8kB RAM
#define GPRAM_O_BANK01898                                           0x00001DA8

// 8kB RAM
#define GPRAM_O_BANK01899                                           0x00001DAC

// 8kB RAM
#define GPRAM_O_BANK01900                                           0x00001DB0

// 8kB RAM
#define GPRAM_O_BANK01901                                           0x00001DB4

// 8kB RAM
#define GPRAM_O_BANK01902                                           0x00001DB8

// 8kB RAM
#define GPRAM_O_BANK01903                                           0x00001DBC

// 8kB RAM
#define GPRAM_O_BANK01904                                           0x00001DC0

// 8kB RAM
#define GPRAM_O_BANK01905                                           0x00001DC4

// 8kB RAM
#define GPRAM_O_BANK01906                                           0x00001DC8

// 8kB RAM
#define GPRAM_O_BANK01907                                           0x00001DCC

// 8kB RAM
#define GPRAM_O_BANK01908                                           0x00001DD0

// 8kB RAM
#define GPRAM_O_BANK01909                                           0x00001DD4

// 8kB RAM
#define GPRAM_O_BANK01910                                           0x00001DD8

// 8kB RAM
#define GPRAM_O_BANK01911                                           0x00001DDC

// 8kB RAM
#define GPRAM_O_BANK01912                                           0x00001DE0

// 8kB RAM
#define GPRAM_O_BANK01913                                           0x00001DE4

// 8kB RAM
#define GPRAM_O_BANK01914                                           0x00001DE8

// 8kB RAM
#define GPRAM_O_BANK01915                                           0x00001DEC

// 8kB RAM
#define GPRAM_O_BANK01916                                           0x00001DF0

// 8kB RAM
#define GPRAM_O_BANK01917                                           0x00001DF4

// 8kB RAM
#define GPRAM_O_BANK01918                                           0x00001DF8

// 8kB RAM
#define GPRAM_O_BANK01919                                           0x00001DFC

// 8kB RAM
#define GPRAM_O_BANK01920                                           0x00001E00

// 8kB RAM
#define GPRAM_O_BANK01921                                           0x00001E04

// 8kB RAM
#define GPRAM_O_BANK01922                                           0x00001E08

// 8kB RAM
#define GPRAM_O_BANK01923                                           0x00001E0C

// 8kB RAM
#define GPRAM_O_BANK01924                                           0x00001E10

// 8kB RAM
#define GPRAM_O_BANK01925                                           0x00001E14

// 8kB RAM
#define GPRAM_O_BANK01926                                           0x00001E18

// 8kB RAM
#define GPRAM_O_BANK01927                                           0x00001E1C

// 8kB RAM
#define GPRAM_O_BANK01928                                           0x00001E20

// 8kB RAM
#define GPRAM_O_BANK01929                                           0x00001E24

// 8kB RAM
#define GPRAM_O_BANK01930                                           0x00001E28

// 8kB RAM
#define GPRAM_O_BANK01931                                           0x00001E2C

// 8kB RAM
#define GPRAM_O_BANK01932                                           0x00001E30

// 8kB RAM
#define GPRAM_O_BANK01933                                           0x00001E34

// 8kB RAM
#define GPRAM_O_BANK01934                                           0x00001E38

// 8kB RAM
#define GPRAM_O_BANK01935                                           0x00001E3C

// 8kB RAM
#define GPRAM_O_BANK01936                                           0x00001E40

// 8kB RAM
#define GPRAM_O_BANK01937                                           0x00001E44

// 8kB RAM
#define GPRAM_O_BANK01938                                           0x00001E48

// 8kB RAM
#define GPRAM_O_BANK01939                                           0x00001E4C

// 8kB RAM
#define GPRAM_O_BANK01940                                           0x00001E50

// 8kB RAM
#define GPRAM_O_BANK01941                                           0x00001E54

// 8kB RAM
#define GPRAM_O_BANK01942                                           0x00001E58

// 8kB RAM
#define GPRAM_O_BANK01943                                           0x00001E5C

// 8kB RAM
#define GPRAM_O_BANK01944                                           0x00001E60

// 8kB RAM
#define GPRAM_O_BANK01945                                           0x00001E64

// 8kB RAM
#define GPRAM_O_BANK01946                                           0x00001E68

// 8kB RAM
#define GPRAM_O_BANK01947                                           0x00001E6C

// 8kB RAM
#define GPRAM_O_BANK01948                                           0x00001E70

// 8kB RAM
#define GPRAM_O_BANK01949                                           0x00001E74

// 8kB RAM
#define GPRAM_O_BANK01950                                           0x00001E78

// 8kB RAM
#define GPRAM_O_BANK01951                                           0x00001E7C

// 8kB RAM
#define GPRAM_O_BANK01952                                           0x00001E80

// 8kB RAM
#define GPRAM_O_BANK01953                                           0x00001E84

// 8kB RAM
#define GPRAM_O_BANK01954                                           0x00001E88

// 8kB RAM
#define GPRAM_O_BANK01955                                           0x00001E8C

// 8kB RAM
#define GPRAM_O_BANK01956                                           0x00001E90

// 8kB RAM
#define GPRAM_O_BANK01957                                           0x00001E94

// 8kB RAM
#define GPRAM_O_BANK01958                                           0x00001E98

// 8kB RAM
#define GPRAM_O_BANK01959                                           0x00001E9C

// 8kB RAM
#define GPRAM_O_BANK01960                                           0x00001EA0

// 8kB RAM
#define GPRAM_O_BANK01961                                           0x00001EA4

// 8kB RAM
#define GPRAM_O_BANK01962                                           0x00001EA8

// 8kB RAM
#define GPRAM_O_BANK01963                                           0x00001EAC

// 8kB RAM
#define GPRAM_O_BANK01964                                           0x00001EB0

// 8kB RAM
#define GPRAM_O_BANK01965                                           0x00001EB4

// 8kB RAM
#define GPRAM_O_BANK01966                                           0x00001EB8

// 8kB RAM
#define GPRAM_O_BANK01967                                           0x00001EBC

// 8kB RAM
#define GPRAM_O_BANK01968                                           0x00001EC0

// 8kB RAM
#define GPRAM_O_BANK01969                                           0x00001EC4

// 8kB RAM
#define GPRAM_O_BANK01970                                           0x00001EC8

// 8kB RAM
#define GPRAM_O_BANK01971                                           0x00001ECC

// 8kB RAM
#define GPRAM_O_BANK01972                                           0x00001ED0

// 8kB RAM
#define GPRAM_O_BANK01973                                           0x00001ED4

// 8kB RAM
#define GPRAM_O_BANK01974                                           0x00001ED8

// 8kB RAM
#define GPRAM_O_BANK01975                                           0x00001EDC

// 8kB RAM
#define GPRAM_O_BANK01976                                           0x00001EE0

// 8kB RAM
#define GPRAM_O_BANK01977                                           0x00001EE4

// 8kB RAM
#define GPRAM_O_BANK01978                                           0x00001EE8

// 8kB RAM
#define GPRAM_O_BANK01979                                           0x00001EEC

// 8kB RAM
#define GPRAM_O_BANK01980                                           0x00001EF0

// 8kB RAM
#define GPRAM_O_BANK01981                                           0x00001EF4

// 8kB RAM
#define GPRAM_O_BANK01982                                           0x00001EF8

// 8kB RAM
#define GPRAM_O_BANK01983                                           0x00001EFC

// 8kB RAM
#define GPRAM_O_BANK01984                                           0x00001F00

// 8kB RAM
#define GPRAM_O_BANK01985                                           0x00001F04

// 8kB RAM
#define GPRAM_O_BANK01986                                           0x00001F08

// 8kB RAM
#define GPRAM_O_BANK01987                                           0x00001F0C

// 8kB RAM
#define GPRAM_O_BANK01988                                           0x00001F10

// 8kB RAM
#define GPRAM_O_BANK01989                                           0x00001F14

// 8kB RAM
#define GPRAM_O_BANK01990                                           0x00001F18

// 8kB RAM
#define GPRAM_O_BANK01991                                           0x00001F1C

// 8kB RAM
#define GPRAM_O_BANK01992                                           0x00001F20

// 8kB RAM
#define GPRAM_O_BANK01993                                           0x00001F24

// 8kB RAM
#define GPRAM_O_BANK01994                                           0x00001F28

// 8kB RAM
#define GPRAM_O_BANK01995                                           0x00001F2C

// 8kB RAM
#define GPRAM_O_BANK01996                                           0x00001F30

// 8kB RAM
#define GPRAM_O_BANK01997                                           0x00001F34

// 8kB RAM
#define GPRAM_O_BANK01998                                           0x00001F38

// 8kB RAM
#define GPRAM_O_BANK01999                                           0x00001F3C

// 8kB RAM
#define GPRAM_O_BANK02000                                           0x00001F40

// 8kB RAM
#define GPRAM_O_BANK02001                                           0x00001F44

// 8kB RAM
#define GPRAM_O_BANK02002                                           0x00001F48

// 8kB RAM
#define GPRAM_O_BANK02003                                           0x00001F4C

// 8kB RAM
#define GPRAM_O_BANK02004                                           0x00001F50

// 8kB RAM
#define GPRAM_O_BANK02005                                           0x00001F54

// 8kB RAM
#define GPRAM_O_BANK02006                                           0x00001F58

// 8kB RAM
#define GPRAM_O_BANK02007                                           0x00001F5C

// 8kB RAM
#define GPRAM_O_BANK02008                                           0x00001F60

// 8kB RAM
#define GPRAM_O_BANK02009                                           0x00001F64

// 8kB RAM
#define GPRAM_O_BANK02010                                           0x00001F68

// 8kB RAM
#define GPRAM_O_BANK02011                                           0x00001F6C

// 8kB RAM
#define GPRAM_O_BANK02012                                           0x00001F70

// 8kB RAM
#define GPRAM_O_BANK02013                                           0x00001F74

// 8kB RAM
#define GPRAM_O_BANK02014                                           0x00001F78

// 8kB RAM
#define GPRAM_O_BANK02015                                           0x00001F7C

// 8kB RAM
#define GPRAM_O_BANK02016                                           0x00001F80

// 8kB RAM
#define GPRAM_O_BANK02017                                           0x00001F84

// 8kB RAM
#define GPRAM_O_BANK02018                                           0x00001F88

// 8kB RAM
#define GPRAM_O_BANK02019                                           0x00001F8C

// 8kB RAM
#define GPRAM_O_BANK02020                                           0x00001F90

// 8kB RAM
#define GPRAM_O_BANK02021                                           0x00001F94

// 8kB RAM
#define GPRAM_O_BANK02022                                           0x00001F98

// 8kB RAM
#define GPRAM_O_BANK02023                                           0x00001F9C

// 8kB RAM
#define GPRAM_O_BANK02024                                           0x00001FA0

// 8kB RAM
#define GPRAM_O_BANK02025                                           0x00001FA4

// 8kB RAM
#define GPRAM_O_BANK02026                                           0x00001FA8

// 8kB RAM
#define GPRAM_O_BANK02027                                           0x00001FAC

// 8kB RAM
#define GPRAM_O_BANK02028                                           0x00001FB0

// 8kB RAM
#define GPRAM_O_BANK02029                                           0x00001FB4

// 8kB RAM
#define GPRAM_O_BANK02030                                           0x00001FB8

// 8kB RAM
#define GPRAM_O_BANK02031                                           0x00001FBC

// 8kB RAM
#define GPRAM_O_BANK02032                                           0x00001FC0

// 8kB RAM
#define GPRAM_O_BANK02033                                           0x00001FC4

// 8kB RAM
#define GPRAM_O_BANK02034                                           0x00001FC8

// 8kB RAM
#define GPRAM_O_BANK02035                                           0x00001FCC

// 8kB RAM
#define GPRAM_O_BANK02036                                           0x00001FD0

// 8kB RAM
#define GPRAM_O_BANK02037                                           0x00001FD4

// 8kB RAM
#define GPRAM_O_BANK02038                                           0x00001FD8

// 8kB RAM
#define GPRAM_O_BANK02039                                           0x00001FDC

// 8kB RAM
#define GPRAM_O_BANK02040                                           0x00001FE0

// 8kB RAM
#define GPRAM_O_BANK02041                                           0x00001FE4

// 8kB RAM
#define GPRAM_O_BANK02042                                           0x00001FE8

// 8kB RAM
#define GPRAM_O_BANK02043                                           0x00001FEC

// 8kB RAM
#define GPRAM_O_BANK02044                                           0x00001FF0

// 8kB RAM
#define GPRAM_O_BANK02045                                           0x00001FF4

// 8kB RAM
#define GPRAM_O_BANK02046                                           0x00001FF8

// 8kB RAM
#define GPRAM_O_BANK02047                                           0x00001FFC

//*****************************************************************************
//
// Register: GPRAM_O_BANK00
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK00_DATA_W                                                 32
#define GPRAM_BANK00_DATA_M                                         0xFFFFFFFF
#define GPRAM_BANK00_DATA_S                                                  0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01_DATA_W                                                 32
#define GPRAM_BANK01_DATA_M                                         0xFFFFFFFF
#define GPRAM_BANK01_DATA_S                                                  0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02_DATA_W                                                 32
#define GPRAM_BANK02_DATA_M                                         0xFFFFFFFF
#define GPRAM_BANK02_DATA_S                                                  0

//*****************************************************************************
//
// Register: GPRAM_O_BANK03
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK03_DATA_W                                                 32
#define GPRAM_BANK03_DATA_M                                         0xFFFFFFFF
#define GPRAM_BANK03_DATA_S                                                  0

//*****************************************************************************
//
// Register: GPRAM_O_BANK04
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK04_DATA_W                                                 32
#define GPRAM_BANK04_DATA_M                                         0xFFFFFFFF
#define GPRAM_BANK04_DATA_S                                                  0

//*****************************************************************************
//
// Register: GPRAM_O_BANK05
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK05_DATA_W                                                 32
#define GPRAM_BANK05_DATA_M                                         0xFFFFFFFF
#define GPRAM_BANK05_DATA_S                                                  0

