brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK06
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK06_DATA_W                                                 32
#define GPRAM_BANK06_DATA_M                                         0xFFFFFFFF
#define GPRAM_BANK06_DATA_S                                                  0

//*****************************************************************************
//
// Register: GPRAM_O_BANK07
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK07_DATA_W                                                 32
#define GPRAM_BANK07_DATA_M                                         0xFFFFFFFF
#define GPRAM_BANK07_DATA_S                                                  0

//*****************************************************************************
//
// Register: GPRAM_O_BANK08
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK08_DATA_W                                                 32
#define GPRAM_BANK08_DATA_M                                         0xFFFFFFFF
#define GPRAM_BANK08_DATA_S                                                  0

//*****************************************************************************
//
// Register: GPRAM_O_BANK09
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK09_DATA_W                                                 32
#define GPRAM_BANK09_DATA_M                                         0xFFFFFFFF
#define GPRAM_BANK09_DATA_S                                                  0

//*****************************************************************************
//
// Register: GPRAM_O_BANK010
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK010_DATA_W                                                32
#define GPRAM_BANK010_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK010_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK011
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK011_DATA_W                                                32
#define GPRAM_BANK011_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK011_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK012
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK012_DATA_W                                                32
#define GPRAM_BANK012_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK012_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK013
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK013_DATA_W                                                32
#define GPRAM_BANK013_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK013_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK014
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK014_DATA_W                                                32
#define GPRAM_BANK014_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK014_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK015
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK015_DATA_W                                                32
#define GPRAM_BANK015_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK015_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK016
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK016_DATA_W                                                32
#define GPRAM_BANK016_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK016_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK017
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK017_DATA_W                                                32
#define GPRAM_BANK017_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK017_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK018
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK018_DATA_W                                                32
#define GPRAM_BANK018_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK018_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK019
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK019_DATA_W                                                32
#define GPRAM_BANK019_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK019_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK020
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK020_DATA_W                                                32
#define GPRAM_BANK020_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK020_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK021
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK021_DATA_W                                                32
#define GPRAM_BANK021_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK021_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK022
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK022_DATA_W                                                32
#define GPRAM_BANK022_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK022_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK023
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK023_DATA_W                                                32
#define GPRAM_BANK023_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK023_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK024
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK024_DATA_W                                                32
#define GPRAM_BANK024_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK024_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK025
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK025_DATA_W                                                32
#define GPRAM_BANK025_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK025_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK026
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK026_DATA_W                                                32
#define GPRAM_BANK026_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK026_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK027
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK027_DATA_W                                                32
#define GPRAM_BANK027_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK027_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK028
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK028_DATA_W                                                32
#define GPRAM_BANK028_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK028_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK029
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK029_DATA_W                                                32
#define GPRAM_BANK029_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK029_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK030
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK030_DATA_W                                                32
#define GPRAM_BANK030_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK030_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK031
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK031_DATA_W                                                32
#define GPRAM_BANK031_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK031_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK032
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK032_DATA_W                                                32
#define GPRAM_BANK032_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK032_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK033
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK033_DATA_W                                                32
#define GPRAM_BANK033_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK033_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK034
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK034_DATA_W                                                32
#define GPRAM_BANK034_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK034_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK035
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK035_DATA_W                                                32
#define GPRAM_BANK035_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK035_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK036
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK036_DATA_W                                                32
#define GPRAM_BANK036_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK036_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK037
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK037_DATA_W                                                32
#define GPRAM_BANK037_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK037_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK038
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK038_DATA_W                                                32
#define GPRAM_BANK038_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK038_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK039
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK039_DATA_W                                                32
#define GPRAM_BANK039_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK039_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK040
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK040_DATA_W                                                32
#define GPRAM_BANK040_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK040_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK041
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK041_DATA_W                                                32
#define GPRAM_BANK041_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK041_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK042
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK042_DATA_W                                                32
#define GPRAM_BANK042_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK042_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK043
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK043_DATA_W                                                32
#define GPRAM_BANK043_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK043_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK044
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK044_DATA_W                                                32
#define GPRAM_BANK044_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK044_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK045
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK045_DATA_W                                                32
#define GPRAM_BANK045_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK045_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK046
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK046_DATA_W                                                32
#define GPRAM_BANK046_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK046_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK047
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK047_DATA_W                                                32
#define GPRAM_BANK047_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK047_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK048
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK048_DATA_W                                                32
#define GPRAM_BANK048_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK048_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK049
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK049_DATA_W                                                32
#define GPRAM_BANK049_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK049_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK050
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK050_DATA_W                                                32
#define GPRAM_BANK050_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK050_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK051
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK051_DATA_W                                                32
#define GPRAM_BANK051_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK051_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK052
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK052_DATA_W                                                32
#define GPRAM_BANK052_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK052_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK053
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK053_DATA_W                                                32
#define GPRAM_BANK053_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK053_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK054
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK054_DATA_W                                                32
#define GPRAM_BANK054_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK054_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK055
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK055_DATA_W                                                32
#define GPRAM_BANK055_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK055_DATA_S                                                 0

