brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK056
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK056_DATA_W                                                32
#define GPRAM_BANK056_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK056_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK057
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK057_DATA_W                                                32
#define GPRAM_BANK057_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK057_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK058
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK058_DATA_W                                                32
#define GPRAM_BANK058_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK058_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK059
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK059_DATA_W                                                32
#define GPRAM_BANK059_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK059_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK060
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK060_DATA_W                                                32
#define GPRAM_BANK060_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK060_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK061
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK061_DATA_W                                                32
#define GPRAM_BANK061_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK061_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK062
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK062_DATA_W                                                32
#define GPRAM_BANK062_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK062_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK063
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK063_DATA_W                                                32
#define GPRAM_BANK063_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK063_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK064
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK064_DATA_W                                                32
#define GPRAM_BANK064_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK064_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK065
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK065_DATA_W                                                32
#define GPRAM_BANK065_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK065_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK066
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK066_DATA_W                                                32
#define GPRAM_BANK066_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK066_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK067
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK067_DATA_W                                                32
#define GPRAM_BANK067_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK067_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK068
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK068_DATA_W                                                32
#define GPRAM_BANK068_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK068_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK069
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK069_DATA_W                                                32
#define GPRAM_BANK069_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK069_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK070
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK070_DATA_W                                                32
#define GPRAM_BANK070_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK070_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK071
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK071_DATA_W                                                32
#define GPRAM_BANK071_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK071_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK072
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK072_DATA_W                                                32
#define GPRAM_BANK072_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK072_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK073
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK073_DATA_W                                                32
#define GPRAM_BANK073_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK073_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK074
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK074_DATA_W                                                32
#define GPRAM_BANK074_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK074_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK075
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK075_DATA_W                                                32
#define GPRAM_BANK075_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK075_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK076
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK076_DATA_W                                                32
#define GPRAM_BANK076_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK076_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK077
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK077_DATA_W                                                32
#define GPRAM_BANK077_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK077_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK078
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK078_DATA_W                                                32
#define GPRAM_BANK078_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK078_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK079
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK079_DATA_W                                                32
#define GPRAM_BANK079_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK079_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK080
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK080_DATA_W                                                32
#define GPRAM_BANK080_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK080_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK081
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK081_DATA_W                                                32
#define GPRAM_BANK081_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK081_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK082
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK082_DATA_W                                                32
#define GPRAM_BANK082_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK082_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK083
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK083_DATA_W                                                32
#define GPRAM_BANK083_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK083_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK084
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK084_DATA_W                                                32
#define GPRAM_BANK084_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK084_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK085
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK085_DATA_W                                                32
#define GPRAM_BANK085_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK085_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK086
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK086_DATA_W                                                32
#define GPRAM_BANK086_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK086_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK087
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK087_DATA_W                                                32
#define GPRAM_BANK087_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK087_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK088
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK088_DATA_W                                                32
#define GPRAM_BANK088_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK088_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK089
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK089_DATA_W                                                32
#define GPRAM_BANK089_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK089_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK090
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK090_DATA_W                                                32
#define GPRAM_BANK090_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK090_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK091
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK091_DATA_W                                                32
#define GPRAM_BANK091_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK091_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK092
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK092_DATA_W                                                32
#define GPRAM_BANK092_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK092_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK093
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK093_DATA_W                                                32
#define GPRAM_BANK093_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK093_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK094
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK094_DATA_W                                                32
#define GPRAM_BANK094_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK094_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK095
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK095_DATA_W                                                32
#define GPRAM_BANK095_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK095_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK096
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK096_DATA_W                                                32
#define GPRAM_BANK096_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK096_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK097
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK097_DATA_W                                                32
#define GPRAM_BANK097_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK097_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK098
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK098_DATA_W                                                32
#define GPRAM_BANK098_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK098_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK099
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK099_DATA_W                                                32
#define GPRAM_BANK099_DATA_M                                        0xFFFFFFFF
#define GPRAM_BANK099_DATA_S                                                 0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0100
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0100_DATA_W                                               32
#define GPRAM_BANK0100_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0100_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0101
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0101_DATA_W                                               32
#define GPRAM_BANK0101_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0101_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0102
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0102_DATA_W                                               32
#define GPRAM_BANK0102_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0102_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0103
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0103_DATA_W                                               32
#define GPRAM_BANK0103_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0103_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0104
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0104_DATA_W                                               32
#define GPRAM_BANK0104_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0104_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0105
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0105_DATA_W                                               32
#define GPRAM_BANK0105_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0105_DATA_S                                                0

