brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0106
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0106_DATA_W                                               32
#define GPRAM_BANK0106_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0106_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0107
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0107_DATA_W                                               32
#define GPRAM_BANK0107_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0107_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0108
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0108_DATA_W                                               32
#define GPRAM_BANK0108_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0108_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0109
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0109_DATA_W                                               32
#define GPRAM_BANK0109_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0109_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0110
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0110_DATA_W                                               32
#define GPRAM_BANK0110_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0110_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0111
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0111_DATA_W                                               32
#define GPRAM_BANK0111_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0111_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0112
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0112_DATA_W                                               32
#define GPRAM_BANK0112_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0112_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0113
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0113_DATA_W                                               32
#define GPRAM_BANK0113_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0113_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0114
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0114_DATA_W                                               32
#define GPRAM_BANK0114_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0114_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0115
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0115_DATA_W                                               32
#define GPRAM_BANK0115_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0115_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0116
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0116_DATA_W                                               32
#define GPRAM_BANK0116_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0116_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0117
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0117_DATA_W                                               32
#define GPRAM_BANK0117_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0117_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0118
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0118_DATA_W                                               32
#define GPRAM_BANK0118_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0118_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0119
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0119_DATA_W                                               32
#define GPRAM_BANK0119_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0119_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0120
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0120_DATA_W                                               32
#define GPRAM_BANK0120_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0120_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0121
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0121_DATA_W                                               32
#define GPRAM_BANK0121_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0121_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0122
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0122_DATA_W                                               32
#define GPRAM_BANK0122_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0122_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0123
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0123_DATA_W                                               32
#define GPRAM_BANK0123_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0123_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0124
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0124_DATA_W                                               32
#define GPRAM_BANK0124_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0124_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0125
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0125_DATA_W                                               32
#define GPRAM_BANK0125_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0125_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0126
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0126_DATA_W                                               32
#define GPRAM_BANK0126_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0126_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0127
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0127_DATA_W                                               32
#define GPRAM_BANK0127_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0127_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0128
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0128_DATA_W                                               32
#define GPRAM_BANK0128_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0128_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0129
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0129_DATA_W                                               32
#define GPRAM_BANK0129_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0129_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0130
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0130_DATA_W                                               32
#define GPRAM_BANK0130_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0130_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0131
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0131_DATA_W                                               32
#define GPRAM_BANK0131_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0131_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0132
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0132_DATA_W                                               32
#define GPRAM_BANK0132_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0132_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0133
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0133_DATA_W                                               32
#define GPRAM_BANK0133_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0133_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0134
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0134_DATA_W                                               32
#define GPRAM_BANK0134_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0134_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0135
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0135_DATA_W                                               32
#define GPRAM_BANK0135_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0135_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0136
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0136_DATA_W                                               32
#define GPRAM_BANK0136_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0136_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0137
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0137_DATA_W                                               32
#define GPRAM_BANK0137_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0137_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0138
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0138_DATA_W                                               32
#define GPRAM_BANK0138_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0138_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0139
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0139_DATA_W                                               32
#define GPRAM_BANK0139_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0139_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0140
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0140_DATA_W                                               32
#define GPRAM_BANK0140_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0140_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0141
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0141_DATA_W                                               32
#define GPRAM_BANK0141_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0141_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0142
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0142_DATA_W                                               32
#define GPRAM_BANK0142_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0142_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0143
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0143_DATA_W                                               32
#define GPRAM_BANK0143_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0143_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0144
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0144_DATA_W                                               32
#define GPRAM_BANK0144_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0144_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0145
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0145_DATA_W                                               32
#define GPRAM_BANK0145_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0145_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0146
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0146_DATA_W                                               32
#define GPRAM_BANK0146_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0146_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0147
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0147_DATA_W                                               32
#define GPRAM_BANK0147_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0147_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0148
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0148_DATA_W                                               32
#define GPRAM_BANK0148_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0148_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0149
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0149_DATA_W                                               32
#define GPRAM_BANK0149_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0149_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0150
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0150_DATA_W                                               32
#define GPRAM_BANK0150_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0150_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0151
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0151_DATA_W                                               32
#define GPRAM_BANK0151_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0151_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0152
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0152_DATA_W                                               32
#define GPRAM_BANK0152_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0152_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0153
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0153_DATA_W                                               32
#define GPRAM_BANK0153_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0153_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0154
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0154_DATA_W                                               32
#define GPRAM_BANK0154_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0154_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0155
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0155_DATA_W                                               32
#define GPRAM_BANK0155_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0155_DATA_S                                                0

