brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0156
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0156_DATA_W                                               32
#define GPRAM_BANK0156_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0156_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0157
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0157_DATA_W                                               32
#define GPRAM_BANK0157_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0157_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0158
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0158_DATA_W                                               32
#define GPRAM_BANK0158_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0158_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0159
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0159_DATA_W                                               32
#define GPRAM_BANK0159_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0159_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0160
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0160_DATA_W                                               32
#define GPRAM_BANK0160_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0160_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0161
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0161_DATA_W                                               32
#define GPRAM_BANK0161_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0161_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0162
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0162_DATA_W                                               32
#define GPRAM_BANK0162_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0162_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0163
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0163_DATA_W                                               32
#define GPRAM_BANK0163_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0163_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0164
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0164_DATA_W                                               32
#define GPRAM_BANK0164_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0164_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0165
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0165_DATA_W                                               32
#define GPRAM_BANK0165_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0165_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0166
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0166_DATA_W                                               32
#define GPRAM_BANK0166_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0166_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0167
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0167_DATA_W                                               32
#define GPRAM_BANK0167_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0167_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0168
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0168_DATA_W                                               32
#define GPRAM_BANK0168_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0168_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0169
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0169_DATA_W                                               32
#define GPRAM_BANK0169_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0169_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0170
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0170_DATA_W                                               32
#define GPRAM_BANK0170_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0170_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0171
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0171_DATA_W                                               32
#define GPRAM_BANK0171_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0171_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0172
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0172_DATA_W                                               32
#define GPRAM_BANK0172_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0172_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0173
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0173_DATA_W                                               32
#define GPRAM_BANK0173_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0173_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0174
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0174_DATA_W                                               32
#define GPRAM_BANK0174_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0174_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0175
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0175_DATA_W                                               32
#define GPRAM_BANK0175_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0175_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0176
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0176_DATA_W                                               32
#define GPRAM_BANK0176_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0176_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0177
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0177_DATA_W                                               32
#define GPRAM_BANK0177_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0177_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0178
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0178_DATA_W                                               32
#define GPRAM_BANK0178_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0178_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0179
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0179_DATA_W                                               32
#define GPRAM_BANK0179_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0179_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0180
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0180_DATA_W                                               32
#define GPRAM_BANK0180_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0180_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0181
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0181_DATA_W                                               32
#define GPRAM_BANK0181_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0181_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0182
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0182_DATA_W                                               32
#define GPRAM_BANK0182_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0182_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0183
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0183_DATA_W                                               32
#define GPRAM_BANK0183_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0183_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0184
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0184_DATA_W                                               32
#define GPRAM_BANK0184_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0184_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0185
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0185_DATA_W                                               32
#define GPRAM_BANK0185_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0185_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0186
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0186_DATA_W                                               32
#define GPRAM_BANK0186_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0186_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0187
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0187_DATA_W                                               32
#define GPRAM_BANK0187_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0187_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0188
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0188_DATA_W                                               32
#define GPRAM_BANK0188_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0188_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0189
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0189_DATA_W                                               32
#define GPRAM_BANK0189_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0189_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0190
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0190_DATA_W                                               32
#define GPRAM_BANK0190_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0190_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0191
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0191_DATA_W                                               32
#define GPRAM_BANK0191_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0191_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0192
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0192_DATA_W                                               32
#define GPRAM_BANK0192_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0192_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0193
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0193_DATA_W                                               32
#define GPRAM_BANK0193_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0193_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0194
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0194_DATA_W                                               32
#define GPRAM_BANK0194_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0194_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0195
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0195_DATA_W                                               32
#define GPRAM_BANK0195_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0195_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0196
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0196_DATA_W                                               32
#define GPRAM_BANK0196_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0196_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0197
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0197_DATA_W                                               32
#define GPRAM_BANK0197_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0197_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0198
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0198_DATA_W                                               32
#define GPRAM_BANK0198_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0198_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0199
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0199_DATA_W                                               32
#define GPRAM_BANK0199_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0199_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0200
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0200_DATA_W                                               32
#define GPRAM_BANK0200_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0200_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0201
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0201_DATA_W                                               32
#define GPRAM_BANK0201_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0201_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0202
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0202_DATA_W                                               32
#define GPRAM_BANK0202_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0202_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0203
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0203_DATA_W                                               32
#define GPRAM_BANK0203_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0203_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0204
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0204_DATA_W                                               32
#define GPRAM_BANK0204_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0204_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0205
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0205_DATA_W                                               32
#define GPRAM_BANK0205_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0205_DATA_S                                                0

