brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0256
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0256_DATA_W                                               32
#define GPRAM_BANK0256_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0256_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0257
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0257_DATA_W                                               32
#define GPRAM_BANK0257_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0257_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0258
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0258_DATA_W                                               32
#define GPRAM_BANK0258_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0258_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0259
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0259_DATA_W                                               32
#define GPRAM_BANK0259_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0259_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0260
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0260_DATA_W                                               32
#define GPRAM_BANK0260_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0260_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0261
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0261_DATA_W                                               32
#define GPRAM_BANK0261_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0261_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0262
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0262_DATA_W                                               32
#define GPRAM_BANK0262_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0262_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0263
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0263_DATA_W                                               32
#define GPRAM_BANK0263_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0263_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0264
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0264_DATA_W                                               32
#define GPRAM_BANK0264_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0264_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0265
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0265_DATA_W                                               32
#define GPRAM_BANK0265_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0265_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0266
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0266_DATA_W                                               32
#define GPRAM_BANK0266_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0266_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0267
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0267_DATA_W                                               32
#define GPRAM_BANK0267_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0267_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0268
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0268_DATA_W                                               32
#define GPRAM_BANK0268_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0268_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0269
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0269_DATA_W                                               32
#define GPRAM_BANK0269_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0269_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0270
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0270_DATA_W                                               32
#define GPRAM_BANK0270_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0270_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0271
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0271_DATA_W                                               32
#define GPRAM_BANK0271_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0271_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0272
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0272_DATA_W                                               32
#define GPRAM_BANK0272_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0272_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0273
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0273_DATA_W                                               32
#define GPRAM_BANK0273_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0273_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0274
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0274_DATA_W                                               32
#define GPRAM_BANK0274_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0274_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0275
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0275_DATA_W                                               32
#define GPRAM_BANK0275_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0275_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0276
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0276_DATA_W                                               32
#define GPRAM_BANK0276_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0276_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0277
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0277_DATA_W                                               32
#define GPRAM_BANK0277_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0277_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0278
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0278_DATA_W                                               32
#define GPRAM_BANK0278_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0278_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0279
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0279_DATA_W                                               32
#define GPRAM_BANK0279_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0279_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0280
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0280_DATA_W                                               32
#define GPRAM_BANK0280_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0280_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0281
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0281_DATA_W                                               32
#define GPRAM_BANK0281_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0281_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0282
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0282_DATA_W                                               32
#define GPRAM_BANK0282_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0282_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0283
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0283_DATA_W                                               32
#define GPRAM_BANK0283_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0283_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0284
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0284_DATA_W                                               32
#define GPRAM_BANK0284_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0284_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0285
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0285_DATA_W                                               32
#define GPRAM_BANK0285_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0285_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0286
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0286_DATA_W                                               32
#define GPRAM_BANK0286_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0286_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0287
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0287_DATA_W                                               32
#define GPRAM_BANK0287_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0287_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0288
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0288_DATA_W                                               32
#define GPRAM_BANK0288_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0288_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0289
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0289_DATA_W                                               32
#define GPRAM_BANK0289_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0289_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0290
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0290_DATA_W                                               32
#define GPRAM_BANK0290_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0290_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0291
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0291_DATA_W                                               32
#define GPRAM_BANK0291_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0291_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0292
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0292_DATA_W                                               32
#define GPRAM_BANK0292_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0292_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0293
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0293_DATA_W                                               32
#define GPRAM_BANK0293_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0293_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0294
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0294_DATA_W                                               32
#define GPRAM_BANK0294_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0294_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0295
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0295_DATA_W                                               32
#define GPRAM_BANK0295_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0295_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0296
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0296_DATA_W                                               32
#define GPRAM_BANK0296_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0296_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0297
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0297_DATA_W                                               32
#define GPRAM_BANK0297_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0297_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0298
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0298_DATA_W                                               32
#define GPRAM_BANK0298_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0298_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0299
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0299_DATA_W                                               32
#define GPRAM_BANK0299_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0299_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0300
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0300_DATA_W                                               32
#define GPRAM_BANK0300_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0300_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0301
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0301_DATA_W                                               32
#define GPRAM_BANK0301_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0301_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0302
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0302_DATA_W                                               32
#define GPRAM_BANK0302_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0302_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0303
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0303_DATA_W                                               32
#define GPRAM_BANK0303_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0303_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0304
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0304_DATA_W                                               32
#define GPRAM_BANK0304_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0304_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0305
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0305_DATA_W                                               32
#define GPRAM_BANK0305_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0305_DATA_S                                                0

