brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0306
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0306_DATA_W                                               32
#define GPRAM_BANK0306_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0306_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0307
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0307_DATA_W                                               32
#define GPRAM_BANK0307_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0307_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0308
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0308_DATA_W                                               32
#define GPRAM_BANK0308_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0308_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0309
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0309_DATA_W                                               32
#define GPRAM_BANK0309_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0309_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0310
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0310_DATA_W                                               32
#define GPRAM_BANK0310_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0310_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0311
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0311_DATA_W                                               32
#define GPRAM_BANK0311_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0311_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0312
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0312_DATA_W                                               32
#define GPRAM_BANK0312_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0312_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0313
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0313_DATA_W                                               32
#define GPRAM_BANK0313_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0313_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0314
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0314_DATA_W                                               32
#define GPRAM_BANK0314_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0314_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0315
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0315_DATA_W                                               32
#define GPRAM_BANK0315_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0315_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0316
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0316_DATA_W                                               32
#define GPRAM_BANK0316_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0316_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0317
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0317_DATA_W                                               32
#define GPRAM_BANK0317_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0317_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0318
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0318_DATA_W                                               32
#define GPRAM_BANK0318_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0318_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0319
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0319_DATA_W                                               32
#define GPRAM_BANK0319_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0319_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0320
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0320_DATA_W                                               32
#define GPRAM_BANK0320_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0320_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0321
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0321_DATA_W                                               32
#define GPRAM_BANK0321_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0321_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0322
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0322_DATA_W                                               32
#define GPRAM_BANK0322_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0322_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0323
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0323_DATA_W                                               32
#define GPRAM_BANK0323_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0323_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0324
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0324_DATA_W                                               32
#define GPRAM_BANK0324_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0324_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0325
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0325_DATA_W                                               32
#define GPRAM_BANK0325_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0325_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0326
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0326_DATA_W                                               32
#define GPRAM_BANK0326_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0326_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0327
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0327_DATA_W                                               32
#define GPRAM_BANK0327_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0327_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0328
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0328_DATA_W                                               32
#define GPRAM_BANK0328_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0328_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0329
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0329_DATA_W                                               32
#define GPRAM_BANK0329_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0329_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0330
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0330_DATA_W                                               32
#define GPRAM_BANK0330_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0330_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0331
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0331_DATA_W                                               32
#define GPRAM_BANK0331_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0331_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0332
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0332_DATA_W                                               32
#define GPRAM_BANK0332_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0332_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0333
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0333_DATA_W                                               32
#define GPRAM_BANK0333_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0333_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0334
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0334_DATA_W                                               32
#define GPRAM_BANK0334_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0334_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0335
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0335_DATA_W                                               32
#define GPRAM_BANK0335_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0335_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0336
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0336_DATA_W                                               32
#define GPRAM_BANK0336_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0336_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0337
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0337_DATA_W                                               32
#define GPRAM_BANK0337_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0337_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0338
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0338_DATA_W                                               32
#define GPRAM_BANK0338_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0338_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0339
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0339_DATA_W                                               32
#define GPRAM_BANK0339_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0339_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0340
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0340_DATA_W                                               32
#define GPRAM_BANK0340_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0340_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0341
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0341_DATA_W                                               32
#define GPRAM_BANK0341_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0341_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0342
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0342_DATA_W                                               32
#define GPRAM_BANK0342_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0342_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0343
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0343_DATA_W                                               32
#define GPRAM_BANK0343_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0343_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0344
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0344_DATA_W                                               32
#define GPRAM_BANK0344_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0344_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0345
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0345_DATA_W                                               32
#define GPRAM_BANK0345_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0345_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0346
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0346_DATA_W                                               32
#define GPRAM_BANK0346_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0346_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0347
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0347_DATA_W                                               32
#define GPRAM_BANK0347_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0347_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0348
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0348_DATA_W                                               32
#define GPRAM_BANK0348_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0348_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0349
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0349_DATA_W                                               32
#define GPRAM_BANK0349_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0349_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0350
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0350_DATA_W                                               32
#define GPRAM_BANK0350_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0350_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0351
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0351_DATA_W                                               32
#define GPRAM_BANK0351_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0351_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0352
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0352_DATA_W                                               32
#define GPRAM_BANK0352_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0352_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0353
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0353_DATA_W                                               32
#define GPRAM_BANK0353_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0353_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0354
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0354_DATA_W                                               32
#define GPRAM_BANK0354_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0354_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0355
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0355_DATA_W                                               32
#define GPRAM_BANK0355_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0355_DATA_S                                                0

