brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0356
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0356_DATA_W                                               32
#define GPRAM_BANK0356_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0356_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0357
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0357_DATA_W                                               32
#define GPRAM_BANK0357_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0357_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0358
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0358_DATA_W                                               32
#define GPRAM_BANK0358_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0358_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0359
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0359_DATA_W                                               32
#define GPRAM_BANK0359_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0359_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0360
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0360_DATA_W                                               32
#define GPRAM_BANK0360_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0360_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0361
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0361_DATA_W                                               32
#define GPRAM_BANK0361_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0361_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0362
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0362_DATA_W                                               32
#define GPRAM_BANK0362_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0362_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0363
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0363_DATA_W                                               32
#define GPRAM_BANK0363_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0363_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0364
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0364_DATA_W                                               32
#define GPRAM_BANK0364_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0364_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0365
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0365_DATA_W                                               32
#define GPRAM_BANK0365_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0365_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0366
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0366_DATA_W                                               32
#define GPRAM_BANK0366_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0366_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0367
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0367_DATA_W                                               32
#define GPRAM_BANK0367_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0367_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0368
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0368_DATA_W                                               32
#define GPRAM_BANK0368_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0368_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0369
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0369_DATA_W                                               32
#define GPRAM_BANK0369_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0369_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0370
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0370_DATA_W                                               32
#define GPRAM_BANK0370_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0370_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0371
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0371_DATA_W                                               32
#define GPRAM_BANK0371_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0371_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0372
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0372_DATA_W                                               32
#define GPRAM_BANK0372_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0372_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0373
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0373_DATA_W                                               32
#define GPRAM_BANK0373_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0373_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0374
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0374_DATA_W                                               32
#define GPRAM_BANK0374_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0374_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0375
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0375_DATA_W                                               32
#define GPRAM_BANK0375_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0375_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0376
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0376_DATA_W                                               32
#define GPRAM_BANK0376_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0376_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0377
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0377_DATA_W                                               32
#define GPRAM_BANK0377_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0377_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0378
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0378_DATA_W                                               32
#define GPRAM_BANK0378_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0378_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0379
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0379_DATA_W                                               32
#define GPRAM_BANK0379_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0379_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0380
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0380_DATA_W                                               32
#define GPRAM_BANK0380_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0380_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0381
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0381_DATA_W                                               32
#define GPRAM_BANK0381_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0381_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0382
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0382_DATA_W                                               32
#define GPRAM_BANK0382_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0382_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0383
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0383_DATA_W                                               32
#define GPRAM_BANK0383_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0383_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0384
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0384_DATA_W                                               32
#define GPRAM_BANK0384_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0384_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0385
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0385_DATA_W                                               32
#define GPRAM_BANK0385_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0385_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0386
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0386_DATA_W                                               32
#define GPRAM_BANK0386_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0386_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0387
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0387_DATA_W                                               32
#define GPRAM_BANK0387_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0387_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0388
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0388_DATA_W                                               32
#define GPRAM_BANK0388_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0388_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0389
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0389_DATA_W                                               32
#define GPRAM_BANK0389_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0389_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0390
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0390_DATA_W                                               32
#define GPRAM_BANK0390_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0390_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0391
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0391_DATA_W                                               32
#define GPRAM_BANK0391_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0391_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0392
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0392_DATA_W                                               32
#define GPRAM_BANK0392_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0392_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0393
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0393_DATA_W                                               32
#define GPRAM_BANK0393_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0393_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0394
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0394_DATA_W                                               32
#define GPRAM_BANK0394_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0394_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0395
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0395_DATA_W                                               32
#define GPRAM_BANK0395_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0395_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0396
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0396_DATA_W                                               32
#define GPRAM_BANK0396_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0396_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0397
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0397_DATA_W                                               32
#define GPRAM_BANK0397_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0397_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0398
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0398_DATA_W                                               32
#define GPRAM_BANK0398_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0398_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0399
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0399_DATA_W                                               32
#define GPRAM_BANK0399_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0399_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0400
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0400_DATA_W                                               32
#define GPRAM_BANK0400_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0400_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0401
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0401_DATA_W                                               32
#define GPRAM_BANK0401_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0401_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0402
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0402_DATA_W                                               32
#define GPRAM_BANK0402_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0402_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0403
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0403_DATA_W                                               32
#define GPRAM_BANK0403_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0403_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0404
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0404_DATA_W                                               32
#define GPRAM_BANK0404_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0404_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0405
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0405_DATA_W                                               32
#define GPRAM_BANK0405_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0405_DATA_S                                                0

