brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0506
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0506_DATA_W                                               32
#define GPRAM_BANK0506_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0506_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0507
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0507_DATA_W                                               32
#define GPRAM_BANK0507_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0507_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0508
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0508_DATA_W                                               32
#define GPRAM_BANK0508_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0508_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0509
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0509_DATA_W                                               32
#define GPRAM_BANK0509_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0509_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0510
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0510_DATA_W                                               32
#define GPRAM_BANK0510_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0510_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0511
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0511_DATA_W                                               32
#define GPRAM_BANK0511_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0511_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0512
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0512_DATA_W                                               32
#define GPRAM_BANK0512_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0512_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0513
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0513_DATA_W                                               32
#define GPRAM_BANK0513_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0513_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0514
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0514_DATA_W                                               32
#define GPRAM_BANK0514_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0514_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0515
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0515_DATA_W                                               32
#define GPRAM_BANK0515_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0515_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0516
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0516_DATA_W                                               32
#define GPRAM_BANK0516_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0516_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0517
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0517_DATA_W                                               32
#define GPRAM_BANK0517_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0517_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0518
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0518_DATA_W                                               32
#define GPRAM_BANK0518_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0518_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0519
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0519_DATA_W                                               32
#define GPRAM_BANK0519_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0519_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0520
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0520_DATA_W                                               32
#define GPRAM_BANK0520_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0520_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0521
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0521_DATA_W                                               32
#define GPRAM_BANK0521_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0521_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0522
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0522_DATA_W                                               32
#define GPRAM_BANK0522_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0522_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0523
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0523_DATA_W                                               32
#define GPRAM_BANK0523_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0523_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0524
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0524_DATA_W                                               32
#define GPRAM_BANK0524_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0524_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0525
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0525_DATA_W                                               32
#define GPRAM_BANK0525_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0525_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0526
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0526_DATA_W                                               32
#define GPRAM_BANK0526_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0526_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0527
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0527_DATA_W                                               32
#define GPRAM_BANK0527_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0527_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0528
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0528_DATA_W                                               32
#define GPRAM_BANK0528_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0528_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0529
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0529_DATA_W                                               32
#define GPRAM_BANK0529_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0529_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0530
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0530_DATA_W                                               32
#define GPRAM_BANK0530_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0530_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0531
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0531_DATA_W                                               32
#define GPRAM_BANK0531_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0531_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0532
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0532_DATA_W                                               32
#define GPRAM_BANK0532_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0532_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0533
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0533_DATA_W                                               32
#define GPRAM_BANK0533_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0533_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0534
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0534_DATA_W                                               32
#define GPRAM_BANK0534_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0534_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0535
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0535_DATA_W                                               32
#define GPRAM_BANK0535_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0535_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0536
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0536_DATA_W                                               32
#define GPRAM_BANK0536_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0536_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0537
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0537_DATA_W                                               32
#define GPRAM_BANK0537_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0537_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0538
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0538_DATA_W                                               32
#define GPRAM_BANK0538_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0538_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0539
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0539_DATA_W                                               32
#define GPRAM_BANK0539_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0539_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0540
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0540_DATA_W                                               32
#define GPRAM_BANK0540_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0540_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0541
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0541_DATA_W                                               32
#define GPRAM_BANK0541_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0541_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0542
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0542_DATA_W                                               32
#define GPRAM_BANK0542_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0542_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0543
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0543_DATA_W                                               32
#define GPRAM_BANK0543_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0543_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0544
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0544_DATA_W                                               32
#define GPRAM_BANK0544_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0544_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0545
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0545_DATA_W                                               32
#define GPRAM_BANK0545_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0545_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0546
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0546_DATA_W                                               32
#define GPRAM_BANK0546_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0546_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0547
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0547_DATA_W                                               32
#define GPRAM_BANK0547_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0547_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0548
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0548_DATA_W                                               32
#define GPRAM_BANK0548_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0548_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0549
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0549_DATA_W                                               32
#define GPRAM_BANK0549_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0549_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0550
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0550_DATA_W                                               32
#define GPRAM_BANK0550_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0550_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0551
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0551_DATA_W                                               32
#define GPRAM_BANK0551_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0551_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0552
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0552_DATA_W                                               32
#define GPRAM_BANK0552_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0552_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0553
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0553_DATA_W                                               32
#define GPRAM_BANK0553_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0553_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0554
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0554_DATA_W                                               32
#define GPRAM_BANK0554_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0554_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0555
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0555_DATA_W                                               32
#define GPRAM_BANK0555_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0555_DATA_S                                                0

