brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0556
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0556_DATA_W                                               32
#define GPRAM_BANK0556_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0556_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0557
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0557_DATA_W                                               32
#define GPRAM_BANK0557_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0557_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0558
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0558_DATA_W                                               32
#define GPRAM_BANK0558_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0558_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0559
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0559_DATA_W                                               32
#define GPRAM_BANK0559_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0559_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0560
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0560_DATA_W                                               32
#define GPRAM_BANK0560_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0560_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0561
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0561_DATA_W                                               32
#define GPRAM_BANK0561_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0561_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0562
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0562_DATA_W                                               32
#define GPRAM_BANK0562_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0562_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0563
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0563_DATA_W                                               32
#define GPRAM_BANK0563_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0563_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0564
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0564_DATA_W                                               32
#define GPRAM_BANK0564_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0564_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0565
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0565_DATA_W                                               32
#define GPRAM_BANK0565_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0565_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0566
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0566_DATA_W                                               32
#define GPRAM_BANK0566_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0566_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0567
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0567_DATA_W                                               32
#define GPRAM_BANK0567_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0567_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0568
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0568_DATA_W                                               32
#define GPRAM_BANK0568_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0568_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0569
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0569_DATA_W                                               32
#define GPRAM_BANK0569_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0569_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0570
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0570_DATA_W                                               32
#define GPRAM_BANK0570_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0570_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0571
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0571_DATA_W                                               32
#define GPRAM_BANK0571_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0571_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0572
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0572_DATA_W                                               32
#define GPRAM_BANK0572_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0572_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0573
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0573_DATA_W                                               32
#define GPRAM_BANK0573_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0573_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0574
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0574_DATA_W                                               32
#define GPRAM_BANK0574_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0574_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0575
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0575_DATA_W                                               32
#define GPRAM_BANK0575_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0575_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0576
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0576_DATA_W                                               32
#define GPRAM_BANK0576_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0576_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0577
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0577_DATA_W                                               32
#define GPRAM_BANK0577_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0577_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0578
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0578_DATA_W                                               32
#define GPRAM_BANK0578_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0578_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0579
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0579_DATA_W                                               32
#define GPRAM_BANK0579_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0579_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0580
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0580_DATA_W                                               32
#define GPRAM_BANK0580_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0580_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0581
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0581_DATA_W                                               32
#define GPRAM_BANK0581_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0581_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0582
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0582_DATA_W                                               32
#define GPRAM_BANK0582_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0582_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0583
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0583_DATA_W                                               32
#define GPRAM_BANK0583_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0583_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0584
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0584_DATA_W                                               32
#define GPRAM_BANK0584_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0584_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0585
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0585_DATA_W                                               32
#define GPRAM_BANK0585_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0585_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0586
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0586_DATA_W                                               32
#define GPRAM_BANK0586_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0586_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0587
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0587_DATA_W                                               32
#define GPRAM_BANK0587_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0587_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0588
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0588_DATA_W                                               32
#define GPRAM_BANK0588_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0588_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0589
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0589_DATA_W                                               32
#define GPRAM_BANK0589_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0589_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0590
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0590_DATA_W                                               32
#define GPRAM_BANK0590_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0590_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0591
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0591_DATA_W                                               32
#define GPRAM_BANK0591_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0591_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0592
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0592_DATA_W                                               32
#define GPRAM_BANK0592_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0592_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0593
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0593_DATA_W                                               32
#define GPRAM_BANK0593_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0593_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0594
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0594_DATA_W                                               32
#define GPRAM_BANK0594_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0594_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0595
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0595_DATA_W                                               32
#define GPRAM_BANK0595_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0595_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0596
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0596_DATA_W                                               32
#define GPRAM_BANK0596_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0596_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0597
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0597_DATA_W                                               32
#define GPRAM_BANK0597_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0597_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0598
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0598_DATA_W                                               32
#define GPRAM_BANK0598_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0598_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0599
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0599_DATA_W                                               32
#define GPRAM_BANK0599_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0599_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0600
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0600_DATA_W                                               32
#define GPRAM_BANK0600_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0600_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0601
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0601_DATA_W                                               32
#define GPRAM_BANK0601_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0601_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0602
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0602_DATA_W                                               32
#define GPRAM_BANK0602_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0602_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0603
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0603_DATA_W                                               32
#define GPRAM_BANK0603_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0603_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0604
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0604_DATA_W                                               32
#define GPRAM_BANK0604_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0604_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0605
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0605_DATA_W                                               32
#define GPRAM_BANK0605_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0605_DATA_S                                                0

