brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0606
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0606_DATA_W                                               32
#define GPRAM_BANK0606_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0606_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0607
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0607_DATA_W                                               32
#define GPRAM_BANK0607_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0607_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0608
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0608_DATA_W                                               32
#define GPRAM_BANK0608_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0608_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0609
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0609_DATA_W                                               32
#define GPRAM_BANK0609_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0609_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0610
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0610_DATA_W                                               32
#define GPRAM_BANK0610_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0610_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0611
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0611_DATA_W                                               32
#define GPRAM_BANK0611_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0611_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0612
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0612_DATA_W                                               32
#define GPRAM_BANK0612_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0612_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0613
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0613_DATA_W                                               32
#define GPRAM_BANK0613_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0613_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0614
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0614_DATA_W                                               32
#define GPRAM_BANK0614_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0614_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0615
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0615_DATA_W                                               32
#define GPRAM_BANK0615_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0615_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0616
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0616_DATA_W                                               32
#define GPRAM_BANK0616_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0616_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0617
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0617_DATA_W                                               32
#define GPRAM_BANK0617_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0617_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0618
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0618_DATA_W                                               32
#define GPRAM_BANK0618_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0618_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0619
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0619_DATA_W                                               32
#define GPRAM_BANK0619_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0619_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0620
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0620_DATA_W                                               32
#define GPRAM_BANK0620_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0620_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0621
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0621_DATA_W                                               32
#define GPRAM_BANK0621_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0621_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0622
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0622_DATA_W                                               32
#define GPRAM_BANK0622_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0622_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0623
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0623_DATA_W                                               32
#define GPRAM_BANK0623_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0623_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0624
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0624_DATA_W                                               32
#define GPRAM_BANK0624_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0624_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0625
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0625_DATA_W                                               32
#define GPRAM_BANK0625_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0625_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0626
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0626_DATA_W                                               32
#define GPRAM_BANK0626_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0626_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0627
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0627_DATA_W                                               32
#define GPRAM_BANK0627_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0627_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0628
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0628_DATA_W                                               32
#define GPRAM_BANK0628_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0628_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0629
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0629_DATA_W                                               32
#define GPRAM_BANK0629_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0629_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0630
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0630_DATA_W                                               32
#define GPRAM_BANK0630_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0630_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0631
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0631_DATA_W                                               32
#define GPRAM_BANK0631_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0631_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0632
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0632_DATA_W                                               32
#define GPRAM_BANK0632_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0632_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0633
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0633_DATA_W                                               32
#define GPRAM_BANK0633_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0633_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0634
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0634_DATA_W                                               32
#define GPRAM_BANK0634_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0634_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0635
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0635_DATA_W                                               32
#define GPRAM_BANK0635_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0635_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0636
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0636_DATA_W                                               32
#define GPRAM_BANK0636_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0636_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0637
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0637_DATA_W                                               32
#define GPRAM_BANK0637_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0637_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0638
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0638_DATA_W                                               32
#define GPRAM_BANK0638_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0638_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0639
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0639_DATA_W                                               32
#define GPRAM_BANK0639_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0639_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0640
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0640_DATA_W                                               32
#define GPRAM_BANK0640_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0640_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0641
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0641_DATA_W                                               32
#define GPRAM_BANK0641_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0641_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0642
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0642_DATA_W                                               32
#define GPRAM_BANK0642_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0642_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0643
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0643_DATA_W                                               32
#define GPRAM_BANK0643_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0643_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0644
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0644_DATA_W                                               32
#define GPRAM_BANK0644_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0644_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0645
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0645_DATA_W                                               32
#define GPRAM_BANK0645_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0645_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0646
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0646_DATA_W                                               32
#define GPRAM_BANK0646_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0646_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0647
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0647_DATA_W                                               32
#define GPRAM_BANK0647_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0647_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0648
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0648_DATA_W                                               32
#define GPRAM_BANK0648_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0648_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0649
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0649_DATA_W                                               32
#define GPRAM_BANK0649_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0649_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0650
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0650_DATA_W                                               32
#define GPRAM_BANK0650_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0650_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0651
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0651_DATA_W                                               32
#define GPRAM_BANK0651_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0651_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0652
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0652_DATA_W                                               32
#define GPRAM_BANK0652_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0652_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0653
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0653_DATA_W                                               32
#define GPRAM_BANK0653_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0653_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0654
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0654_DATA_W                                               32
#define GPRAM_BANK0654_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0654_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0655
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0655_DATA_W                                               32
#define GPRAM_BANK0655_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0655_DATA_S                                                0

