brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0656
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0656_DATA_W                                               32
#define GPRAM_BANK0656_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0656_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0657
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0657_DATA_W                                               32
#define GPRAM_BANK0657_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0657_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0658
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0658_DATA_W                                               32
#define GPRAM_BANK0658_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0658_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0659
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0659_DATA_W                                               32
#define GPRAM_BANK0659_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0659_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0660
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0660_DATA_W                                               32
#define GPRAM_BANK0660_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0660_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0661
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0661_DATA_W                                               32
#define GPRAM_BANK0661_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0661_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0662
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0662_DATA_W                                               32
#define GPRAM_BANK0662_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0662_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0663
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0663_DATA_W                                               32
#define GPRAM_BANK0663_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0663_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0664
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0664_DATA_W                                               32
#define GPRAM_BANK0664_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0664_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0665
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0665_DATA_W                                               32
#define GPRAM_BANK0665_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0665_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0666
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0666_DATA_W                                               32
#define GPRAM_BANK0666_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0666_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0667
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0667_DATA_W                                               32
#define GPRAM_BANK0667_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0667_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0668
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0668_DATA_W                                               32
#define GPRAM_BANK0668_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0668_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0669
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0669_DATA_W                                               32
#define GPRAM_BANK0669_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0669_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0670
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0670_DATA_W                                               32
#define GPRAM_BANK0670_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0670_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0671
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0671_DATA_W                                               32
#define GPRAM_BANK0671_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0671_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0672
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0672_DATA_W                                               32
#define GPRAM_BANK0672_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0672_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0673
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0673_DATA_W                                               32
#define GPRAM_BANK0673_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0673_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0674
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0674_DATA_W                                               32
#define GPRAM_BANK0674_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0674_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0675
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0675_DATA_W                                               32
#define GPRAM_BANK0675_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0675_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0676
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0676_DATA_W                                               32
#define GPRAM_BANK0676_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0676_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0677
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0677_DATA_W                                               32
#define GPRAM_BANK0677_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0677_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0678
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0678_DATA_W                                               32
#define GPRAM_BANK0678_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0678_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0679
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0679_DATA_W                                               32
#define GPRAM_BANK0679_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0679_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0680
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0680_DATA_W                                               32
#define GPRAM_BANK0680_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0680_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0681
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0681_DATA_W                                               32
#define GPRAM_BANK0681_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0681_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0682
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0682_DATA_W                                               32
#define GPRAM_BANK0682_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0682_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0683
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0683_DATA_W                                               32
#define GPRAM_BANK0683_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0683_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0684
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0684_DATA_W                                               32
#define GPRAM_BANK0684_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0684_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0685
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0685_DATA_W                                               32
#define GPRAM_BANK0685_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0685_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0686
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0686_DATA_W                                               32
#define GPRAM_BANK0686_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0686_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0687
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0687_DATA_W                                               32
#define GPRAM_BANK0687_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0687_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0688
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0688_DATA_W                                               32
#define GPRAM_BANK0688_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0688_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0689
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0689_DATA_W                                               32
#define GPRAM_BANK0689_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0689_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0690
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0690_DATA_W                                               32
#define GPRAM_BANK0690_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0690_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0691
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0691_DATA_W                                               32
#define GPRAM_BANK0691_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0691_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0692
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0692_DATA_W                                               32
#define GPRAM_BANK0692_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0692_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0693
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0693_DATA_W                                               32
#define GPRAM_BANK0693_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0693_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0694
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0694_DATA_W                                               32
#define GPRAM_BANK0694_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0694_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0695
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0695_DATA_W                                               32
#define GPRAM_BANK0695_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0695_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0696
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0696_DATA_W                                               32
#define GPRAM_BANK0696_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0696_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0697
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0697_DATA_W                                               32
#define GPRAM_BANK0697_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0697_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0698
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0698_DATA_W                                               32
#define GPRAM_BANK0698_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0698_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0699
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0699_DATA_W                                               32
#define GPRAM_BANK0699_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0699_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0700
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0700_DATA_W                                               32
#define GPRAM_BANK0700_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0700_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0701
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0701_DATA_W                                               32
#define GPRAM_BANK0701_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0701_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0702
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0702_DATA_W                                               32
#define GPRAM_BANK0702_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0702_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0703
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0703_DATA_W                                               32
#define GPRAM_BANK0703_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0703_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0704
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0704_DATA_W                                               32
#define GPRAM_BANK0704_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0704_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0705
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0705_DATA_W                                               32
#define GPRAM_BANK0705_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0705_DATA_S                                                0

