brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0706
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0706_DATA_W                                               32
#define GPRAM_BANK0706_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0706_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0707
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0707_DATA_W                                               32
#define GPRAM_BANK0707_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0707_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0708
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0708_DATA_W                                               32
#define GPRAM_BANK0708_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0708_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0709
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0709_DATA_W                                               32
#define GPRAM_BANK0709_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0709_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0710
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0710_DATA_W                                               32
#define GPRAM_BANK0710_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0710_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0711
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0711_DATA_W                                               32
#define GPRAM_BANK0711_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0711_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0712
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0712_DATA_W                                               32
#define GPRAM_BANK0712_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0712_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0713
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0713_DATA_W                                               32
#define GPRAM_BANK0713_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0713_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0714
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0714_DATA_W                                               32
#define GPRAM_BANK0714_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0714_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0715
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0715_DATA_W                                               32
#define GPRAM_BANK0715_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0715_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0716
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0716_DATA_W                                               32
#define GPRAM_BANK0716_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0716_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0717
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0717_DATA_W                                               32
#define GPRAM_BANK0717_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0717_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0718
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0718_DATA_W                                               32
#define GPRAM_BANK0718_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0718_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0719
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0719_DATA_W                                               32
#define GPRAM_BANK0719_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0719_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0720
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0720_DATA_W                                               32
#define GPRAM_BANK0720_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0720_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0721
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0721_DATA_W                                               32
#define GPRAM_BANK0721_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0721_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0722
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0722_DATA_W                                               32
#define GPRAM_BANK0722_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0722_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0723
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0723_DATA_W                                               32
#define GPRAM_BANK0723_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0723_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0724
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0724_DATA_W                                               32
#define GPRAM_BANK0724_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0724_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0725
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0725_DATA_W                                               32
#define GPRAM_BANK0725_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0725_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0726
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0726_DATA_W                                               32
#define GPRAM_BANK0726_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0726_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0727
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0727_DATA_W                                               32
#define GPRAM_BANK0727_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0727_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0728
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0728_DATA_W                                               32
#define GPRAM_BANK0728_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0728_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0729
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0729_DATA_W                                               32
#define GPRAM_BANK0729_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0729_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0730
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0730_DATA_W                                               32
#define GPRAM_BANK0730_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0730_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0731
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0731_DATA_W                                               32
#define GPRAM_BANK0731_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0731_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0732
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0732_DATA_W                                               32
#define GPRAM_BANK0732_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0732_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0733
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0733_DATA_W                                               32
#define GPRAM_BANK0733_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0733_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0734
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0734_DATA_W                                               32
#define GPRAM_BANK0734_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0734_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0735
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0735_DATA_W                                               32
#define GPRAM_BANK0735_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0735_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0736
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0736_DATA_W                                               32
#define GPRAM_BANK0736_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0736_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0737
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0737_DATA_W                                               32
#define GPRAM_BANK0737_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0737_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0738
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0738_DATA_W                                               32
#define GPRAM_BANK0738_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0738_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0739
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0739_DATA_W                                               32
#define GPRAM_BANK0739_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0739_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0740
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0740_DATA_W                                               32
#define GPRAM_BANK0740_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0740_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0741
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0741_DATA_W                                               32
#define GPRAM_BANK0741_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0741_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0742
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0742_DATA_W                                               32
#define GPRAM_BANK0742_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0742_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0743
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0743_DATA_W                                               32
#define GPRAM_BANK0743_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0743_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0744
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0744_DATA_W                                               32
#define GPRAM_BANK0744_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0744_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0745
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0745_DATA_W                                               32
#define GPRAM_BANK0745_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0745_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0746
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0746_DATA_W                                               32
#define GPRAM_BANK0746_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0746_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0747
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0747_DATA_W                                               32
#define GPRAM_BANK0747_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0747_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0748
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0748_DATA_W                                               32
#define GPRAM_BANK0748_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0748_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0749
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0749_DATA_W                                               32
#define GPRAM_BANK0749_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0749_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0750
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0750_DATA_W                                               32
#define GPRAM_BANK0750_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0750_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0751
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0751_DATA_W                                               32
#define GPRAM_BANK0751_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0751_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0752
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0752_DATA_W                                               32
#define GPRAM_BANK0752_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0752_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0753
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0753_DATA_W                                               32
#define GPRAM_BANK0753_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0753_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0754
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0754_DATA_W                                               32
#define GPRAM_BANK0754_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0754_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0755
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0755_DATA_W                                               32
#define GPRAM_BANK0755_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0755_DATA_S                                                0

