brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0756
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0756_DATA_W                                               32
#define GPRAM_BANK0756_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0756_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0757
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0757_DATA_W                                               32
#define GPRAM_BANK0757_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0757_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0758
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0758_DATA_W                                               32
#define GPRAM_BANK0758_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0758_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0759
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0759_DATA_W                                               32
#define GPRAM_BANK0759_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0759_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0760
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0760_DATA_W                                               32
#define GPRAM_BANK0760_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0760_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0761
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0761_DATA_W                                               32
#define GPRAM_BANK0761_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0761_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0762
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0762_DATA_W                                               32
#define GPRAM_BANK0762_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0762_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0763
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0763_DATA_W                                               32
#define GPRAM_BANK0763_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0763_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0764
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0764_DATA_W                                               32
#define GPRAM_BANK0764_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0764_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0765
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0765_DATA_W                                               32
#define GPRAM_BANK0765_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0765_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0766
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0766_DATA_W                                               32
#define GPRAM_BANK0766_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0766_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0767
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0767_DATA_W                                               32
#define GPRAM_BANK0767_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0767_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0768
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0768_DATA_W                                               32
#define GPRAM_BANK0768_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0768_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0769
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0769_DATA_W                                               32
#define GPRAM_BANK0769_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0769_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0770
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0770_DATA_W                                               32
#define GPRAM_BANK0770_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0770_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0771
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0771_DATA_W                                               32
#define GPRAM_BANK0771_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0771_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0772
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0772_DATA_W                                               32
#define GPRAM_BANK0772_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0772_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0773
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0773_DATA_W                                               32
#define GPRAM_BANK0773_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0773_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0774
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0774_DATA_W                                               32
#define GPRAM_BANK0774_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0774_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0775
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0775_DATA_W                                               32
#define GPRAM_BANK0775_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0775_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0776
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0776_DATA_W                                               32
#define GPRAM_BANK0776_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0776_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0777
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0777_DATA_W                                               32
#define GPRAM_BANK0777_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0777_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0778
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0778_DATA_W                                               32
#define GPRAM_BANK0778_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0778_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0779
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0779_DATA_W                                               32
#define GPRAM_BANK0779_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0779_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0780
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0780_DATA_W                                               32
#define GPRAM_BANK0780_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0780_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0781
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0781_DATA_W                                               32
#define GPRAM_BANK0781_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0781_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0782
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0782_DATA_W                                               32
#define GPRAM_BANK0782_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0782_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0783
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0783_DATA_W                                               32
#define GPRAM_BANK0783_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0783_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0784
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0784_DATA_W                                               32
#define GPRAM_BANK0784_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0784_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0785
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0785_DATA_W                                               32
#define GPRAM_BANK0785_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0785_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0786
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0786_DATA_W                                               32
#define GPRAM_BANK0786_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0786_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0787
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0787_DATA_W                                               32
#define GPRAM_BANK0787_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0787_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0788
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0788_DATA_W                                               32
#define GPRAM_BANK0788_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0788_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0789
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0789_DATA_W                                               32
#define GPRAM_BANK0789_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0789_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0790
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0790_DATA_W                                               32
#define GPRAM_BANK0790_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0790_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0791
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0791_DATA_W                                               32
#define GPRAM_BANK0791_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0791_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0792
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0792_DATA_W                                               32
#define GPRAM_BANK0792_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0792_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0793
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0793_DATA_W                                               32
#define GPRAM_BANK0793_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0793_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0794
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0794_DATA_W                                               32
#define GPRAM_BANK0794_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0794_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0795
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0795_DATA_W                                               32
#define GPRAM_BANK0795_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0795_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0796
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0796_DATA_W                                               32
#define GPRAM_BANK0796_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0796_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0797
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0797_DATA_W                                               32
#define GPRAM_BANK0797_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0797_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0798
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0798_DATA_W                                               32
#define GPRAM_BANK0798_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0798_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0799
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0799_DATA_W                                               32
#define GPRAM_BANK0799_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0799_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0800
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0800_DATA_W                                               32
#define GPRAM_BANK0800_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0800_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0801
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0801_DATA_W                                               32
#define GPRAM_BANK0801_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0801_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0802
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0802_DATA_W                                               32
#define GPRAM_BANK0802_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0802_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0803
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0803_DATA_W                                               32
#define GPRAM_BANK0803_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0803_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0804
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0804_DATA_W                                               32
#define GPRAM_BANK0804_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0804_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0805
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0805_DATA_W                                               32
#define GPRAM_BANK0805_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0805_DATA_S                                                0

