brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0806
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0806_DATA_W                                               32
#define GPRAM_BANK0806_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0806_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0807
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0807_DATA_W                                               32
#define GPRAM_BANK0807_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0807_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0808
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0808_DATA_W                                               32
#define GPRAM_BANK0808_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0808_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0809
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0809_DATA_W                                               32
#define GPRAM_BANK0809_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0809_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0810
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0810_DATA_W                                               32
#define GPRAM_BANK0810_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0810_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0811
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0811_DATA_W                                               32
#define GPRAM_BANK0811_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0811_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0812
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0812_DATA_W                                               32
#define GPRAM_BANK0812_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0812_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0813
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0813_DATA_W                                               32
#define GPRAM_BANK0813_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0813_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0814
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0814_DATA_W                                               32
#define GPRAM_BANK0814_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0814_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0815
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0815_DATA_W                                               32
#define GPRAM_BANK0815_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0815_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0816
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0816_DATA_W                                               32
#define GPRAM_BANK0816_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0816_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0817
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0817_DATA_W                                               32
#define GPRAM_BANK0817_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0817_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0818
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0818_DATA_W                                               32
#define GPRAM_BANK0818_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0818_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0819
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0819_DATA_W                                               32
#define GPRAM_BANK0819_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0819_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0820
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0820_DATA_W                                               32
#define GPRAM_BANK0820_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0820_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0821
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0821_DATA_W                                               32
#define GPRAM_BANK0821_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0821_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0822
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0822_DATA_W                                               32
#define GPRAM_BANK0822_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0822_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0823
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0823_DATA_W                                               32
#define GPRAM_BANK0823_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0823_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0824
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0824_DATA_W                                               32
#define GPRAM_BANK0824_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0824_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0825
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0825_DATA_W                                               32
#define GPRAM_BANK0825_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0825_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0826
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0826_DATA_W                                               32
#define GPRAM_BANK0826_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0826_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0827
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0827_DATA_W                                               32
#define GPRAM_BANK0827_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0827_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0828
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0828_DATA_W                                               32
#define GPRAM_BANK0828_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0828_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0829
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0829_DATA_W                                               32
#define GPRAM_BANK0829_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0829_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0830
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0830_DATA_W                                               32
#define GPRAM_BANK0830_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0830_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0831
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0831_DATA_W                                               32
#define GPRAM_BANK0831_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0831_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0832
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0832_DATA_W                                               32
#define GPRAM_BANK0832_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0832_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0833
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0833_DATA_W                                               32
#define GPRAM_BANK0833_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0833_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0834
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0834_DATA_W                                               32
#define GPRAM_BANK0834_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0834_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0835
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0835_DATA_W                                               32
#define GPRAM_BANK0835_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0835_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0836
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0836_DATA_W                                               32
#define GPRAM_BANK0836_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0836_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0837
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0837_DATA_W                                               32
#define GPRAM_BANK0837_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0837_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0838
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0838_DATA_W                                               32
#define GPRAM_BANK0838_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0838_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0839
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0839_DATA_W                                               32
#define GPRAM_BANK0839_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0839_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0840
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0840_DATA_W                                               32
#define GPRAM_BANK0840_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0840_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0841
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0841_DATA_W                                               32
#define GPRAM_BANK0841_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0841_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0842
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0842_DATA_W                                               32
#define GPRAM_BANK0842_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0842_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0843
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0843_DATA_W                                               32
#define GPRAM_BANK0843_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0843_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0844
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0844_DATA_W                                               32
#define GPRAM_BANK0844_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0844_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0845
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0845_DATA_W                                               32
#define GPRAM_BANK0845_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0845_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0846
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0846_DATA_W                                               32
#define GPRAM_BANK0846_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0846_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0847
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0847_DATA_W                                               32
#define GPRAM_BANK0847_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0847_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0848
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0848_DATA_W                                               32
#define GPRAM_BANK0848_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0848_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0849
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0849_DATA_W                                               32
#define GPRAM_BANK0849_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0849_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0850
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0850_DATA_W                                               32
#define GPRAM_BANK0850_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0850_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0851
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0851_DATA_W                                               32
#define GPRAM_BANK0851_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0851_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0852
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0852_DATA_W                                               32
#define GPRAM_BANK0852_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0852_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0853
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0853_DATA_W                                               32
#define GPRAM_BANK0853_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0853_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0854
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0854_DATA_W                                               32
#define GPRAM_BANK0854_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0854_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0855
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0855_DATA_W                                               32
#define GPRAM_BANK0855_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0855_DATA_S                                                0

