brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0856
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0856_DATA_W                                               32
#define GPRAM_BANK0856_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0856_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0857
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0857_DATA_W                                               32
#define GPRAM_BANK0857_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0857_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0858
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0858_DATA_W                                               32
#define GPRAM_BANK0858_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0858_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0859
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0859_DATA_W                                               32
#define GPRAM_BANK0859_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0859_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0860
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0860_DATA_W                                               32
#define GPRAM_BANK0860_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0860_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0861
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0861_DATA_W                                               32
#define GPRAM_BANK0861_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0861_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0862
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0862_DATA_W                                               32
#define GPRAM_BANK0862_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0862_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0863
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0863_DATA_W                                               32
#define GPRAM_BANK0863_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0863_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0864
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0864_DATA_W                                               32
#define GPRAM_BANK0864_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0864_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0865
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0865_DATA_W                                               32
#define GPRAM_BANK0865_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0865_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0866
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0866_DATA_W                                               32
#define GPRAM_BANK0866_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0866_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0867
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0867_DATA_W                                               32
#define GPRAM_BANK0867_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0867_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0868
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0868_DATA_W                                               32
#define GPRAM_BANK0868_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0868_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0869
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0869_DATA_W                                               32
#define GPRAM_BANK0869_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0869_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0870
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0870_DATA_W                                               32
#define GPRAM_BANK0870_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0870_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0871
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0871_DATA_W                                               32
#define GPRAM_BANK0871_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0871_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0872
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0872_DATA_W                                               32
#define GPRAM_BANK0872_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0872_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0873
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0873_DATA_W                                               32
#define GPRAM_BANK0873_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0873_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0874
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0874_DATA_W                                               32
#define GPRAM_BANK0874_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0874_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0875
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0875_DATA_W                                               32
#define GPRAM_BANK0875_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0875_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0876
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0876_DATA_W                                               32
#define GPRAM_BANK0876_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0876_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0877
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0877_DATA_W                                               32
#define GPRAM_BANK0877_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0877_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0878
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0878_DATA_W                                               32
#define GPRAM_BANK0878_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0878_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0879
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0879_DATA_W                                               32
#define GPRAM_BANK0879_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0879_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0880
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0880_DATA_W                                               32
#define GPRAM_BANK0880_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0880_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0881
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0881_DATA_W                                               32
#define GPRAM_BANK0881_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0881_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0882
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0882_DATA_W                                               32
#define GPRAM_BANK0882_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0882_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0883
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0883_DATA_W                                               32
#define GPRAM_BANK0883_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0883_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0884
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0884_DATA_W                                               32
#define GPRAM_BANK0884_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0884_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0885
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0885_DATA_W                                               32
#define GPRAM_BANK0885_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0885_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0886
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0886_DATA_W                                               32
#define GPRAM_BANK0886_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0886_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0887
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0887_DATA_W                                               32
#define GPRAM_BANK0887_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0887_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0888
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0888_DATA_W                                               32
#define GPRAM_BANK0888_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0888_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0889
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0889_DATA_W                                               32
#define GPRAM_BANK0889_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0889_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0890
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0890_DATA_W                                               32
#define GPRAM_BANK0890_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0890_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0891
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0891_DATA_W                                               32
#define GPRAM_BANK0891_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0891_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0892
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0892_DATA_W                                               32
#define GPRAM_BANK0892_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0892_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0893
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0893_DATA_W                                               32
#define GPRAM_BANK0893_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0893_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0894
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0894_DATA_W                                               32
#define GPRAM_BANK0894_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0894_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0895
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0895_DATA_W                                               32
#define GPRAM_BANK0895_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0895_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0896
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0896_DATA_W                                               32
#define GPRAM_BANK0896_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0896_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0897
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0897_DATA_W                                               32
#define GPRAM_BANK0897_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0897_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0898
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0898_DATA_W                                               32
#define GPRAM_BANK0898_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0898_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0899
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0899_DATA_W                                               32
#define GPRAM_BANK0899_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0899_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0900
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0900_DATA_W                                               32
#define GPRAM_BANK0900_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0900_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0901
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0901_DATA_W                                               32
#define GPRAM_BANK0901_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0901_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0902
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0902_DATA_W                                               32
#define GPRAM_BANK0902_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0902_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0903
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0903_DATA_W                                               32
#define GPRAM_BANK0903_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0903_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0904
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0904_DATA_W                                               32
#define GPRAM_BANK0904_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0904_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0905
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0905_DATA_W                                               32
#define GPRAM_BANK0905_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0905_DATA_S                                                0

