brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0906
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0906_DATA_W                                               32
#define GPRAM_BANK0906_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0906_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0907
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0907_DATA_W                                               32
#define GPRAM_BANK0907_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0907_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0908
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0908_DATA_W                                               32
#define GPRAM_BANK0908_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0908_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0909
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0909_DATA_W                                               32
#define GPRAM_BANK0909_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0909_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0910
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0910_DATA_W                                               32
#define GPRAM_BANK0910_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0910_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0911
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0911_DATA_W                                               32
#define GPRAM_BANK0911_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0911_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0912
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0912_DATA_W                                               32
#define GPRAM_BANK0912_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0912_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0913
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0913_DATA_W                                               32
#define GPRAM_BANK0913_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0913_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0914
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0914_DATA_W                                               32
#define GPRAM_BANK0914_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0914_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0915
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0915_DATA_W                                               32
#define GPRAM_BANK0915_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0915_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0916
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0916_DATA_W                                               32
#define GPRAM_BANK0916_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0916_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0917
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0917_DATA_W                                               32
#define GPRAM_BANK0917_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0917_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0918
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0918_DATA_W                                               32
#define GPRAM_BANK0918_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0918_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0919
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0919_DATA_W                                               32
#define GPRAM_BANK0919_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0919_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0920
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0920_DATA_W                                               32
#define GPRAM_BANK0920_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0920_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0921
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0921_DATA_W                                               32
#define GPRAM_BANK0921_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0921_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0922
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0922_DATA_W                                               32
#define GPRAM_BANK0922_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0922_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0923
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0923_DATA_W                                               32
#define GPRAM_BANK0923_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0923_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0924
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0924_DATA_W                                               32
#define GPRAM_BANK0924_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0924_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0925
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0925_DATA_W                                               32
#define GPRAM_BANK0925_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0925_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0926
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0926_DATA_W                                               32
#define GPRAM_BANK0926_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0926_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0927
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0927_DATA_W                                               32
#define GPRAM_BANK0927_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0927_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0928
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0928_DATA_W                                               32
#define GPRAM_BANK0928_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0928_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0929
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0929_DATA_W                                               32
#define GPRAM_BANK0929_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0929_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0930
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0930_DATA_W                                               32
#define GPRAM_BANK0930_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0930_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0931
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0931_DATA_W                                               32
#define GPRAM_BANK0931_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0931_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0932
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0932_DATA_W                                               32
#define GPRAM_BANK0932_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0932_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0933
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0933_DATA_W                                               32
#define GPRAM_BANK0933_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0933_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0934
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0934_DATA_W                                               32
#define GPRAM_BANK0934_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0934_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0935
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0935_DATA_W                                               32
#define GPRAM_BANK0935_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0935_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0936
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0936_DATA_W                                               32
#define GPRAM_BANK0936_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0936_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0937
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0937_DATA_W                                               32
#define GPRAM_BANK0937_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0937_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0938
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0938_DATA_W                                               32
#define GPRAM_BANK0938_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0938_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0939
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0939_DATA_W                                               32
#define GPRAM_BANK0939_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0939_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0940
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0940_DATA_W                                               32
#define GPRAM_BANK0940_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0940_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0941
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0941_DATA_W                                               32
#define GPRAM_BANK0941_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0941_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0942
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0942_DATA_W                                               32
#define GPRAM_BANK0942_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0942_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0943
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0943_DATA_W                                               32
#define GPRAM_BANK0943_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0943_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0944
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0944_DATA_W                                               32
#define GPRAM_BANK0944_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0944_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0945
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0945_DATA_W                                               32
#define GPRAM_BANK0945_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0945_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0946
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0946_DATA_W                                               32
#define GPRAM_BANK0946_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0946_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0947
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0947_DATA_W                                               32
#define GPRAM_BANK0947_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0947_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0948
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0948_DATA_W                                               32
#define GPRAM_BANK0948_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0948_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0949
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0949_DATA_W                                               32
#define GPRAM_BANK0949_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0949_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0950
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0950_DATA_W                                               32
#define GPRAM_BANK0950_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0950_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0951
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0951_DATA_W                                               32
#define GPRAM_BANK0951_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0951_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0952
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0952_DATA_W                                               32
#define GPRAM_BANK0952_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0952_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0953
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0953_DATA_W                                               32
#define GPRAM_BANK0953_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0953_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0954
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0954_DATA_W                                               32
#define GPRAM_BANK0954_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0954_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0955
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0955_DATA_W                                               32
#define GPRAM_BANK0955_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0955_DATA_S                                                0

