brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK0956
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0956_DATA_W                                               32
#define GPRAM_BANK0956_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0956_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0957
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0957_DATA_W                                               32
#define GPRAM_BANK0957_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0957_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0958
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0958_DATA_W                                               32
#define GPRAM_BANK0958_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0958_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0959
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0959_DATA_W                                               32
#define GPRAM_BANK0959_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0959_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0960
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0960_DATA_W                                               32
#define GPRAM_BANK0960_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0960_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0961
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0961_DATA_W                                               32
#define GPRAM_BANK0961_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0961_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0962
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0962_DATA_W                                               32
#define GPRAM_BANK0962_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0962_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0963
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0963_DATA_W                                               32
#define GPRAM_BANK0963_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0963_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0964
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0964_DATA_W                                               32
#define GPRAM_BANK0964_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0964_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0965
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0965_DATA_W                                               32
#define GPRAM_BANK0965_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0965_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0966
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0966_DATA_W                                               32
#define GPRAM_BANK0966_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0966_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0967
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0967_DATA_W                                               32
#define GPRAM_BANK0967_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0967_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0968
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0968_DATA_W                                               32
#define GPRAM_BANK0968_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0968_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0969
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0969_DATA_W                                               32
#define GPRAM_BANK0969_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0969_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0970
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0970_DATA_W                                               32
#define GPRAM_BANK0970_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0970_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0971
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0971_DATA_W                                               32
#define GPRAM_BANK0971_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0971_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0972
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0972_DATA_W                                               32
#define GPRAM_BANK0972_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0972_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0973
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0973_DATA_W                                               32
#define GPRAM_BANK0973_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0973_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0974
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0974_DATA_W                                               32
#define GPRAM_BANK0974_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0974_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0975
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0975_DATA_W                                               32
#define GPRAM_BANK0975_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0975_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0976
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0976_DATA_W                                               32
#define GPRAM_BANK0976_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0976_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0977
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0977_DATA_W                                               32
#define GPRAM_BANK0977_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0977_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0978
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0978_DATA_W                                               32
#define GPRAM_BANK0978_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0978_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0979
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0979_DATA_W                                               32
#define GPRAM_BANK0979_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0979_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0980
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0980_DATA_W                                               32
#define GPRAM_BANK0980_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0980_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0981
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0981_DATA_W                                               32
#define GPRAM_BANK0981_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0981_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0982
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0982_DATA_W                                               32
#define GPRAM_BANK0982_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0982_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0983
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0983_DATA_W                                               32
#define GPRAM_BANK0983_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0983_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0984
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0984_DATA_W                                               32
#define GPRAM_BANK0984_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0984_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0985
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0985_DATA_W                                               32
#define GPRAM_BANK0985_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0985_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0986
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0986_DATA_W                                               32
#define GPRAM_BANK0986_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0986_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0987
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0987_DATA_W                                               32
#define GPRAM_BANK0987_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0987_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0988
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0988_DATA_W                                               32
#define GPRAM_BANK0988_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0988_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0989
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0989_DATA_W                                               32
#define GPRAM_BANK0989_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0989_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0990
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0990_DATA_W                                               32
#define GPRAM_BANK0990_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0990_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0991
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0991_DATA_W                                               32
#define GPRAM_BANK0991_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0991_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0992
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0992_DATA_W                                               32
#define GPRAM_BANK0992_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0992_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0993
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0993_DATA_W                                               32
#define GPRAM_BANK0993_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0993_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0994
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0994_DATA_W                                               32
#define GPRAM_BANK0994_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0994_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0995
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0995_DATA_W                                               32
#define GPRAM_BANK0995_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0995_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0996
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0996_DATA_W                                               32
#define GPRAM_BANK0996_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0996_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0997
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0997_DATA_W                                               32
#define GPRAM_BANK0997_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0997_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0998
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0998_DATA_W                                               32
#define GPRAM_BANK0998_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0998_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK0999
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK0999_DATA_W                                               32
#define GPRAM_BANK0999_DATA_M                                       0xFFFFFFFF
#define GPRAM_BANK0999_DATA_S                                                0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01000
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01000_DATA_W                                              32
#define GPRAM_BANK01000_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01000_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01001
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01001_DATA_W                                              32
#define GPRAM_BANK01001_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01001_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01002
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01002_DATA_W                                              32
#define GPRAM_BANK01002_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01002_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01003
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01003_DATA_W                                              32
#define GPRAM_BANK01003_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01003_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01004
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01004_DATA_W                                              32
#define GPRAM_BANK01004_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01004_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01005
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01005_DATA_W                                              32
#define GPRAM_BANK01005_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01005_DATA_S                                               0

