brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01006
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01006_DATA_W                                              32
#define GPRAM_BANK01006_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01006_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01007
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01007_DATA_W                                              32
#define GPRAM_BANK01007_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01007_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01008
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01008_DATA_W                                              32
#define GPRAM_BANK01008_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01008_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01009
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01009_DATA_W                                              32
#define GPRAM_BANK01009_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01009_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01010
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01010_DATA_W                                              32
#define GPRAM_BANK01010_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01010_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01011
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01011_DATA_W                                              32
#define GPRAM_BANK01011_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01011_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01012
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01012_DATA_W                                              32
#define GPRAM_BANK01012_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01012_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01013
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01013_DATA_W                                              32
#define GPRAM_BANK01013_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01013_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01014
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01014_DATA_W                                              32
#define GPRAM_BANK01014_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01014_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01015
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01015_DATA_W                                              32
#define GPRAM_BANK01015_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01015_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01016
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01016_DATA_W                                              32
#define GPRAM_BANK01016_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01016_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01017
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01017_DATA_W                                              32
#define GPRAM_BANK01017_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01017_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01018
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01018_DATA_W                                              32
#define GPRAM_BANK01018_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01018_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01019
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01019_DATA_W                                              32
#define GPRAM_BANK01019_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01019_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01020
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01020_DATA_W                                              32
#define GPRAM_BANK01020_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01020_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01021
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01021_DATA_W                                              32
#define GPRAM_BANK01021_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01021_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01022
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01022_DATA_W                                              32
#define GPRAM_BANK01022_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01022_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01023
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01023_DATA_W                                              32
#define GPRAM_BANK01023_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01023_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01024
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01024_DATA_W                                              32
#define GPRAM_BANK01024_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01024_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01025
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01025_DATA_W                                              32
#define GPRAM_BANK01025_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01025_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01026
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01026_DATA_W                                              32
#define GPRAM_BANK01026_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01026_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01027
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01027_DATA_W                                              32
#define GPRAM_BANK01027_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01027_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01028
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01028_DATA_W                                              32
#define GPRAM_BANK01028_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01028_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01029
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01029_DATA_W                                              32
#define GPRAM_BANK01029_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01029_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01030
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01030_DATA_W                                              32
#define GPRAM_BANK01030_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01030_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01031
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01031_DATA_W                                              32
#define GPRAM_BANK01031_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01031_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01032
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01032_DATA_W                                              32
#define GPRAM_BANK01032_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01032_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01033
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01033_DATA_W                                              32
#define GPRAM_BANK01033_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01033_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01034
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01034_DATA_W                                              32
#define GPRAM_BANK01034_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01034_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01035
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01035_DATA_W                                              32
#define GPRAM_BANK01035_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01035_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01036
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01036_DATA_W                                              32
#define GPRAM_BANK01036_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01036_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01037
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01037_DATA_W                                              32
#define GPRAM_BANK01037_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01037_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01038
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01038_DATA_W                                              32
#define GPRAM_BANK01038_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01038_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01039
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01039_DATA_W                                              32
#define GPRAM_BANK01039_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01039_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01040
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01040_DATA_W                                              32
#define GPRAM_BANK01040_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01040_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01041
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01041_DATA_W                                              32
#define GPRAM_BANK01041_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01041_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01042
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01042_DATA_W                                              32
#define GPRAM_BANK01042_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01042_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01043
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01043_DATA_W                                              32
#define GPRAM_BANK01043_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01043_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01044
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01044_DATA_W                                              32
#define GPRAM_BANK01044_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01044_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01045
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01045_DATA_W                                              32
#define GPRAM_BANK01045_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01045_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01046
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01046_DATA_W                                              32
#define GPRAM_BANK01046_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01046_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01047
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01047_DATA_W                                              32
#define GPRAM_BANK01047_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01047_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01048
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01048_DATA_W                                              32
#define GPRAM_BANK01048_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01048_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01049
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01049_DATA_W                                              32
#define GPRAM_BANK01049_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01049_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01050
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01050_DATA_W                                              32
#define GPRAM_BANK01050_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01050_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01051
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01051_DATA_W                                              32
#define GPRAM_BANK01051_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01051_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01052
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01052_DATA_W                                              32
#define GPRAM_BANK01052_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01052_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01053
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01053_DATA_W                                              32
#define GPRAM_BANK01053_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01053_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01054
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01054_DATA_W                                              32
#define GPRAM_BANK01054_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01054_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01055
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01055_DATA_W                                              32
#define GPRAM_BANK01055_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01055_DATA_S                                               0

