brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01056
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01056_DATA_W                                              32
#define GPRAM_BANK01056_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01056_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01057
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01057_DATA_W                                              32
#define GPRAM_BANK01057_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01057_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01058
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01058_DATA_W                                              32
#define GPRAM_BANK01058_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01058_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01059
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01059_DATA_W                                              32
#define GPRAM_BANK01059_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01059_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01060
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01060_DATA_W                                              32
#define GPRAM_BANK01060_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01060_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01061
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01061_DATA_W                                              32
#define GPRAM_BANK01061_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01061_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01062
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01062_DATA_W                                              32
#define GPRAM_BANK01062_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01062_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01063
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01063_DATA_W                                              32
#define GPRAM_BANK01063_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01063_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01064
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01064_DATA_W                                              32
#define GPRAM_BANK01064_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01064_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01065
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01065_DATA_W                                              32
#define GPRAM_BANK01065_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01065_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01066
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01066_DATA_W                                              32
#define GPRAM_BANK01066_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01066_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01067
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01067_DATA_W                                              32
#define GPRAM_BANK01067_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01067_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01068
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01068_DATA_W                                              32
#define GPRAM_BANK01068_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01068_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01069
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01069_DATA_W                                              32
#define GPRAM_BANK01069_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01069_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01070
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01070_DATA_W                                              32
#define GPRAM_BANK01070_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01070_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01071
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01071_DATA_W                                              32
#define GPRAM_BANK01071_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01071_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01072
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01072_DATA_W                                              32
#define GPRAM_BANK01072_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01072_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01073
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01073_DATA_W                                              32
#define GPRAM_BANK01073_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01073_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01074
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01074_DATA_W                                              32
#define GPRAM_BANK01074_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01074_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01075
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01075_DATA_W                                              32
#define GPRAM_BANK01075_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01075_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01076
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01076_DATA_W                                              32
#define GPRAM_BANK01076_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01076_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01077
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01077_DATA_W                                              32
#define GPRAM_BANK01077_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01077_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01078
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01078_DATA_W                                              32
#define GPRAM_BANK01078_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01078_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01079
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01079_DATA_W                                              32
#define GPRAM_BANK01079_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01079_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01080
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01080_DATA_W                                              32
#define GPRAM_BANK01080_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01080_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01081
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01081_DATA_W                                              32
#define GPRAM_BANK01081_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01081_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01082
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01082_DATA_W                                              32
#define GPRAM_BANK01082_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01082_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01083
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01083_DATA_W                                              32
#define GPRAM_BANK01083_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01083_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01084
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01084_DATA_W                                              32
#define GPRAM_BANK01084_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01084_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01085
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01085_DATA_W                                              32
#define GPRAM_BANK01085_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01085_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01086
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01086_DATA_W                                              32
#define GPRAM_BANK01086_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01086_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01087
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01087_DATA_W                                              32
#define GPRAM_BANK01087_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01087_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01088
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01088_DATA_W                                              32
#define GPRAM_BANK01088_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01088_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01089
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01089_DATA_W                                              32
#define GPRAM_BANK01089_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01089_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01090
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01090_DATA_W                                              32
#define GPRAM_BANK01090_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01090_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01091
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01091_DATA_W                                              32
#define GPRAM_BANK01091_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01091_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01092
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01092_DATA_W                                              32
#define GPRAM_BANK01092_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01092_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01093
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01093_DATA_W                                              32
#define GPRAM_BANK01093_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01093_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01094
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01094_DATA_W                                              32
#define GPRAM_BANK01094_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01094_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01095
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01095_DATA_W                                              32
#define GPRAM_BANK01095_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01095_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01096
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01096_DATA_W                                              32
#define GPRAM_BANK01096_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01096_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01097
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01097_DATA_W                                              32
#define GPRAM_BANK01097_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01097_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01098
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01098_DATA_W                                              32
#define GPRAM_BANK01098_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01098_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01099
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01099_DATA_W                                              32
#define GPRAM_BANK01099_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01099_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01100
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01100_DATA_W                                              32
#define GPRAM_BANK01100_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01100_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01101
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01101_DATA_W                                              32
#define GPRAM_BANK01101_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01101_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01102
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01102_DATA_W                                              32
#define GPRAM_BANK01102_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01102_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01103
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01103_DATA_W                                              32
#define GPRAM_BANK01103_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01103_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01104
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01104_DATA_W                                              32
#define GPRAM_BANK01104_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01104_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01105
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01105_DATA_W                                              32
#define GPRAM_BANK01105_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01105_DATA_S                                               0

