brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01106
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01106_DATA_W                                              32
#define GPRAM_BANK01106_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01106_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01107
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01107_DATA_W                                              32
#define GPRAM_BANK01107_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01107_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01108
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01108_DATA_W                                              32
#define GPRAM_BANK01108_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01108_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01109
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01109_DATA_W                                              32
#define GPRAM_BANK01109_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01109_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01110
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01110_DATA_W                                              32
#define GPRAM_BANK01110_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01110_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01111
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01111_DATA_W                                              32
#define GPRAM_BANK01111_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01111_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01112
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01112_DATA_W                                              32
#define GPRAM_BANK01112_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01112_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01113
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01113_DATA_W                                              32
#define GPRAM_BANK01113_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01113_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01114
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01114_DATA_W                                              32
#define GPRAM_BANK01114_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01114_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01115
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01115_DATA_W                                              32
#define GPRAM_BANK01115_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01115_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01116
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01116_DATA_W                                              32
#define GPRAM_BANK01116_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01116_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01117
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01117_DATA_W                                              32
#define GPRAM_BANK01117_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01117_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01118
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01118_DATA_W                                              32
#define GPRAM_BANK01118_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01118_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01119
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01119_DATA_W                                              32
#define GPRAM_BANK01119_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01119_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01120
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01120_DATA_W                                              32
#define GPRAM_BANK01120_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01120_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01121
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01121_DATA_W                                              32
#define GPRAM_BANK01121_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01121_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01122
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01122_DATA_W                                              32
#define GPRAM_BANK01122_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01122_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01123
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01123_DATA_W                                              32
#define GPRAM_BANK01123_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01123_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01124
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01124_DATA_W                                              32
#define GPRAM_BANK01124_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01124_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01125
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01125_DATA_W                                              32
#define GPRAM_BANK01125_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01125_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01126
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01126_DATA_W                                              32
#define GPRAM_BANK01126_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01126_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01127
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01127_DATA_W                                              32
#define GPRAM_BANK01127_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01127_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01128
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01128_DATA_W                                              32
#define GPRAM_BANK01128_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01128_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01129
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01129_DATA_W                                              32
#define GPRAM_BANK01129_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01129_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01130
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01130_DATA_W                                              32
#define GPRAM_BANK01130_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01130_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01131
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01131_DATA_W                                              32
#define GPRAM_BANK01131_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01131_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01132
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01132_DATA_W                                              32
#define GPRAM_BANK01132_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01132_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01133
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01133_DATA_W                                              32
#define GPRAM_BANK01133_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01133_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01134
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01134_DATA_W                                              32
#define GPRAM_BANK01134_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01134_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01135
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01135_DATA_W                                              32
#define GPRAM_BANK01135_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01135_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01136
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01136_DATA_W                                              32
#define GPRAM_BANK01136_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01136_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01137
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01137_DATA_W                                              32
#define GPRAM_BANK01137_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01137_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01138
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01138_DATA_W                                              32
#define GPRAM_BANK01138_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01138_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01139
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01139_DATA_W                                              32
#define GPRAM_BANK01139_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01139_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01140
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01140_DATA_W                                              32
#define GPRAM_BANK01140_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01140_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01141
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01141_DATA_W                                              32
#define GPRAM_BANK01141_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01141_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01142
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01142_DATA_W                                              32
#define GPRAM_BANK01142_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01142_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01143
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01143_DATA_W                                              32
#define GPRAM_BANK01143_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01143_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01144
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01144_DATA_W                                              32
#define GPRAM_BANK01144_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01144_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01145
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01145_DATA_W                                              32
#define GPRAM_BANK01145_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01145_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01146
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01146_DATA_W                                              32
#define GPRAM_BANK01146_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01146_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01147
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01147_DATA_W                                              32
#define GPRAM_BANK01147_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01147_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01148
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01148_DATA_W                                              32
#define GPRAM_BANK01148_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01148_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01149
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01149_DATA_W                                              32
#define GPRAM_BANK01149_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01149_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01150
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01150_DATA_W                                              32
#define GPRAM_BANK01150_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01150_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01151
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01151_DATA_W                                              32
#define GPRAM_BANK01151_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01151_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01152
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01152_DATA_W                                              32
#define GPRAM_BANK01152_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01152_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01153
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01153_DATA_W                                              32
#define GPRAM_BANK01153_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01153_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01154
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01154_DATA_W                                              32
#define GPRAM_BANK01154_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01154_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01155
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01155_DATA_W                                              32
#define GPRAM_BANK01155_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01155_DATA_S                                               0

