brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01156
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01156_DATA_W                                              32
#define GPRAM_BANK01156_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01156_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01157
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01157_DATA_W                                              32
#define GPRAM_BANK01157_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01157_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01158
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01158_DATA_W                                              32
#define GPRAM_BANK01158_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01158_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01159
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01159_DATA_W                                              32
#define GPRAM_BANK01159_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01159_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01160
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01160_DATA_W                                              32
#define GPRAM_BANK01160_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01160_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01161
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01161_DATA_W                                              32
#define GPRAM_BANK01161_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01161_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01162
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01162_DATA_W                                              32
#define GPRAM_BANK01162_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01162_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01163
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01163_DATA_W                                              32
#define GPRAM_BANK01163_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01163_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01164
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01164_DATA_W                                              32
#define GPRAM_BANK01164_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01164_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01165
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01165_DATA_W                                              32
#define GPRAM_BANK01165_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01165_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01166
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01166_DATA_W                                              32
#define GPRAM_BANK01166_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01166_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01167
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01167_DATA_W                                              32
#define GPRAM_BANK01167_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01167_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01168
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01168_DATA_W                                              32
#define GPRAM_BANK01168_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01168_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01169
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01169_DATA_W                                              32
#define GPRAM_BANK01169_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01169_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01170
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01170_DATA_W                                              32
#define GPRAM_BANK01170_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01170_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01171
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01171_DATA_W                                              32
#define GPRAM_BANK01171_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01171_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01172
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01172_DATA_W                                              32
#define GPRAM_BANK01172_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01172_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01173
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01173_DATA_W                                              32
#define GPRAM_BANK01173_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01173_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01174
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01174_DATA_W                                              32
#define GPRAM_BANK01174_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01174_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01175
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01175_DATA_W                                              32
#define GPRAM_BANK01175_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01175_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01176
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01176_DATA_W                                              32
#define GPRAM_BANK01176_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01176_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01177
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01177_DATA_W                                              32
#define GPRAM_BANK01177_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01177_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01178
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01178_DATA_W                                              32
#define GPRAM_BANK01178_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01178_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01179
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01179_DATA_W                                              32
#define GPRAM_BANK01179_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01179_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01180
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01180_DATA_W                                              32
#define GPRAM_BANK01180_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01180_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01181
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01181_DATA_W                                              32
#define GPRAM_BANK01181_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01181_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01182
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01182_DATA_W                                              32
#define GPRAM_BANK01182_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01182_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01183
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01183_DATA_W                                              32
#define GPRAM_BANK01183_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01183_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01184
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01184_DATA_W                                              32
#define GPRAM_BANK01184_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01184_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01185
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01185_DATA_W                                              32
#define GPRAM_BANK01185_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01185_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01186
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01186_DATA_W                                              32
#define GPRAM_BANK01186_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01186_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01187
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01187_DATA_W                                              32
#define GPRAM_BANK01187_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01187_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01188
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01188_DATA_W                                              32
#define GPRAM_BANK01188_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01188_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01189
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01189_DATA_W                                              32
#define GPRAM_BANK01189_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01189_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01190
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01190_DATA_W                                              32
#define GPRAM_BANK01190_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01190_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01191
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01191_DATA_W                                              32
#define GPRAM_BANK01191_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01191_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01192
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01192_DATA_W                                              32
#define GPRAM_BANK01192_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01192_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01193
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01193_DATA_W                                              32
#define GPRAM_BANK01193_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01193_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01194
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01194_DATA_W                                              32
#define GPRAM_BANK01194_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01194_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01195
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01195_DATA_W                                              32
#define GPRAM_BANK01195_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01195_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01196
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01196_DATA_W                                              32
#define GPRAM_BANK01196_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01196_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01197
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01197_DATA_W                                              32
#define GPRAM_BANK01197_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01197_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01198
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01198_DATA_W                                              32
#define GPRAM_BANK01198_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01198_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01199
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01199_DATA_W                                              32
#define GPRAM_BANK01199_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01199_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01200
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01200_DATA_W                                              32
#define GPRAM_BANK01200_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01200_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01201
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01201_DATA_W                                              32
#define GPRAM_BANK01201_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01201_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01202
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01202_DATA_W                                              32
#define GPRAM_BANK01202_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01202_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01203
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01203_DATA_W                                              32
#define GPRAM_BANK01203_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01203_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01204
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01204_DATA_W                                              32
#define GPRAM_BANK01204_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01204_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01205
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01205_DATA_W                                              32
#define GPRAM_BANK01205_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01205_DATA_S                                               0

