brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01206
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01206_DATA_W                                              32
#define GPRAM_BANK01206_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01206_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01207
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01207_DATA_W                                              32
#define GPRAM_BANK01207_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01207_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01208
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01208_DATA_W                                              32
#define GPRAM_BANK01208_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01208_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01209
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01209_DATA_W                                              32
#define GPRAM_BANK01209_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01209_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01210
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01210_DATA_W                                              32
#define GPRAM_BANK01210_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01210_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01211
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01211_DATA_W                                              32
#define GPRAM_BANK01211_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01211_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01212
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01212_DATA_W                                              32
#define GPRAM_BANK01212_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01212_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01213
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01213_DATA_W                                              32
#define GPRAM_BANK01213_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01213_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01214
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01214_DATA_W                                              32
#define GPRAM_BANK01214_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01214_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01215
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01215_DATA_W                                              32
#define GPRAM_BANK01215_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01215_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01216
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01216_DATA_W                                              32
#define GPRAM_BANK01216_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01216_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01217
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01217_DATA_W                                              32
#define GPRAM_BANK01217_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01217_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01218
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01218_DATA_W                                              32
#define GPRAM_BANK01218_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01218_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01219
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01219_DATA_W                                              32
#define GPRAM_BANK01219_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01219_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01220
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01220_DATA_W                                              32
#define GPRAM_BANK01220_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01220_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01221
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01221_DATA_W                                              32
#define GPRAM_BANK01221_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01221_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01222
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01222_DATA_W                                              32
#define GPRAM_BANK01222_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01222_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01223
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01223_DATA_W                                              32
#define GPRAM_BANK01223_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01223_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01224
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01224_DATA_W                                              32
#define GPRAM_BANK01224_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01224_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01225
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01225_DATA_W                                              32
#define GPRAM_BANK01225_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01225_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01226
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01226_DATA_W                                              32
#define GPRAM_BANK01226_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01226_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01227
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01227_DATA_W                                              32
#define GPRAM_BANK01227_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01227_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01228
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01228_DATA_W                                              32
#define GPRAM_BANK01228_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01228_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01229
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01229_DATA_W                                              32
#define GPRAM_BANK01229_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01229_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01230
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01230_DATA_W                                              32
#define GPRAM_BANK01230_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01230_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01231
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01231_DATA_W                                              32
#define GPRAM_BANK01231_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01231_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01232
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01232_DATA_W                                              32
#define GPRAM_BANK01232_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01232_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01233
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01233_DATA_W                                              32
#define GPRAM_BANK01233_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01233_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01234
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01234_DATA_W                                              32
#define GPRAM_BANK01234_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01234_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01235
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01235_DATA_W                                              32
#define GPRAM_BANK01235_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01235_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01236
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01236_DATA_W                                              32
#define GPRAM_BANK01236_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01236_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01237
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01237_DATA_W                                              32
#define GPRAM_BANK01237_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01237_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01238
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01238_DATA_W                                              32
#define GPRAM_BANK01238_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01238_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01239
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01239_DATA_W                                              32
#define GPRAM_BANK01239_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01239_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01240
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01240_DATA_W                                              32
#define GPRAM_BANK01240_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01240_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01241
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01241_DATA_W                                              32
#define GPRAM_BANK01241_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01241_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01242
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01242_DATA_W                                              32
#define GPRAM_BANK01242_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01242_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01243
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01243_DATA_W                                              32
#define GPRAM_BANK01243_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01243_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01244
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01244_DATA_W                                              32
#define GPRAM_BANK01244_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01244_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01245
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01245_DATA_W                                              32
#define GPRAM_BANK01245_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01245_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01246
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01246_DATA_W                                              32
#define GPRAM_BANK01246_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01246_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01247
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01247_DATA_W                                              32
#define GPRAM_BANK01247_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01247_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01248
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01248_DATA_W                                              32
#define GPRAM_BANK01248_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01248_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01249
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01249_DATA_W                                              32
#define GPRAM_BANK01249_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01249_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01250
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01250_DATA_W                                              32
#define GPRAM_BANK01250_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01250_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01251
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01251_DATA_W                                              32
#define GPRAM_BANK01251_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01251_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01252
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01252_DATA_W                                              32
#define GPRAM_BANK01252_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01252_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01253
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01253_DATA_W                                              32
#define GPRAM_BANK01253_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01253_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01254
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01254_DATA_W                                              32
#define GPRAM_BANK01254_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01254_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01255
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01255_DATA_W                                              32
#define GPRAM_BANK01255_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01255_DATA_S                                               0

