brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01256
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01256_DATA_W                                              32
#define GPRAM_BANK01256_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01256_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01257
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01257_DATA_W                                              32
#define GPRAM_BANK01257_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01257_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01258
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01258_DATA_W                                              32
#define GPRAM_BANK01258_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01258_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01259
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01259_DATA_W                                              32
#define GPRAM_BANK01259_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01259_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01260
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01260_DATA_W                                              32
#define GPRAM_BANK01260_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01260_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01261
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01261_DATA_W                                              32
#define GPRAM_BANK01261_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01261_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01262
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01262_DATA_W                                              32
#define GPRAM_BANK01262_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01262_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01263
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01263_DATA_W                                              32
#define GPRAM_BANK01263_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01263_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01264
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01264_DATA_W                                              32
#define GPRAM_BANK01264_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01264_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01265
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01265_DATA_W                                              32
#define GPRAM_BANK01265_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01265_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01266
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01266_DATA_W                                              32
#define GPRAM_BANK01266_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01266_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01267
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01267_DATA_W                                              32
#define GPRAM_BANK01267_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01267_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01268
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01268_DATA_W                                              32
#define GPRAM_BANK01268_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01268_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01269
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01269_DATA_W                                              32
#define GPRAM_BANK01269_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01269_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01270
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01270_DATA_W                                              32
#define GPRAM_BANK01270_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01270_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01271
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01271_DATA_W                                              32
#define GPRAM_BANK01271_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01271_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01272
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01272_DATA_W                                              32
#define GPRAM_BANK01272_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01272_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01273
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01273_DATA_W                                              32
#define GPRAM_BANK01273_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01273_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01274
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01274_DATA_W                                              32
#define GPRAM_BANK01274_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01274_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01275
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01275_DATA_W                                              32
#define GPRAM_BANK01275_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01275_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01276
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01276_DATA_W                                              32
#define GPRAM_BANK01276_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01276_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01277
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01277_DATA_W                                              32
#define GPRAM_BANK01277_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01277_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01278
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01278_DATA_W                                              32
#define GPRAM_BANK01278_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01278_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01279
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01279_DATA_W                                              32
#define GPRAM_BANK01279_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01279_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01280
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01280_DATA_W                                              32
#define GPRAM_BANK01280_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01280_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01281
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01281_DATA_W                                              32
#define GPRAM_BANK01281_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01281_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01282
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01282_DATA_W                                              32
#define GPRAM_BANK01282_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01282_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01283
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01283_DATA_W                                              32
#define GPRAM_BANK01283_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01283_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01284
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01284_DATA_W                                              32
#define GPRAM_BANK01284_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01284_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01285
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01285_DATA_W                                              32
#define GPRAM_BANK01285_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01285_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01286
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01286_DATA_W                                              32
#define GPRAM_BANK01286_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01286_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01287
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01287_DATA_W                                              32
#define GPRAM_BANK01287_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01287_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01288
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01288_DATA_W                                              32
#define GPRAM_BANK01288_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01288_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01289
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01289_DATA_W                                              32
#define GPRAM_BANK01289_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01289_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01290
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01290_DATA_W                                              32
#define GPRAM_BANK01290_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01290_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01291
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01291_DATA_W                                              32
#define GPRAM_BANK01291_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01291_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01292
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01292_DATA_W                                              32
#define GPRAM_BANK01292_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01292_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01293
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01293_DATA_W                                              32
#define GPRAM_BANK01293_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01293_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01294
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01294_DATA_W                                              32
#define GPRAM_BANK01294_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01294_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01295
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01295_DATA_W                                              32
#define GPRAM_BANK01295_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01295_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01296
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01296_DATA_W                                              32
#define GPRAM_BANK01296_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01296_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01297
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01297_DATA_W                                              32
#define GPRAM_BANK01297_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01297_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01298
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01298_DATA_W                                              32
#define GPRAM_BANK01298_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01298_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01299
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01299_DATA_W                                              32
#define GPRAM_BANK01299_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01299_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01300
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01300_DATA_W                                              32
#define GPRAM_BANK01300_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01300_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01301
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01301_DATA_W                                              32
#define GPRAM_BANK01301_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01301_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01302
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01302_DATA_W                                              32
#define GPRAM_BANK01302_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01302_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01303
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01303_DATA_W                                              32
#define GPRAM_BANK01303_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01303_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01304
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01304_DATA_W                                              32
#define GPRAM_BANK01304_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01304_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01305
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01305_DATA_W                                              32
#define GPRAM_BANK01305_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01305_DATA_S                                               0

