brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01306
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01306_DATA_W                                              32
#define GPRAM_BANK01306_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01306_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01307
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01307_DATA_W                                              32
#define GPRAM_BANK01307_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01307_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01308
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01308_DATA_W                                              32
#define GPRAM_BANK01308_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01308_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01309
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01309_DATA_W                                              32
#define GPRAM_BANK01309_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01309_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01310
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01310_DATA_W                                              32
#define GPRAM_BANK01310_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01310_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01311
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01311_DATA_W                                              32
#define GPRAM_BANK01311_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01311_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01312
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01312_DATA_W                                              32
#define GPRAM_BANK01312_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01312_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01313
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01313_DATA_W                                              32
#define GPRAM_BANK01313_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01313_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01314
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01314_DATA_W                                              32
#define GPRAM_BANK01314_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01314_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01315
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01315_DATA_W                                              32
#define GPRAM_BANK01315_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01315_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01316
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01316_DATA_W                                              32
#define GPRAM_BANK01316_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01316_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01317
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01317_DATA_W                                              32
#define GPRAM_BANK01317_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01317_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01318
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01318_DATA_W                                              32
#define GPRAM_BANK01318_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01318_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01319
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01319_DATA_W                                              32
#define GPRAM_BANK01319_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01319_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01320
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01320_DATA_W                                              32
#define GPRAM_BANK01320_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01320_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01321
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01321_DATA_W                                              32
#define GPRAM_BANK01321_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01321_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01322
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01322_DATA_W                                              32
#define GPRAM_BANK01322_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01322_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01323
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01323_DATA_W                                              32
#define GPRAM_BANK01323_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01323_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01324
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01324_DATA_W                                              32
#define GPRAM_BANK01324_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01324_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01325
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01325_DATA_W                                              32
#define GPRAM_BANK01325_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01325_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01326
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01326_DATA_W                                              32
#define GPRAM_BANK01326_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01326_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01327
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01327_DATA_W                                              32
#define GPRAM_BANK01327_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01327_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01328
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01328_DATA_W                                              32
#define GPRAM_BANK01328_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01328_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01329
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01329_DATA_W                                              32
#define GPRAM_BANK01329_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01329_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01330
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01330_DATA_W                                              32
#define GPRAM_BANK01330_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01330_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01331
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01331_DATA_W                                              32
#define GPRAM_BANK01331_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01331_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01332
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01332_DATA_W                                              32
#define GPRAM_BANK01332_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01332_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01333
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01333_DATA_W                                              32
#define GPRAM_BANK01333_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01333_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01334
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01334_DATA_W                                              32
#define GPRAM_BANK01334_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01334_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01335
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01335_DATA_W                                              32
#define GPRAM_BANK01335_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01335_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01336
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01336_DATA_W                                              32
#define GPRAM_BANK01336_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01336_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01337
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01337_DATA_W                                              32
#define GPRAM_BANK01337_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01337_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01338
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01338_DATA_W                                              32
#define GPRAM_BANK01338_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01338_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01339
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01339_DATA_W                                              32
#define GPRAM_BANK01339_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01339_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01340
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01340_DATA_W                                              32
#define GPRAM_BANK01340_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01340_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01341
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01341_DATA_W                                              32
#define GPRAM_BANK01341_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01341_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01342
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01342_DATA_W                                              32
#define GPRAM_BANK01342_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01342_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01343
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01343_DATA_W                                              32
#define GPRAM_BANK01343_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01343_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01344
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01344_DATA_W                                              32
#define GPRAM_BANK01344_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01344_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01345
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01345_DATA_W                                              32
#define GPRAM_BANK01345_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01345_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01346
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01346_DATA_W                                              32
#define GPRAM_BANK01346_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01346_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01347
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01347_DATA_W                                              32
#define GPRAM_BANK01347_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01347_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01348
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01348_DATA_W                                              32
#define GPRAM_BANK01348_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01348_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01349
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01349_DATA_W                                              32
#define GPRAM_BANK01349_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01349_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01350
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01350_DATA_W                                              32
#define GPRAM_BANK01350_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01350_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01351
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01351_DATA_W                                              32
#define GPRAM_BANK01351_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01351_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01352
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01352_DATA_W                                              32
#define GPRAM_BANK01352_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01352_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01353
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01353_DATA_W                                              32
#define GPRAM_BANK01353_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01353_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01354
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01354_DATA_W                                              32
#define GPRAM_BANK01354_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01354_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01355
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01355_DATA_W                                              32
#define GPRAM_BANK01355_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01355_DATA_S                                               0

