brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01356
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01356_DATA_W                                              32
#define GPRAM_BANK01356_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01356_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01357
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01357_DATA_W                                              32
#define GPRAM_BANK01357_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01357_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01358
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01358_DATA_W                                              32
#define GPRAM_BANK01358_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01358_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01359
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01359_DATA_W                                              32
#define GPRAM_BANK01359_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01359_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01360
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01360_DATA_W                                              32
#define GPRAM_BANK01360_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01360_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01361
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01361_DATA_W                                              32
#define GPRAM_BANK01361_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01361_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01362
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01362_DATA_W                                              32
#define GPRAM_BANK01362_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01362_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01363
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01363_DATA_W                                              32
#define GPRAM_BANK01363_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01363_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01364
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01364_DATA_W                                              32
#define GPRAM_BANK01364_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01364_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01365
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01365_DATA_W                                              32
#define GPRAM_BANK01365_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01365_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01366
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01366_DATA_W                                              32
#define GPRAM_BANK01366_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01366_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01367
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01367_DATA_W                                              32
#define GPRAM_BANK01367_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01367_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01368
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01368_DATA_W                                              32
#define GPRAM_BANK01368_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01368_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01369
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01369_DATA_W                                              32
#define GPRAM_BANK01369_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01369_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01370
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01370_DATA_W                                              32
#define GPRAM_BANK01370_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01370_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01371
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01371_DATA_W                                              32
#define GPRAM_BANK01371_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01371_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01372
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01372_DATA_W                                              32
#define GPRAM_BANK01372_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01372_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01373
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01373_DATA_W                                              32
#define GPRAM_BANK01373_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01373_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01374
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01374_DATA_W                                              32
#define GPRAM_BANK01374_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01374_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01375
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01375_DATA_W                                              32
#define GPRAM_BANK01375_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01375_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01376
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01376_DATA_W                                              32
#define GPRAM_BANK01376_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01376_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01377
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01377_DATA_W                                              32
#define GPRAM_BANK01377_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01377_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01378
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01378_DATA_W                                              32
#define GPRAM_BANK01378_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01378_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01379
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01379_DATA_W                                              32
#define GPRAM_BANK01379_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01379_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01380
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01380_DATA_W                                              32
#define GPRAM_BANK01380_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01380_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01381
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01381_DATA_W                                              32
#define GPRAM_BANK01381_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01381_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01382
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01382_DATA_W                                              32
#define GPRAM_BANK01382_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01382_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01383
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01383_DATA_W                                              32
#define GPRAM_BANK01383_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01383_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01384
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01384_DATA_W                                              32
#define GPRAM_BANK01384_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01384_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01385
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01385_DATA_W                                              32
#define GPRAM_BANK01385_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01385_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01386
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01386_DATA_W                                              32
#define GPRAM_BANK01386_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01386_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01387
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01387_DATA_W                                              32
#define GPRAM_BANK01387_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01387_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01388
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01388_DATA_W                                              32
#define GPRAM_BANK01388_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01388_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01389
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01389_DATA_W                                              32
#define GPRAM_BANK01389_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01389_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01390
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01390_DATA_W                                              32
#define GPRAM_BANK01390_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01390_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01391
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01391_DATA_W                                              32
#define GPRAM_BANK01391_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01391_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01392
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01392_DATA_W                                              32
#define GPRAM_BANK01392_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01392_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01393
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01393_DATA_W                                              32
#define GPRAM_BANK01393_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01393_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01394
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01394_DATA_W                                              32
#define GPRAM_BANK01394_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01394_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01395
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01395_DATA_W                                              32
#define GPRAM_BANK01395_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01395_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01396
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01396_DATA_W                                              32
#define GPRAM_BANK01396_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01396_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01397
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01397_DATA_W                                              32
#define GPRAM_BANK01397_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01397_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01398
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01398_DATA_W                                              32
#define GPRAM_BANK01398_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01398_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01399
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01399_DATA_W                                              32
#define GPRAM_BANK01399_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01399_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01400
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01400_DATA_W                                              32
#define GPRAM_BANK01400_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01400_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01401
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01401_DATA_W                                              32
#define GPRAM_BANK01401_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01401_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01402
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01402_DATA_W                                              32
#define GPRAM_BANK01402_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01402_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01403
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01403_DATA_W                                              32
#define GPRAM_BANK01403_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01403_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01404
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01404_DATA_W                                              32
#define GPRAM_BANK01404_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01404_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01405
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01405_DATA_W                                              32
#define GPRAM_BANK01405_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01405_DATA_S                                               0

