brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01406
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01406_DATA_W                                              32
#define GPRAM_BANK01406_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01406_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01407
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01407_DATA_W                                              32
#define GPRAM_BANK01407_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01407_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01408
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01408_DATA_W                                              32
#define GPRAM_BANK01408_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01408_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01409
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01409_DATA_W                                              32
#define GPRAM_BANK01409_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01409_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01410
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01410_DATA_W                                              32
#define GPRAM_BANK01410_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01410_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01411
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01411_DATA_W                                              32
#define GPRAM_BANK01411_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01411_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01412
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01412_DATA_W                                              32
#define GPRAM_BANK01412_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01412_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01413
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01413_DATA_W                                              32
#define GPRAM_BANK01413_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01413_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01414
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01414_DATA_W                                              32
#define GPRAM_BANK01414_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01414_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01415
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01415_DATA_W                                              32
#define GPRAM_BANK01415_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01415_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01416
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01416_DATA_W                                              32
#define GPRAM_BANK01416_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01416_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01417
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01417_DATA_W                                              32
#define GPRAM_BANK01417_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01417_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01418
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01418_DATA_W                                              32
#define GPRAM_BANK01418_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01418_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01419
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01419_DATA_W                                              32
#define GPRAM_BANK01419_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01419_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01420
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01420_DATA_W                                              32
#define GPRAM_BANK01420_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01420_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01421
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01421_DATA_W                                              32
#define GPRAM_BANK01421_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01421_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01422
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01422_DATA_W                                              32
#define GPRAM_BANK01422_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01422_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01423
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01423_DATA_W                                              32
#define GPRAM_BANK01423_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01423_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01424
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01424_DATA_W                                              32
#define GPRAM_BANK01424_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01424_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01425
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01425_DATA_W                                              32
#define GPRAM_BANK01425_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01425_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01426
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01426_DATA_W                                              32
#define GPRAM_BANK01426_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01426_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01427
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01427_DATA_W                                              32
#define GPRAM_BANK01427_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01427_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01428
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01428_DATA_W                                              32
#define GPRAM_BANK01428_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01428_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01429
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01429_DATA_W                                              32
#define GPRAM_BANK01429_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01429_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01430
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01430_DATA_W                                              32
#define GPRAM_BANK01430_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01430_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01431
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01431_DATA_W                                              32
#define GPRAM_BANK01431_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01431_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01432
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01432_DATA_W                                              32
#define GPRAM_BANK01432_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01432_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01433
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01433_DATA_W                                              32
#define GPRAM_BANK01433_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01433_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01434
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01434_DATA_W                                              32
#define GPRAM_BANK01434_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01434_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01435
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01435_DATA_W                                              32
#define GPRAM_BANK01435_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01435_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01436
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01436_DATA_W                                              32
#define GPRAM_BANK01436_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01436_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01437
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01437_DATA_W                                              32
#define GPRAM_BANK01437_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01437_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01438
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01438_DATA_W                                              32
#define GPRAM_BANK01438_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01438_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01439
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01439_DATA_W                                              32
#define GPRAM_BANK01439_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01439_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01440
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01440_DATA_W                                              32
#define GPRAM_BANK01440_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01440_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01441
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01441_DATA_W                                              32
#define GPRAM_BANK01441_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01441_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01442
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01442_DATA_W                                              32
#define GPRAM_BANK01442_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01442_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01443
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01443_DATA_W                                              32
#define GPRAM_BANK01443_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01443_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01444
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01444_DATA_W                                              32
#define GPRAM_BANK01444_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01444_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01445
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01445_DATA_W                                              32
#define GPRAM_BANK01445_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01445_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01446
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01446_DATA_W                                              32
#define GPRAM_BANK01446_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01446_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01447
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01447_DATA_W                                              32
#define GPRAM_BANK01447_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01447_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01448
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01448_DATA_W                                              32
#define GPRAM_BANK01448_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01448_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01449
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01449_DATA_W                                              32
#define GPRAM_BANK01449_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01449_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01450
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01450_DATA_W                                              32
#define GPRAM_BANK01450_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01450_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01451
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01451_DATA_W                                              32
#define GPRAM_BANK01451_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01451_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01452
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01452_DATA_W                                              32
#define GPRAM_BANK01452_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01452_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01453
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01453_DATA_W                                              32
#define GPRAM_BANK01453_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01453_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01454
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01454_DATA_W                                              32
#define GPRAM_BANK01454_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01454_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01455
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01455_DATA_W                                              32
#define GPRAM_BANK01455_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01455_DATA_S                                               0

