brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01456
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01456_DATA_W                                              32
#define GPRAM_BANK01456_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01456_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01457
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01457_DATA_W                                              32
#define GPRAM_BANK01457_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01457_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01458
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01458_DATA_W                                              32
#define GPRAM_BANK01458_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01458_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01459
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01459_DATA_W                                              32
#define GPRAM_BANK01459_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01459_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01460
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01460_DATA_W                                              32
#define GPRAM_BANK01460_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01460_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01461
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01461_DATA_W                                              32
#define GPRAM_BANK01461_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01461_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01462
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01462_DATA_W                                              32
#define GPRAM_BANK01462_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01462_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01463
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01463_DATA_W                                              32
#define GPRAM_BANK01463_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01463_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01464
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01464_DATA_W                                              32
#define GPRAM_BANK01464_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01464_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01465
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01465_DATA_W                                              32
#define GPRAM_BANK01465_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01465_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01466
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01466_DATA_W                                              32
#define GPRAM_BANK01466_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01466_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01467
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01467_DATA_W                                              32
#define GPRAM_BANK01467_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01467_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01468
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01468_DATA_W                                              32
#define GPRAM_BANK01468_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01468_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01469
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01469_DATA_W                                              32
#define GPRAM_BANK01469_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01469_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01470
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01470_DATA_W                                              32
#define GPRAM_BANK01470_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01470_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01471
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01471_DATA_W                                              32
#define GPRAM_BANK01471_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01471_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01472
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01472_DATA_W                                              32
#define GPRAM_BANK01472_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01472_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01473
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01473_DATA_W                                              32
#define GPRAM_BANK01473_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01473_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01474
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01474_DATA_W                                              32
#define GPRAM_BANK01474_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01474_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01475
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01475_DATA_W                                              32
#define GPRAM_BANK01475_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01475_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01476
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01476_DATA_W                                              32
#define GPRAM_BANK01476_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01476_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01477
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01477_DATA_W                                              32
#define GPRAM_BANK01477_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01477_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01478
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01478_DATA_W                                              32
#define GPRAM_BANK01478_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01478_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01479
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01479_DATA_W                                              32
#define GPRAM_BANK01479_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01479_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01480
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01480_DATA_W                                              32
#define GPRAM_BANK01480_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01480_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01481
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01481_DATA_W                                              32
#define GPRAM_BANK01481_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01481_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01482
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01482_DATA_W                                              32
#define GPRAM_BANK01482_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01482_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01483
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01483_DATA_W                                              32
#define GPRAM_BANK01483_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01483_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01484
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01484_DATA_W                                              32
#define GPRAM_BANK01484_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01484_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01485
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01485_DATA_W                                              32
#define GPRAM_BANK01485_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01485_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01486
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01486_DATA_W                                              32
#define GPRAM_BANK01486_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01486_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01487
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01487_DATA_W                                              32
#define GPRAM_BANK01487_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01487_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01488
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01488_DATA_W                                              32
#define GPRAM_BANK01488_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01488_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01489
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01489_DATA_W                                              32
#define GPRAM_BANK01489_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01489_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01490
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01490_DATA_W                                              32
#define GPRAM_BANK01490_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01490_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01491
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01491_DATA_W                                              32
#define GPRAM_BANK01491_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01491_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01492
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01492_DATA_W                                              32
#define GPRAM_BANK01492_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01492_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01493
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01493_DATA_W                                              32
#define GPRAM_BANK01493_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01493_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01494
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01494_DATA_W                                              32
#define GPRAM_BANK01494_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01494_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01495
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01495_DATA_W                                              32
#define GPRAM_BANK01495_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01495_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01496
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01496_DATA_W                                              32
#define GPRAM_BANK01496_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01496_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01497
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01497_DATA_W                                              32
#define GPRAM_BANK01497_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01497_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01498
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01498_DATA_W                                              32
#define GPRAM_BANK01498_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01498_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01499
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01499_DATA_W                                              32
#define GPRAM_BANK01499_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01499_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01500
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01500_DATA_W                                              32
#define GPRAM_BANK01500_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01500_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01501
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01501_DATA_W                                              32
#define GPRAM_BANK01501_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01501_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01502
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01502_DATA_W                                              32
#define GPRAM_BANK01502_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01502_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01503
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01503_DATA_W                                              32
#define GPRAM_BANK01503_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01503_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01504
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01504_DATA_W                                              32
#define GPRAM_BANK01504_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01504_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01505
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01505_DATA_W                                              32
#define GPRAM_BANK01505_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01505_DATA_S                                               0

