brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01506
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01506_DATA_W                                              32
#define GPRAM_BANK01506_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01506_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01507
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01507_DATA_W                                              32
#define GPRAM_BANK01507_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01507_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01508
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01508_DATA_W                                              32
#define GPRAM_BANK01508_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01508_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01509
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01509_DATA_W                                              32
#define GPRAM_BANK01509_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01509_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01510
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01510_DATA_W                                              32
#define GPRAM_BANK01510_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01510_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01511
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01511_DATA_W                                              32
#define GPRAM_BANK01511_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01511_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01512
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01512_DATA_W                                              32
#define GPRAM_BANK01512_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01512_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01513
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01513_DATA_W                                              32
#define GPRAM_BANK01513_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01513_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01514
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01514_DATA_W                                              32
#define GPRAM_BANK01514_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01514_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01515
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01515_DATA_W                                              32
#define GPRAM_BANK01515_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01515_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01516
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01516_DATA_W                                              32
#define GPRAM_BANK01516_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01516_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01517
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01517_DATA_W                                              32
#define GPRAM_BANK01517_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01517_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01518
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01518_DATA_W                                              32
#define GPRAM_BANK01518_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01518_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01519
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01519_DATA_W                                              32
#define GPRAM_BANK01519_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01519_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01520
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01520_DATA_W                                              32
#define GPRAM_BANK01520_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01520_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01521
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01521_DATA_W                                              32
#define GPRAM_BANK01521_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01521_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01522
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01522_DATA_W                                              32
#define GPRAM_BANK01522_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01522_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01523
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01523_DATA_W                                              32
#define GPRAM_BANK01523_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01523_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01524
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01524_DATA_W                                              32
#define GPRAM_BANK01524_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01524_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01525
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01525_DATA_W                                              32
#define GPRAM_BANK01525_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01525_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01526
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01526_DATA_W                                              32
#define GPRAM_BANK01526_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01526_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01527
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01527_DATA_W                                              32
#define GPRAM_BANK01527_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01527_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01528
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01528_DATA_W                                              32
#define GPRAM_BANK01528_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01528_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01529
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01529_DATA_W                                              32
#define GPRAM_BANK01529_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01529_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01530
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01530_DATA_W                                              32
#define GPRAM_BANK01530_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01530_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01531
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01531_DATA_W                                              32
#define GPRAM_BANK01531_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01531_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01532
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01532_DATA_W                                              32
#define GPRAM_BANK01532_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01532_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01533
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01533_DATA_W                                              32
#define GPRAM_BANK01533_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01533_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01534
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01534_DATA_W                                              32
#define GPRAM_BANK01534_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01534_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01535
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01535_DATA_W                                              32
#define GPRAM_BANK01535_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01535_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01536
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01536_DATA_W                                              32
#define GPRAM_BANK01536_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01536_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01537
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01537_DATA_W                                              32
#define GPRAM_BANK01537_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01537_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01538
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01538_DATA_W                                              32
#define GPRAM_BANK01538_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01538_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01539
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01539_DATA_W                                              32
#define GPRAM_BANK01539_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01539_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01540
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01540_DATA_W                                              32
#define GPRAM_BANK01540_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01540_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01541
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01541_DATA_W                                              32
#define GPRAM_BANK01541_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01541_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01542
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01542_DATA_W                                              32
#define GPRAM_BANK01542_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01542_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01543
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01543_DATA_W                                              32
#define GPRAM_BANK01543_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01543_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01544
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01544_DATA_W                                              32
#define GPRAM_BANK01544_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01544_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01545
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01545_DATA_W                                              32
#define GPRAM_BANK01545_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01545_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01546
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01546_DATA_W                                              32
#define GPRAM_BANK01546_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01546_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01547
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01547_DATA_W                                              32
#define GPRAM_BANK01547_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01547_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01548
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01548_DATA_W                                              32
#define GPRAM_BANK01548_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01548_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01549
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01549_DATA_W                                              32
#define GPRAM_BANK01549_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01549_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01550
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01550_DATA_W                                              32
#define GPRAM_BANK01550_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01550_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01551
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01551_DATA_W                                              32
#define GPRAM_BANK01551_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01551_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01552
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01552_DATA_W                                              32
#define GPRAM_BANK01552_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01552_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01553
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01553_DATA_W                                              32
#define GPRAM_BANK01553_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01553_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01554
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01554_DATA_W                                              32
#define GPRAM_BANK01554_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01554_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01555
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01555_DATA_W                                              32
#define GPRAM_BANK01555_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01555_DATA_S                                               0

