brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01556
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01556_DATA_W                                              32
#define GPRAM_BANK01556_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01556_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01557
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01557_DATA_W                                              32
#define GPRAM_BANK01557_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01557_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01558
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01558_DATA_W                                              32
#define GPRAM_BANK01558_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01558_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01559
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01559_DATA_W                                              32
#define GPRAM_BANK01559_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01559_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01560
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01560_DATA_W                                              32
#define GPRAM_BANK01560_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01560_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01561
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01561_DATA_W                                              32
#define GPRAM_BANK01561_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01561_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01562
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01562_DATA_W                                              32
#define GPRAM_BANK01562_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01562_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01563
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01563_DATA_W                                              32
#define GPRAM_BANK01563_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01563_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01564
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01564_DATA_W                                              32
#define GPRAM_BANK01564_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01564_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01565
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01565_DATA_W                                              32
#define GPRAM_BANK01565_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01565_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01566
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01566_DATA_W                                              32
#define GPRAM_BANK01566_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01566_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01567
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01567_DATA_W                                              32
#define GPRAM_BANK01567_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01567_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01568
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01568_DATA_W                                              32
#define GPRAM_BANK01568_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01568_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01569
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01569_DATA_W                                              32
#define GPRAM_BANK01569_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01569_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01570
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01570_DATA_W                                              32
#define GPRAM_BANK01570_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01570_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01571
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01571_DATA_W                                              32
#define GPRAM_BANK01571_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01571_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01572
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01572_DATA_W                                              32
#define GPRAM_BANK01572_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01572_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01573
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01573_DATA_W                                              32
#define GPRAM_BANK01573_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01573_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01574
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01574_DATA_W                                              32
#define GPRAM_BANK01574_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01574_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01575
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01575_DATA_W                                              32
#define GPRAM_BANK01575_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01575_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01576
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01576_DATA_W                                              32
#define GPRAM_BANK01576_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01576_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01577
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01577_DATA_W                                              32
#define GPRAM_BANK01577_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01577_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01578
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01578_DATA_W                                              32
#define GPRAM_BANK01578_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01578_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01579
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01579_DATA_W                                              32
#define GPRAM_BANK01579_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01579_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01580
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01580_DATA_W                                              32
#define GPRAM_BANK01580_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01580_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01581
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01581_DATA_W                                              32
#define GPRAM_BANK01581_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01581_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01582
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01582_DATA_W                                              32
#define GPRAM_BANK01582_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01582_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01583
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01583_DATA_W                                              32
#define GPRAM_BANK01583_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01583_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01584
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01584_DATA_W                                              32
#define GPRAM_BANK01584_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01584_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01585
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01585_DATA_W                                              32
#define GPRAM_BANK01585_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01585_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01586
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01586_DATA_W                                              32
#define GPRAM_BANK01586_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01586_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01587
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01587_DATA_W                                              32
#define GPRAM_BANK01587_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01587_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01588
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01588_DATA_W                                              32
#define GPRAM_BANK01588_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01588_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01589
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01589_DATA_W                                              32
#define GPRAM_BANK01589_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01589_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01590
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01590_DATA_W                                              32
#define GPRAM_BANK01590_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01590_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01591
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01591_DATA_W                                              32
#define GPRAM_BANK01591_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01591_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01592
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01592_DATA_W                                              32
#define GPRAM_BANK01592_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01592_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01593
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01593_DATA_W                                              32
#define GPRAM_BANK01593_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01593_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01594
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01594_DATA_W                                              32
#define GPRAM_BANK01594_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01594_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01595
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01595_DATA_W                                              32
#define GPRAM_BANK01595_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01595_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01596
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01596_DATA_W                                              32
#define GPRAM_BANK01596_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01596_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01597
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01597_DATA_W                                              32
#define GPRAM_BANK01597_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01597_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01598
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01598_DATA_W                                              32
#define GPRAM_BANK01598_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01598_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01599
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01599_DATA_W                                              32
#define GPRAM_BANK01599_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01599_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01600
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01600_DATA_W                                              32
#define GPRAM_BANK01600_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01600_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01601
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01601_DATA_W                                              32
#define GPRAM_BANK01601_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01601_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01602
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01602_DATA_W                                              32
#define GPRAM_BANK01602_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01602_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01603
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01603_DATA_W                                              32
#define GPRAM_BANK01603_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01603_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01604
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01604_DATA_W                                              32
#define GPRAM_BANK01604_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01604_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01605
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01605_DATA_W                                              32
#define GPRAM_BANK01605_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01605_DATA_S                                               0

