brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01606
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01606_DATA_W                                              32
#define GPRAM_BANK01606_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01606_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01607
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01607_DATA_W                                              32
#define GPRAM_BANK01607_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01607_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01608
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01608_DATA_W                                              32
#define GPRAM_BANK01608_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01608_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01609
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01609_DATA_W                                              32
#define GPRAM_BANK01609_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01609_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01610
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01610_DATA_W                                              32
#define GPRAM_BANK01610_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01610_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01611
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01611_DATA_W                                              32
#define GPRAM_BANK01611_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01611_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01612
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01612_DATA_W                                              32
#define GPRAM_BANK01612_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01612_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01613
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01613_DATA_W                                              32
#define GPRAM_BANK01613_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01613_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01614
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01614_DATA_W                                              32
#define GPRAM_BANK01614_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01614_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01615
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01615_DATA_W                                              32
#define GPRAM_BANK01615_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01615_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01616
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01616_DATA_W                                              32
#define GPRAM_BANK01616_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01616_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01617
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01617_DATA_W                                              32
#define GPRAM_BANK01617_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01617_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01618
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01618_DATA_W                                              32
#define GPRAM_BANK01618_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01618_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01619
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01619_DATA_W                                              32
#define GPRAM_BANK01619_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01619_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01620
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01620_DATA_W                                              32
#define GPRAM_BANK01620_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01620_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01621
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01621_DATA_W                                              32
#define GPRAM_BANK01621_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01621_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01622
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01622_DATA_W                                              32
#define GPRAM_BANK01622_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01622_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01623
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01623_DATA_W                                              32
#define GPRAM_BANK01623_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01623_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01624
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01624_DATA_W                                              32
#define GPRAM_BANK01624_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01624_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01625
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01625_DATA_W                                              32
#define GPRAM_BANK01625_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01625_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01626
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01626_DATA_W                                              32
#define GPRAM_BANK01626_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01626_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01627
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01627_DATA_W                                              32
#define GPRAM_BANK01627_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01627_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01628
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01628_DATA_W                                              32
#define GPRAM_BANK01628_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01628_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01629
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01629_DATA_W                                              32
#define GPRAM_BANK01629_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01629_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01630
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01630_DATA_W                                              32
#define GPRAM_BANK01630_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01630_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01631
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01631_DATA_W                                              32
#define GPRAM_BANK01631_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01631_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01632
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01632_DATA_W                                              32
#define GPRAM_BANK01632_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01632_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01633
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01633_DATA_W                                              32
#define GPRAM_BANK01633_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01633_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01634
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01634_DATA_W                                              32
#define GPRAM_BANK01634_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01634_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01635
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01635_DATA_W                                              32
#define GPRAM_BANK01635_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01635_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01636
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01636_DATA_W                                              32
#define GPRAM_BANK01636_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01636_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01637
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01637_DATA_W                                              32
#define GPRAM_BANK01637_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01637_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01638
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01638_DATA_W                                              32
#define GPRAM_BANK01638_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01638_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01639
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01639_DATA_W                                              32
#define GPRAM_BANK01639_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01639_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01640
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01640_DATA_W                                              32
#define GPRAM_BANK01640_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01640_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01641
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01641_DATA_W                                              32
#define GPRAM_BANK01641_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01641_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01642
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01642_DATA_W                                              32
#define GPRAM_BANK01642_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01642_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01643
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01643_DATA_W                                              32
#define GPRAM_BANK01643_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01643_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01644
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01644_DATA_W                                              32
#define GPRAM_BANK01644_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01644_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01645
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01645_DATA_W                                              32
#define GPRAM_BANK01645_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01645_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01646
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01646_DATA_W                                              32
#define GPRAM_BANK01646_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01646_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01647
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01647_DATA_W                                              32
#define GPRAM_BANK01647_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01647_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01648
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01648_DATA_W                                              32
#define GPRAM_BANK01648_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01648_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01649
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01649_DATA_W                                              32
#define GPRAM_BANK01649_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01649_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01650
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01650_DATA_W                                              32
#define GPRAM_BANK01650_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01650_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01651
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01651_DATA_W                                              32
#define GPRAM_BANK01651_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01651_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01652
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01652_DATA_W                                              32
#define GPRAM_BANK01652_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01652_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01653
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01653_DATA_W                                              32
#define GPRAM_BANK01653_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01653_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01654
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01654_DATA_W                                              32
#define GPRAM_BANK01654_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01654_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01655
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01655_DATA_W                                              32
#define GPRAM_BANK01655_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01655_DATA_S                                               0

