brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01656
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01656_DATA_W                                              32
#define GPRAM_BANK01656_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01656_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01657
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01657_DATA_W                                              32
#define GPRAM_BANK01657_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01657_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01658
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01658_DATA_W                                              32
#define GPRAM_BANK01658_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01658_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01659
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01659_DATA_W                                              32
#define GPRAM_BANK01659_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01659_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01660
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01660_DATA_W                                              32
#define GPRAM_BANK01660_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01660_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01661
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01661_DATA_W                                              32
#define GPRAM_BANK01661_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01661_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01662
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01662_DATA_W                                              32
#define GPRAM_BANK01662_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01662_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01663
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01663_DATA_W                                              32
#define GPRAM_BANK01663_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01663_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01664
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01664_DATA_W                                              32
#define GPRAM_BANK01664_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01664_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01665
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01665_DATA_W                                              32
#define GPRAM_BANK01665_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01665_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01666
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01666_DATA_W                                              32
#define GPRAM_BANK01666_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01666_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01667
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01667_DATA_W                                              32
#define GPRAM_BANK01667_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01667_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01668
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01668_DATA_W                                              32
#define GPRAM_BANK01668_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01668_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01669
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01669_DATA_W                                              32
#define GPRAM_BANK01669_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01669_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01670
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01670_DATA_W                                              32
#define GPRAM_BANK01670_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01670_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01671
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01671_DATA_W                                              32
#define GPRAM_BANK01671_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01671_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01672
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01672_DATA_W                                              32
#define GPRAM_BANK01672_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01672_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01673
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01673_DATA_W                                              32
#define GPRAM_BANK01673_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01673_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01674
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01674_DATA_W                                              32
#define GPRAM_BANK01674_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01674_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01675
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01675_DATA_W                                              32
#define GPRAM_BANK01675_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01675_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01676
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01676_DATA_W                                              32
#define GPRAM_BANK01676_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01676_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01677
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01677_DATA_W                                              32
#define GPRAM_BANK01677_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01677_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01678
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01678_DATA_W                                              32
#define GPRAM_BANK01678_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01678_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01679
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01679_DATA_W                                              32
#define GPRAM_BANK01679_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01679_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01680
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01680_DATA_W                                              32
#define GPRAM_BANK01680_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01680_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01681
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01681_DATA_W                                              32
#define GPRAM_BANK01681_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01681_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01682
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01682_DATA_W                                              32
#define GPRAM_BANK01682_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01682_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01683
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01683_DATA_W                                              32
#define GPRAM_BANK01683_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01683_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01684
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01684_DATA_W                                              32
#define GPRAM_BANK01684_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01684_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01685
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01685_DATA_W                                              32
#define GPRAM_BANK01685_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01685_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01686
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01686_DATA_W                                              32
#define GPRAM_BANK01686_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01686_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01687
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01687_DATA_W                                              32
#define GPRAM_BANK01687_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01687_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01688
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01688_DATA_W                                              32
#define GPRAM_BANK01688_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01688_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01689
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01689_DATA_W                                              32
#define GPRAM_BANK01689_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01689_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01690
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01690_DATA_W                                              32
#define GPRAM_BANK01690_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01690_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01691
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01691_DATA_W                                              32
#define GPRAM_BANK01691_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01691_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01692
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01692_DATA_W                                              32
#define GPRAM_BANK01692_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01692_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01693
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01693_DATA_W                                              32
#define GPRAM_BANK01693_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01693_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01694
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01694_DATA_W                                              32
#define GPRAM_BANK01694_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01694_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01695
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01695_DATA_W                                              32
#define GPRAM_BANK01695_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01695_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01696
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01696_DATA_W                                              32
#define GPRAM_BANK01696_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01696_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01697
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01697_DATA_W                                              32
#define GPRAM_BANK01697_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01697_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01698
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01698_DATA_W                                              32
#define GPRAM_BANK01698_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01698_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01699
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01699_DATA_W                                              32
#define GPRAM_BANK01699_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01699_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01700
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01700_DATA_W                                              32
#define GPRAM_BANK01700_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01700_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01701
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01701_DATA_W                                              32
#define GPRAM_BANK01701_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01701_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01702
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01702_DATA_W                                              32
#define GPRAM_BANK01702_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01702_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01703
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01703_DATA_W                                              32
#define GPRAM_BANK01703_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01703_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01704
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01704_DATA_W                                              32
#define GPRAM_BANK01704_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01704_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01705
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01705_DATA_W                                              32
#define GPRAM_BANK01705_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01705_DATA_S                                               0

