brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01706
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01706_DATA_W                                              32
#define GPRAM_BANK01706_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01706_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01707
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01707_DATA_W                                              32
#define GPRAM_BANK01707_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01707_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01708
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01708_DATA_W                                              32
#define GPRAM_BANK01708_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01708_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01709
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01709_DATA_W                                              32
#define GPRAM_BANK01709_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01709_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01710
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01710_DATA_W                                              32
#define GPRAM_BANK01710_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01710_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01711
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01711_DATA_W                                              32
#define GPRAM_BANK01711_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01711_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01712
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01712_DATA_W                                              32
#define GPRAM_BANK01712_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01712_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01713
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01713_DATA_W                                              32
#define GPRAM_BANK01713_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01713_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01714
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01714_DATA_W                                              32
#define GPRAM_BANK01714_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01714_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01715
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01715_DATA_W                                              32
#define GPRAM_BANK01715_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01715_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01716
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01716_DATA_W                                              32
#define GPRAM_BANK01716_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01716_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01717
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01717_DATA_W                                              32
#define GPRAM_BANK01717_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01717_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01718
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01718_DATA_W                                              32
#define GPRAM_BANK01718_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01718_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01719
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01719_DATA_W                                              32
#define GPRAM_BANK01719_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01719_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01720
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01720_DATA_W                                              32
#define GPRAM_BANK01720_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01720_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01721
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01721_DATA_W                                              32
#define GPRAM_BANK01721_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01721_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01722
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01722_DATA_W                                              32
#define GPRAM_BANK01722_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01722_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01723
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01723_DATA_W                                              32
#define GPRAM_BANK01723_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01723_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01724
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01724_DATA_W                                              32
#define GPRAM_BANK01724_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01724_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01725
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01725_DATA_W                                              32
#define GPRAM_BANK01725_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01725_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01726
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01726_DATA_W                                              32
#define GPRAM_BANK01726_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01726_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01727
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01727_DATA_W                                              32
#define GPRAM_BANK01727_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01727_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01728
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01728_DATA_W                                              32
#define GPRAM_BANK01728_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01728_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01729
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01729_DATA_W                                              32
#define GPRAM_BANK01729_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01729_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01730
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01730_DATA_W                                              32
#define GPRAM_BANK01730_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01730_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01731
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01731_DATA_W                                              32
#define GPRAM_BANK01731_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01731_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01732
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01732_DATA_W                                              32
#define GPRAM_BANK01732_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01732_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01733
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01733_DATA_W                                              32
#define GPRAM_BANK01733_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01733_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01734
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01734_DATA_W                                              32
#define GPRAM_BANK01734_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01734_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01735
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01735_DATA_W                                              32
#define GPRAM_BANK01735_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01735_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01736
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01736_DATA_W                                              32
#define GPRAM_BANK01736_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01736_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01737
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01737_DATA_W                                              32
#define GPRAM_BANK01737_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01737_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01738
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01738_DATA_W                                              32
#define GPRAM_BANK01738_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01738_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01739
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01739_DATA_W                                              32
#define GPRAM_BANK01739_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01739_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01740
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01740_DATA_W                                              32
#define GPRAM_BANK01740_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01740_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01741
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01741_DATA_W                                              32
#define GPRAM_BANK01741_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01741_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01742
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01742_DATA_W                                              32
#define GPRAM_BANK01742_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01742_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01743
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01743_DATA_W                                              32
#define GPRAM_BANK01743_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01743_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01744
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01744_DATA_W                                              32
#define GPRAM_BANK01744_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01744_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01745
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01745_DATA_W                                              32
#define GPRAM_BANK01745_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01745_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01746
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01746_DATA_W                                              32
#define GPRAM_BANK01746_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01746_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01747
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01747_DATA_W                                              32
#define GPRAM_BANK01747_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01747_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01748
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01748_DATA_W                                              32
#define GPRAM_BANK01748_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01748_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01749
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01749_DATA_W                                              32
#define GPRAM_BANK01749_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01749_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01750
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01750_DATA_W                                              32
#define GPRAM_BANK01750_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01750_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01751
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01751_DATA_W                                              32
#define GPRAM_BANK01751_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01751_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01752
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01752_DATA_W                                              32
#define GPRAM_BANK01752_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01752_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01753
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01753_DATA_W                                              32
#define GPRAM_BANK01753_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01753_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01754
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01754_DATA_W                                              32
#define GPRAM_BANK01754_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01754_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01755
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01755_DATA_W                                              32
#define GPRAM_BANK01755_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01755_DATA_S                                               0

