brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01756
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01756_DATA_W                                              32
#define GPRAM_BANK01756_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01756_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01757
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01757_DATA_W                                              32
#define GPRAM_BANK01757_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01757_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01758
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01758_DATA_W                                              32
#define GPRAM_BANK01758_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01758_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01759
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01759_DATA_W                                              32
#define GPRAM_BANK01759_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01759_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01760
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01760_DATA_W                                              32
#define GPRAM_BANK01760_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01760_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01761
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01761_DATA_W                                              32
#define GPRAM_BANK01761_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01761_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01762
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01762_DATA_W                                              32
#define GPRAM_BANK01762_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01762_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01763
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01763_DATA_W                                              32
#define GPRAM_BANK01763_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01763_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01764
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01764_DATA_W                                              32
#define GPRAM_BANK01764_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01764_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01765
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01765_DATA_W                                              32
#define GPRAM_BANK01765_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01765_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01766
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01766_DATA_W                                              32
#define GPRAM_BANK01766_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01766_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01767
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01767_DATA_W                                              32
#define GPRAM_BANK01767_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01767_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01768
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01768_DATA_W                                              32
#define GPRAM_BANK01768_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01768_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01769
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01769_DATA_W                                              32
#define GPRAM_BANK01769_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01769_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01770
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01770_DATA_W                                              32
#define GPRAM_BANK01770_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01770_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01771
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01771_DATA_W                                              32
#define GPRAM_BANK01771_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01771_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01772
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01772_DATA_W                                              32
#define GPRAM_BANK01772_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01772_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01773
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01773_DATA_W                                              32
#define GPRAM_BANK01773_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01773_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01774
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01774_DATA_W                                              32
#define GPRAM_BANK01774_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01774_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01775
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01775_DATA_W                                              32
#define GPRAM_BANK01775_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01775_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01776
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01776_DATA_W                                              32
#define GPRAM_BANK01776_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01776_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01777
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01777_DATA_W                                              32
#define GPRAM_BANK01777_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01777_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01778
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01778_DATA_W                                              32
#define GPRAM_BANK01778_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01778_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01779
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01779_DATA_W                                              32
#define GPRAM_BANK01779_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01779_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01780
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01780_DATA_W                                              32
#define GPRAM_BANK01780_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01780_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01781
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01781_DATA_W                                              32
#define GPRAM_BANK01781_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01781_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01782
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01782_DATA_W                                              32
#define GPRAM_BANK01782_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01782_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01783
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01783_DATA_W                                              32
#define GPRAM_BANK01783_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01783_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01784
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01784_DATA_W                                              32
#define GPRAM_BANK01784_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01784_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01785
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01785_DATA_W                                              32
#define GPRAM_BANK01785_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01785_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01786
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01786_DATA_W                                              32
#define GPRAM_BANK01786_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01786_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01787
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01787_DATA_W                                              32
#define GPRAM_BANK01787_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01787_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01788
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01788_DATA_W                                              32
#define GPRAM_BANK01788_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01788_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01789
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01789_DATA_W                                              32
#define GPRAM_BANK01789_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01789_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01790
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01790_DATA_W                                              32
#define GPRAM_BANK01790_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01790_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01791
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01791_DATA_W                                              32
#define GPRAM_BANK01791_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01791_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01792
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01792_DATA_W                                              32
#define GPRAM_BANK01792_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01792_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01793
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01793_DATA_W                                              32
#define GPRAM_BANK01793_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01793_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01794
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01794_DATA_W                                              32
#define GPRAM_BANK01794_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01794_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01795
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01795_DATA_W                                              32
#define GPRAM_BANK01795_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01795_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01796
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01796_DATA_W                                              32
#define GPRAM_BANK01796_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01796_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01797
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01797_DATA_W                                              32
#define GPRAM_BANK01797_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01797_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01798
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01798_DATA_W                                              32
#define GPRAM_BANK01798_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01798_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01799
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01799_DATA_W                                              32
#define GPRAM_BANK01799_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01799_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01800
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01800_DATA_W                                              32
#define GPRAM_BANK01800_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01800_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01801
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01801_DATA_W                                              32
#define GPRAM_BANK01801_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01801_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01802
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01802_DATA_W                                              32
#define GPRAM_BANK01802_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01802_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01803
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01803_DATA_W                                              32
#define GPRAM_BANK01803_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01803_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01804
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01804_DATA_W                                              32
#define GPRAM_BANK01804_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01804_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01805
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01805_DATA_W                                              32
#define GPRAM_BANK01805_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01805_DATA_S                                               0

