brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01806
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01806_DATA_W                                              32
#define GPRAM_BANK01806_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01806_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01807
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01807_DATA_W                                              32
#define GPRAM_BANK01807_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01807_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01808
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01808_DATA_W                                              32
#define GPRAM_BANK01808_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01808_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01809
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01809_DATA_W                                              32
#define GPRAM_BANK01809_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01809_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01810
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01810_DATA_W                                              32
#define GPRAM_BANK01810_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01810_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01811
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01811_DATA_W                                              32
#define GPRAM_BANK01811_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01811_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01812
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01812_DATA_W                                              32
#define GPRAM_BANK01812_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01812_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01813
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01813_DATA_W                                              32
#define GPRAM_BANK01813_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01813_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01814
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01814_DATA_W                                              32
#define GPRAM_BANK01814_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01814_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01815
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01815_DATA_W                                              32
#define GPRAM_BANK01815_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01815_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01816
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01816_DATA_W                                              32
#define GPRAM_BANK01816_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01816_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01817
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01817_DATA_W                                              32
#define GPRAM_BANK01817_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01817_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01818
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01818_DATA_W                                              32
#define GPRAM_BANK01818_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01818_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01819
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01819_DATA_W                                              32
#define GPRAM_BANK01819_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01819_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01820
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01820_DATA_W                                              32
#define GPRAM_BANK01820_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01820_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01821
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01821_DATA_W                                              32
#define GPRAM_BANK01821_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01821_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01822
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01822_DATA_W                                              32
#define GPRAM_BANK01822_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01822_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01823
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01823_DATA_W                                              32
#define GPRAM_BANK01823_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01823_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01824
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01824_DATA_W                                              32
#define GPRAM_BANK01824_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01824_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01825
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01825_DATA_W                                              32
#define GPRAM_BANK01825_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01825_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01826
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01826_DATA_W                                              32
#define GPRAM_BANK01826_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01826_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01827
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01827_DATA_W                                              32
#define GPRAM_BANK01827_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01827_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01828
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01828_DATA_W                                              32
#define GPRAM_BANK01828_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01828_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01829
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01829_DATA_W                                              32
#define GPRAM_BANK01829_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01829_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01830
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01830_DATA_W                                              32
#define GPRAM_BANK01830_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01830_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01831
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01831_DATA_W                                              32
#define GPRAM_BANK01831_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01831_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01832
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01832_DATA_W                                              32
#define GPRAM_BANK01832_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01832_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01833
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01833_DATA_W                                              32
#define GPRAM_BANK01833_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01833_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01834
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01834_DATA_W                                              32
#define GPRAM_BANK01834_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01834_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01835
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01835_DATA_W                                              32
#define GPRAM_BANK01835_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01835_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01836
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01836_DATA_W                                              32
#define GPRAM_BANK01836_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01836_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01837
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01837_DATA_W                                              32
#define GPRAM_BANK01837_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01837_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01838
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01838_DATA_W                                              32
#define GPRAM_BANK01838_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01838_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01839
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01839_DATA_W                                              32
#define GPRAM_BANK01839_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01839_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01840
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01840_DATA_W                                              32
#define GPRAM_BANK01840_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01840_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01841
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01841_DATA_W                                              32
#define GPRAM_BANK01841_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01841_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01842
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01842_DATA_W                                              32
#define GPRAM_BANK01842_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01842_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01843
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01843_DATA_W                                              32
#define GPRAM_BANK01843_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01843_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01844
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01844_DATA_W                                              32
#define GPRAM_BANK01844_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01844_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01845
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01845_DATA_W                                              32
#define GPRAM_BANK01845_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01845_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01846
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01846_DATA_W                                              32
#define GPRAM_BANK01846_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01846_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01847
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01847_DATA_W                                              32
#define GPRAM_BANK01847_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01847_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01848
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01848_DATA_W                                              32
#define GPRAM_BANK01848_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01848_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01849
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01849_DATA_W                                              32
#define GPRAM_BANK01849_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01849_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01850
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01850_DATA_W                                              32
#define GPRAM_BANK01850_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01850_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01851
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01851_DATA_W                                              32
#define GPRAM_BANK01851_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01851_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01852
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01852_DATA_W                                              32
#define GPRAM_BANK01852_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01852_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01853
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01853_DATA_W                                              32
#define GPRAM_BANK01853_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01853_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01854
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01854_DATA_W                                              32
#define GPRAM_BANK01854_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01854_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01855
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01855_DATA_W                                              32
#define GPRAM_BANK01855_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01855_DATA_S                                               0

