brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01856
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01856_DATA_W                                              32
#define GPRAM_BANK01856_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01856_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01857
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01857_DATA_W                                              32
#define GPRAM_BANK01857_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01857_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01858
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01858_DATA_W                                              32
#define GPRAM_BANK01858_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01858_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01859
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01859_DATA_W                                              32
#define GPRAM_BANK01859_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01859_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01860
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01860_DATA_W                                              32
#define GPRAM_BANK01860_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01860_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01861
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01861_DATA_W                                              32
#define GPRAM_BANK01861_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01861_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01862
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01862_DATA_W                                              32
#define GPRAM_BANK01862_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01862_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01863
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01863_DATA_W                                              32
#define GPRAM_BANK01863_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01863_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01864
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01864_DATA_W                                              32
#define GPRAM_BANK01864_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01864_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01865
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01865_DATA_W                                              32
#define GPRAM_BANK01865_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01865_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01866
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01866_DATA_W                                              32
#define GPRAM_BANK01866_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01866_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01867
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01867_DATA_W                                              32
#define GPRAM_BANK01867_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01867_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01868
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01868_DATA_W                                              32
#define GPRAM_BANK01868_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01868_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01869
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01869_DATA_W                                              32
#define GPRAM_BANK01869_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01869_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01870
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01870_DATA_W                                              32
#define GPRAM_BANK01870_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01870_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01871
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01871_DATA_W                                              32
#define GPRAM_BANK01871_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01871_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01872
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01872_DATA_W                                              32
#define GPRAM_BANK01872_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01872_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01873
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01873_DATA_W                                              32
#define GPRAM_BANK01873_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01873_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01874
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01874_DATA_W                                              32
#define GPRAM_BANK01874_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01874_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01875
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01875_DATA_W                                              32
#define GPRAM_BANK01875_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01875_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01876
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01876_DATA_W                                              32
#define GPRAM_BANK01876_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01876_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01877
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01877_DATA_W                                              32
#define GPRAM_BANK01877_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01877_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01878
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01878_DATA_W                                              32
#define GPRAM_BANK01878_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01878_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01879
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01879_DATA_W                                              32
#define GPRAM_BANK01879_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01879_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01880
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01880_DATA_W                                              32
#define GPRAM_BANK01880_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01880_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01881
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01881_DATA_W                                              32
#define GPRAM_BANK01881_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01881_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01882
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01882_DATA_W                                              32
#define GPRAM_BANK01882_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01882_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01883
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01883_DATA_W                                              32
#define GPRAM_BANK01883_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01883_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01884
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01884_DATA_W                                              32
#define GPRAM_BANK01884_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01884_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01885
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01885_DATA_W                                              32
#define GPRAM_BANK01885_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01885_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01886
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01886_DATA_W                                              32
#define GPRAM_BANK01886_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01886_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01887
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01887_DATA_W                                              32
#define GPRAM_BANK01887_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01887_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01888
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01888_DATA_W                                              32
#define GPRAM_BANK01888_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01888_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01889
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01889_DATA_W                                              32
#define GPRAM_BANK01889_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01889_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01890
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01890_DATA_W                                              32
#define GPRAM_BANK01890_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01890_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01891
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01891_DATA_W                                              32
#define GPRAM_BANK01891_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01891_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01892
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01892_DATA_W                                              32
#define GPRAM_BANK01892_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01892_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01893
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01893_DATA_W                                              32
#define GPRAM_BANK01893_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01893_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01894
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01894_DATA_W                                              32
#define GPRAM_BANK01894_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01894_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01895
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01895_DATA_W                                              32
#define GPRAM_BANK01895_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01895_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01896
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01896_DATA_W                                              32
#define GPRAM_BANK01896_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01896_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01897
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01897_DATA_W                                              32
#define GPRAM_BANK01897_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01897_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01898
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01898_DATA_W                                              32
#define GPRAM_BANK01898_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01898_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01899
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01899_DATA_W                                              32
#define GPRAM_BANK01899_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01899_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01900
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01900_DATA_W                                              32
#define GPRAM_BANK01900_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01900_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01901
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01901_DATA_W                                              32
#define GPRAM_BANK01901_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01901_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01902
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01902_DATA_W                                              32
#define GPRAM_BANK01902_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01902_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01903
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01903_DATA_W                                              32
#define GPRAM_BANK01903_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01903_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01904
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01904_DATA_W                                              32
#define GPRAM_BANK01904_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01904_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01905
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01905_DATA_W                                              32
#define GPRAM_BANK01905_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01905_DATA_S                                               0

