brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01906
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01906_DATA_W                                              32
#define GPRAM_BANK01906_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01906_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01907
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01907_DATA_W                                              32
#define GPRAM_BANK01907_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01907_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01908
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01908_DATA_W                                              32
#define GPRAM_BANK01908_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01908_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01909
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01909_DATA_W                                              32
#define GPRAM_BANK01909_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01909_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01910
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01910_DATA_W                                              32
#define GPRAM_BANK01910_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01910_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01911
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01911_DATA_W                                              32
#define GPRAM_BANK01911_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01911_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01912
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01912_DATA_W                                              32
#define GPRAM_BANK01912_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01912_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01913
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01913_DATA_W                                              32
#define GPRAM_BANK01913_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01913_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01914
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01914_DATA_W                                              32
#define GPRAM_BANK01914_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01914_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01915
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01915_DATA_W                                              32
#define GPRAM_BANK01915_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01915_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01916
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01916_DATA_W                                              32
#define GPRAM_BANK01916_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01916_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01917
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01917_DATA_W                                              32
#define GPRAM_BANK01917_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01917_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01918
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01918_DATA_W                                              32
#define GPRAM_BANK01918_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01918_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01919
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01919_DATA_W                                              32
#define GPRAM_BANK01919_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01919_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01920
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01920_DATA_W                                              32
#define GPRAM_BANK01920_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01920_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01921
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01921_DATA_W                                              32
#define GPRAM_BANK01921_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01921_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01922
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01922_DATA_W                                              32
#define GPRAM_BANK01922_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01922_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01923
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01923_DATA_W                                              32
#define GPRAM_BANK01923_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01923_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01924
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01924_DATA_W                                              32
#define GPRAM_BANK01924_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01924_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01925
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01925_DATA_W                                              32
#define GPRAM_BANK01925_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01925_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01926
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01926_DATA_W                                              32
#define GPRAM_BANK01926_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01926_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01927
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01927_DATA_W                                              32
#define GPRAM_BANK01927_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01927_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01928
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01928_DATA_W                                              32
#define GPRAM_BANK01928_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01928_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01929
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01929_DATA_W                                              32
#define GPRAM_BANK01929_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01929_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01930
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01930_DATA_W                                              32
#define GPRAM_BANK01930_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01930_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01931
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01931_DATA_W                                              32
#define GPRAM_BANK01931_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01931_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01932
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01932_DATA_W                                              32
#define GPRAM_BANK01932_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01932_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01933
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01933_DATA_W                                              32
#define GPRAM_BANK01933_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01933_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01934
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01934_DATA_W                                              32
#define GPRAM_BANK01934_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01934_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01935
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01935_DATA_W                                              32
#define GPRAM_BANK01935_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01935_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01936
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01936_DATA_W                                              32
#define GPRAM_BANK01936_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01936_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01937
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01937_DATA_W                                              32
#define GPRAM_BANK01937_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01937_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01938
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01938_DATA_W                                              32
#define GPRAM_BANK01938_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01938_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01939
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01939_DATA_W                                              32
#define GPRAM_BANK01939_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01939_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01940
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01940_DATA_W                                              32
#define GPRAM_BANK01940_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01940_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01941
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01941_DATA_W                                              32
#define GPRAM_BANK01941_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01941_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01942
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01942_DATA_W                                              32
#define GPRAM_BANK01942_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01942_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01943
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01943_DATA_W                                              32
#define GPRAM_BANK01943_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01943_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01944
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01944_DATA_W                                              32
#define GPRAM_BANK01944_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01944_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01945
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01945_DATA_W                                              32
#define GPRAM_BANK01945_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01945_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01946
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01946_DATA_W                                              32
#define GPRAM_BANK01946_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01946_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01947
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01947_DATA_W                                              32
#define GPRAM_BANK01947_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01947_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01948
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01948_DATA_W                                              32
#define GPRAM_BANK01948_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01948_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01949
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01949_DATA_W                                              32
#define GPRAM_BANK01949_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01949_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01950
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01950_DATA_W                                              32
#define GPRAM_BANK01950_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01950_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01951
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01951_DATA_W                                              32
#define GPRAM_BANK01951_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01951_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01952
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01952_DATA_W                                              32
#define GPRAM_BANK01952_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01952_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01953
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01953_DATA_W                                              32
#define GPRAM_BANK01953_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01953_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01954
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01954_DATA_W                                              32
#define GPRAM_BANK01954_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01954_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01955
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01955_DATA_W                                              32
#define GPRAM_BANK01955_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01955_DATA_S                                               0

