brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK01956
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01956_DATA_W                                              32
#define GPRAM_BANK01956_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01956_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01957
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01957_DATA_W                                              32
#define GPRAM_BANK01957_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01957_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01958
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01958_DATA_W                                              32
#define GPRAM_BANK01958_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01958_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01959
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01959_DATA_W                                              32
#define GPRAM_BANK01959_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01959_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01960
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01960_DATA_W                                              32
#define GPRAM_BANK01960_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01960_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01961
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01961_DATA_W                                              32
#define GPRAM_BANK01961_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01961_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01962
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01962_DATA_W                                              32
#define GPRAM_BANK01962_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01962_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01963
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01963_DATA_W                                              32
#define GPRAM_BANK01963_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01963_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01964
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01964_DATA_W                                              32
#define GPRAM_BANK01964_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01964_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01965
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01965_DATA_W                                              32
#define GPRAM_BANK01965_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01965_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01966
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01966_DATA_W                                              32
#define GPRAM_BANK01966_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01966_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01967
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01967_DATA_W                                              32
#define GPRAM_BANK01967_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01967_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01968
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01968_DATA_W                                              32
#define GPRAM_BANK01968_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01968_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01969
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01969_DATA_W                                              32
#define GPRAM_BANK01969_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01969_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01970
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01970_DATA_W                                              32
#define GPRAM_BANK01970_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01970_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01971
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01971_DATA_W                                              32
#define GPRAM_BANK01971_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01971_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01972
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01972_DATA_W                                              32
#define GPRAM_BANK01972_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01972_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01973
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01973_DATA_W                                              32
#define GPRAM_BANK01973_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01973_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01974
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01974_DATA_W                                              32
#define GPRAM_BANK01974_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01974_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01975
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01975_DATA_W                                              32
#define GPRAM_BANK01975_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01975_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01976
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01976_DATA_W                                              32
#define GPRAM_BANK01976_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01976_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01977
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01977_DATA_W                                              32
#define GPRAM_BANK01977_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01977_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01978
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01978_DATA_W                                              32
#define GPRAM_BANK01978_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01978_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01979
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01979_DATA_W                                              32
#define GPRAM_BANK01979_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01979_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01980
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01980_DATA_W                                              32
#define GPRAM_BANK01980_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01980_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01981
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01981_DATA_W                                              32
#define GPRAM_BANK01981_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01981_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01982
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01982_DATA_W                                              32
#define GPRAM_BANK01982_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01982_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01983
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01983_DATA_W                                              32
#define GPRAM_BANK01983_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01983_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01984
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01984_DATA_W                                              32
#define GPRAM_BANK01984_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01984_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01985
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01985_DATA_W                                              32
#define GPRAM_BANK01985_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01985_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01986
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01986_DATA_W                                              32
#define GPRAM_BANK01986_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01986_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01987
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01987_DATA_W                                              32
#define GPRAM_BANK01987_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01987_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01988
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01988_DATA_W                                              32
#define GPRAM_BANK01988_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01988_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01989
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01989_DATA_W                                              32
#define GPRAM_BANK01989_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01989_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01990
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01990_DATA_W                                              32
#define GPRAM_BANK01990_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01990_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01991
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01991_DATA_W                                              32
#define GPRAM_BANK01991_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01991_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01992
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01992_DATA_W                                              32
#define GPRAM_BANK01992_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01992_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01993
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01993_DATA_W                                              32
#define GPRAM_BANK01993_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01993_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01994
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01994_DATA_W                                              32
#define GPRAM_BANK01994_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01994_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01995
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01995_DATA_W                                              32
#define GPRAM_BANK01995_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01995_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01996
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01996_DATA_W                                              32
#define GPRAM_BANK01996_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01996_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01997
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01997_DATA_W                                              32
#define GPRAM_BANK01997_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01997_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01998
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01998_DATA_W                                              32
#define GPRAM_BANK01998_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01998_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK01999
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK01999_DATA_W                                              32
#define GPRAM_BANK01999_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK01999_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02000
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02000_DATA_W                                              32
#define GPRAM_BANK02000_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02000_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02001
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02001_DATA_W                                              32
#define GPRAM_BANK02001_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02001_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02002
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02002_DATA_W                                              32
#define GPRAM_BANK02002_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02002_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02003
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02003_DATA_W                                              32
#define GPRAM_BANK02003_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02003_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02004
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02004_DATA_W                                              32
#define GPRAM_BANK02004_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02004_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02005
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02005_DATA_W                                              32
#define GPRAM_BANK02005_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02005_DATA_S                                               0

