brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_gpram.h
//*****************************************************************************
//
// Register: GPRAM_O_BANK02006
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02006_DATA_W                                              32
#define GPRAM_BANK02006_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02006_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02007
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02007_DATA_W                                              32
#define GPRAM_BANK02007_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02007_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02008
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02008_DATA_W                                              32
#define GPRAM_BANK02008_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02008_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02009
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02009_DATA_W                                              32
#define GPRAM_BANK02009_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02009_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02010
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02010_DATA_W                                              32
#define GPRAM_BANK02010_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02010_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02011
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02011_DATA_W                                              32
#define GPRAM_BANK02011_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02011_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02012
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02012_DATA_W                                              32
#define GPRAM_BANK02012_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02012_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02013
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02013_DATA_W                                              32
#define GPRAM_BANK02013_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02013_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02014
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02014_DATA_W                                              32
#define GPRAM_BANK02014_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02014_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02015
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02015_DATA_W                                              32
#define GPRAM_BANK02015_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02015_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02016
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02016_DATA_W                                              32
#define GPRAM_BANK02016_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02016_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02017
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02017_DATA_W                                              32
#define GPRAM_BANK02017_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02017_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02018
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02018_DATA_W                                              32
#define GPRAM_BANK02018_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02018_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02019
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02019_DATA_W                                              32
#define GPRAM_BANK02019_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02019_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02020
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02020_DATA_W                                              32
#define GPRAM_BANK02020_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02020_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02021
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02021_DATA_W                                              32
#define GPRAM_BANK02021_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02021_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02022
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02022_DATA_W                                              32
#define GPRAM_BANK02022_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02022_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02023
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02023_DATA_W                                              32
#define GPRAM_BANK02023_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02023_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02024
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02024_DATA_W                                              32
#define GPRAM_BANK02024_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02024_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02025
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02025_DATA_W                                              32
#define GPRAM_BANK02025_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02025_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02026
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02026_DATA_W                                              32
#define GPRAM_BANK02026_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02026_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02027
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02027_DATA_W                                              32
#define GPRAM_BANK02027_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02027_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02028
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02028_DATA_W                                              32
#define GPRAM_BANK02028_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02028_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02029
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02029_DATA_W                                              32
#define GPRAM_BANK02029_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02029_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02030
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02030_DATA_W                                              32
#define GPRAM_BANK02030_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02030_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02031
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02031_DATA_W                                              32
#define GPRAM_BANK02031_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02031_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02032
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02032_DATA_W                                              32
#define GPRAM_BANK02032_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02032_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02033
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02033_DATA_W                                              32
#define GPRAM_BANK02033_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02033_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02034
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02034_DATA_W                                              32
#define GPRAM_BANK02034_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02034_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02035
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02035_DATA_W                                              32
#define GPRAM_BANK02035_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02035_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02036
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02036_DATA_W                                              32
#define GPRAM_BANK02036_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02036_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02037
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02037_DATA_W                                              32
#define GPRAM_BANK02037_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02037_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02038
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02038_DATA_W                                              32
#define GPRAM_BANK02038_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02038_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02039
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02039_DATA_W                                              32
#define GPRAM_BANK02039_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02039_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02040
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02040_DATA_W                                              32
#define GPRAM_BANK02040_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02040_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02041
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02041_DATA_W                                              32
#define GPRAM_BANK02041_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02041_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02042
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02042_DATA_W                                              32
#define GPRAM_BANK02042_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02042_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02043
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02043_DATA_W                                              32
#define GPRAM_BANK02043_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02043_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02044
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02044_DATA_W                                              32
#define GPRAM_BANK02044_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02044_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02045
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02045_DATA_W                                              32
#define GPRAM_BANK02045_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02045_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02046
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02046_DATA_W                                              32
#define GPRAM_BANK02046_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02046_DATA_S                                               0

//*****************************************************************************
//
// Register: GPRAM_O_BANK02047
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// RAM data
#define GPRAM_BANK02047_DATA_W                                              32
#define GPRAM_BANK02047_DATA_M                                      0xFFFFFFFF
#define GPRAM_BANK02047_DATA_S                                               0


#endif // __GPRAM__
